[Killed] PublicVisibility
AppConfiguration.php:16:5
     ) {
     }
 
-    public function getAppName(): string
+    protected function getAppName() : string
     {
         return $this->appName;
killedBy: Shopware\App\SDK\Tests\AppConfigurationTest::testStruct
statusReason: 1) Shopware\App\SDK\Tests\AppConfigurationTest::testStruct
Error: Call to protected method Shopware\App\SDK\AppConfiguration::getAppName() from scope Shopware\App\SDK\Tests\AppConfigurationTest

/home/lernhart/work/shopware/app-php-sdk/tests/AppConfigurationTest.php:22

2) Shopware\App\SDK\Tests\Registration\RegistrationServiceTest::testRegisterMessageIsLogged
Error: Call to protected method Shopw

[Killed] PublicVisibility
AppConfiguration.php:21:5
         return $this->appName;
     }
 
-    public function getAppSecret(): string
+    protected function getAppSecret() : string
     {
         return $this->appSecret;
killedBy: Shopware\App\SDK\Tests\Authentication\RequestVerifierTest::testAuthenticateRegistrationRequestInvalidSignature
statusReason: 1) Shopware\App\SDK\Tests\Authentication\RequestVerifierTest::testAuthenticateRegistrationRequestInvalidSignature
Failed asserting that exception of type "Error" matches expected exception "Shopware\App\SDK\Exception\SignatureInvalidException". Message was: "Call to protected method Shopware\App\SDK\AppConfiguration::getAppSecret() from scope Shopware\App\SDK\Authentication\RequestVerifier" at
/ho

[Killed] PublicVisibility
AppConfiguration.php:26:5
         return $this->appSecret;
     }
 
-    public function getRegistrationConfirmUrl(): string
+    protected function getRegistrationConfirmUrl() : string
     {
         return $this->registrationConfirmationUrl;
killedBy: Shopware\App\SDK\Tests\Registration\RegistrationServiceTest::testRegisterCreate
statusReason: 1) Shopware\App\SDK\Tests\Registration\RegistrationServiceTest::testRegisterCreate
Error: Call to protected method Shopware\App\SDK\AppConfiguration::getRegistrationConfirmUrl() from scope Shopware\App\SDK\Registration\RegistrationService

/home/lernhart/work/shopware/app-php-sdk/src/Registration/RegistrationService.php:75
/home/lernhart/work/shopware/app-php-sdk/tests/Registration/RegistrationSer
