[Killed] PublicVisibility
Authentication/RequestVerifier.php:23:5
      * @throws SignatureInvalidException
      * @throws SignatureNotFoundException
      */
-    public function authenticateRegistrationRequest(RequestInterface $request, AppConfiguration $appConfiguration): void
+    protected function authenticateRegistrationRequest(RequestInterface $request, AppConfiguration $appConfiguration) : void
     {
         $signature = $this->getSignatureFromHeader($request, self::SHOPWARE_APP_SIGNATURE_HEADER);
killedBy: Shopware\App\SDK\Tests\Authentication\RequestVerifierTest::testAuthenticateRegistrationRequestMissingHeader
statusReason: 1) Shopware\App\SDK\Tests\Authentication\RequestVerifierTest::testAuthenticateRegistrationRequestMissingHeader
/home/lernhart/work/shopware/app-php-sdk/tests/Authentication/RequestVerifierTest.php:31
.

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Killed] FunctionCallRemoval
Authentication/RequestVerifier.php:27:9
     {
         $signature = $this->getSignatureFromHeader($request, self::SHOPWARE_APP_SIGNATURE_HEADER);
 
-        parse_str($request->getUri()->getQuery(), $queries);
+        
 
         if (!isset($queries['shop-id'], $queries['shop-url'], $queries['timestamp'])) {
killedBy: Shopware\App\SDK\Tests\Authentication\RequestVerifierTest::testAuthenticateRegistrationRequestInvalidSignature
statusReason: 1) Shopware\App\SDK\Tests\Authentication\RequestVerifierTest::testAuthenticateRegistrationRequestInvalidSignature
Failed asserting that exception of type "Shopware\App\SDK\Exception\SignatureNotFoundException" matches expected exception "Shopware\App\SDK\Exception\SignatureInvalidException". Message was: "Signature is not present in request" at
/home/lernhart/work/shopware/app-php-sdk/src/Authenti

[Killed] LogicalNot
Authentication/RequestVerifier.php:29:9
 
         parse_str($request->getUri()->getQuery(), $queries);
 
-        if (!isset($queries['shop-id'], $queries['shop-url'], $queries['timestamp'])) {
+        if (isset($queries['shop-id'], $queries['shop-url'], $queries['timestamp'])) {
             throw new SignatureNotFoundException($request);
         }
killedBy: Shopware\App\SDK\Tests\Authentication\RequestVerifierTest::testAuthenticateRegistrationRequestMissingParameters
statusReason: 1) Shopware\App\SDK\Tests\Authentication\RequestVerifierTest::testAuthenticateRegistrationRequestMissingParameters
Failed asserting that exception of type "Shopware\App\SDK\Exception\SignatureInvalidException" matches expected exception "Shopware\App\SDK\Exception\SignatureNotFoundException". Message was: "Signature could not be verified" at
/home/lernhart/work/shopware/app-php-sdk/src/Authenticat

[Killed] Throw_
Authentication/RequestVerifier.php:30:13
         parse_str($request->getUri()->getQuery(), $queries);
 
         if (!isset($queries['shop-id'], $queries['shop-url'], $queries['timestamp'])) {
-            throw new SignatureNotFoundException($request);
+            new SignatureNotFoundException($request);
         }
 
killedBy: Shopware\App\SDK\Tests\Authentication\RequestVerifierTest::testAuthenticateRegistrationRequestMissingParameters
statusReason: 1) Shopware\App\SDK\Tests\Authentication\RequestVerifierTest::testAuthenticateRegistrationRequestMissingParameters
Failed asserting that exception of type "Shopware\App\SDK\Exception\SignatureInvalidException" matches expected exception "Shopware\App\SDK\Exception\SignatureNotFoundException". Message was: "Signature could not be verified" at
/home/lernhart/work/shopware/app-php-sdk/src/Authenticat

[Killed] MethodCallRemoval
Authentication/RequestVerifier.php:36:9
         /** @var array{shop-id: string, shop-url: string, timestamp: string} $check */
         $check = $queries;
 
-        $this->verifySignature(
-            $request,
-            $appConfiguration->getAppSecret(),
-            $this->buildValidationQuery($check),
-            $signature
-        );
+        
     }
 
killedBy: Shopware\App\SDK\Tests\Authentication\RequestVerifierTest::testAuthenticateRegistrationRequestInvalidSignature
statusReason: 1) Shopware\App\SDK\Tests\Authentication\RequestVerifierTest::testAuthenticateRegistrationRequestInvalidSignature
Failed asserting that exception of type "Shopware\App\SDK\Exception\SignatureInvalidException" is thrown.

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Killed] PublicVisibility
Authentication/RequestVerifier.php:48:5
      * @throws SignatureInvalidException
      * @throws SignatureNotFoundException
      */
-    public function authenticatePostRequest(RequestInterface $request, ShopInterface $shop): void
+    protected function authenticatePostRequest(RequestInterface $request, ShopInterface $shop) : void
     {
         $signature = $this->getSignatureFromHeader($request, self::SHOPWARE_SHOP_SIGNATURE_HEADER);
killedBy: Shopware\App\SDK\Tests\Authentication\RequestVerifierTest::testAuthenticatePostInvalidSignature
statusReason: 1) Shopware\App\SDK\Tests\Authentication\RequestVerifierTest::testAuthenticatePostInvalidSignature
/home/lernhart/work/shopware/app-php-sdk/tests/Authentication/RequestVerifierTest.php:80
.

FAILURES!
Tests: 3, Assertions: 3, Failures: 1.

[Killed] MethodCallRemoval
Authentication/RequestVerifier.php:53:9
         $signature = $this->getSignatureFromHeader($request, self::SHOPWARE_SHOP_SIGNATURE_HEADER);
 
         $content = $request->getBody()->getContents();
-        $request->getBody()->rewind();
+        
         $this->verifySignature(
             $request,
killedBy: Shopware\App\SDK\Tests\Authentication\RequestVerifierTest::testAuthenticatePostRequestRewindsBody
statusReason: 1) Shopware\App\SDK\Tests\Authentication\RequestVerifierTest::testAuthenticatePostRequestRewindsBody
Expectation failed for method name is "rewind" when invoked 1 time(s).
Method was expected to be called 1 times, actually called 0 times.

FAILURES!
Tests: 4, Assertions: 4, Failures: 1.

[Killed] MethodCallRemoval
Authentication/RequestVerifier.php:54:9
 
         $content = $request->getBody()->getContents();
         $request->getBody()->rewind();
-        $this->verifySignature(
-            $request,
-            $shop->getShopSecret(),
-            $content,
-            $signature
-        );
+        
     }
 
killedBy: Shopware\App\SDK\Tests\Authentication\RequestVerifierTest::testAuthenticatePostInvalidSignature
statusReason: 1) Shopware\App\SDK\Tests\Authentication\RequestVerifierTest::testAuthenticatePostInvalidSignature
Failed asserting that exception of type "Shopware\App\SDK\Exception\SignatureInvalidException" is thrown.

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Killed] PublicVisibility
Authentication/RequestVerifier.php:66:5
      * @throws SignatureInvalidException
      * @throws SignatureNotFoundException
      */
-    public function authenticateGetRequest(RequestInterface $request, ShopInterface $shop): void
+    protected function authenticateGetRequest(RequestInterface $request, ShopInterface $shop) : void
     {
         $signature = $this->getSignatureFromQuery($request);
killedBy: Shopware\App\SDK\Tests\Authentication\RequestVerifierTest::testAuthenticateGetInvalidSignature
statusReason: 1) Shopware\App\SDK\Tests\Authentication\RequestVerifierTest::testAuthenticateGetInvalidSignature
/home/lernhart/work/shopware/app-php-sdk/tests/Authentication/RequestVerifierTest.php:126
.

FAILURES!
Tests: 4, Assertions: 4, Failures: 1.

[Killed] MethodCallRemoval
Authentication/RequestVerifier.php:70:9
     {
         $signature = $this->getSignatureFromQuery($request);
 
-        $this->verifySignature(
-            $request,
-            $shop->getShopSecret(),
-            $this->removeSignatureFromQuery($request->getUri()->getQuery(), $signature),
-            $signature
-        );
+        
     }
 
killedBy: Shopware\App\SDK\Tests\Authentication\RequestVerifierTest::testAuthenticateGetInvalidSignature
statusReason: 1) Shopware\App\SDK\Tests\Authentication\RequestVerifierTest::testAuthenticateGetInvalidSignature
Failed asserting that exception of type "Shopware\App\SDK\Exception\SignatureInvalidException" is thrown.

FAILURES!
Tests: 4, Assertions: 4, Failures: 1.

[Killed] FunctionCallRemoval
Authentication/RequestVerifier.php:83:9
      */
     private function getSignatureFromQuery(RequestInterface $request): string
     {
-        parse_str($request->getUri()->getQuery(), $queries);
+        
 
         if (!isset($queries[self::SHOPWARE_SHOP_SIGNATURE_HEADER])) {
killedBy: Shopware\App\SDK\Tests\Authentication\RequestVerifierTest::testAuthenticateGetInvalidSignature
statusReason: 1) Shopware\App\SDK\Tests\Authentication\RequestVerifierTest::testAuthenticateGetInvalidSignature
Failed asserting that exception of type "Shopware\App\SDK\Exception\SignatureNotFoundException" matches expected exception "Shopware\App\SDK\Exception\SignatureInvalidException". Message was: "Signature is not present in request" at
/home/lernhart/work/shopware/app-php-sdk/src/Authentication/RequestVe

[Killed] LogicalNot
Authentication/RequestVerifier.php:85:9
     {
         parse_str($request->getUri()->getQuery(), $queries);
 
-        if (!isset($queries[self::SHOPWARE_SHOP_SIGNATURE_HEADER])) {
+        if (isset($queries[self::SHOPWARE_SHOP_SIGNATURE_HEADER])) {
             throw new SignatureNotFoundException($request);
         }
killedBy: Shopware\App\SDK\Tests\Authentication\RequestVerifierTest::testAuthenticateGetInvalidSignature
statusReason: 1) Shopware\App\SDK\Tests\Authentication\RequestVerifierTest::testAuthenticateGetInvalidSignature
Failed asserting that exception of type "Shopware\App\SDK\Exception\SignatureNotFoundException" matches expected exception "Shopware\App\SDK\Exception\SignatureInvalidException". Message was: "Signature is not present in request" at
/home/lernhart/work/shopware/app-php-sdk/src/Authentication/RequestVe

[Killed] Throw_
Authentication/RequestVerifier.php:86:13
         parse_str($request->getUri()->getQuery(), $queries);
 
         if (!isset($queries[self::SHOPWARE_SHOP_SIGNATURE_HEADER])) {
-            throw new SignatureNotFoundException($request);
+            new SignatureNotFoundException($request);
         }
 
statusReason: PHPUnit 10.1.2 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.1.18
Configuration: /tmp/infection/phpunitConfiguration.9a0afc80be9b3ca111bd9b6dc85bda43.infection.xml

.........W.                                                       11 / 11 (100%)

Time: 00:00.007, Memory: 12.00 MB

[Killed] LogicalNot
Authentication/RequestVerifier.php:91:9
 
         $header = $queries[self::SHOPWARE_SHOP_SIGNATURE_HEADER];
 
-        if (!is_string($header)) {
+        if (is_string($header)) {
             throw new SignatureNotFoundException($request);
         }
killedBy: Shopware\App\SDK\Tests\Authentication\RequestVerifierTest::testAuthenticateGetInvalidSignature
statusReason: 1) Shopware\App\SDK\Tests\Authentication\RequestVerifierTest::testAuthenticateGetInvalidSignature
Failed asserting that exception of type "Shopware\App\SDK\Exception\SignatureNotFoundException" matches expected exception "Shopware\App\SDK\Exception\SignatureInvalidException". Message was: "Signature is not present in request" at
/home/lernhart/work/shopware/app-php-sdk/src/Authentication/RequestVe

[NoCoverage] Throw_
Authentication/RequestVerifier.php:92:13
         $header = $queries[self::SHOPWARE_SHOP_SIGNATURE_HEADER];
 
         if (!is_string($header)) {
-            throw new SignatureNotFoundException($request);
+            new SignatureNotFoundException($request);
         }
 

[Killed] Throw_
Authentication/RequestVerifier.php:106:13
         $signatureHeader = $request->getHeader($headerName);
 
         if (empty($signatureHeader)) {
-            throw new SignatureNotFoundException($request);
+            new SignatureNotFoundException($request);
         }
 
killedBy: Shopware\App\SDK\Tests\Authentication\RequestVerifierTest::testAuthenticateRegistrationRequestMissingHeader
statusReason: 1) Shopware\App\SDK\Tests\Authentication\RequestVerifierTest::testAuthenticateRegistrationRequestMissingHeader
Failed asserting that exception of type "TypeError" matches expected exception "Shopware\App\SDK\Exception\SignatureNotFoundException". Message was: "Shopware\App\SDK\Authentication\RequestVerifier::getSignatureFromHeader(): Return value must be of type string, null returned" at
/home/ler

[Killed] IncrementInteger
Authentication/RequestVerifier.php:109:9
             throw new SignatureNotFoundException($request);
         }
 
-        return $signatureHeader[0];
+        return $signatureHeader[1];
     }
 
killedBy: Shopware\App\SDK\Tests\Authentication\RequestVerifierTest::testAuthenticatePostInvalidSignature
statusReason: 1) Shopware\App\SDK\Tests\Authentication\RequestVerifierTest::testAuthenticatePostInvalidSignature
Failed asserting that exception of type "TypeError" matches expected exception "Shopware\App\SDK\Exception\SignatureInvalidException". Message was: "Shopware\App\SDK\Authentication\RequestVerifier::getSignatureFromHeader(): Return value must be of type string, null returned" at
/home/lernhart/work/sh

[Killed] LogicalNot
Authentication/RequestVerifier.php:123:9
     ): void {
         $hmac = hash_hmac('sha256', $message, $secret);
 
-        if (!hash_equals($hmac, $signature)) {
+        if (hash_equals($hmac, $signature)) {
             throw new SignatureInvalidException($request);
         }
killedBy: Shopware\App\SDK\Tests\Authentication\RequestVerifierTest::testAuthenticateRegistrationRequestInvalidSignature
statusReason: 1) Shopware\App\SDK\Tests\Authentication\RequestVerifierTest::testAuthenticateRegistrationRequestInvalidSignature
Failed asserting that exception of type "Shopware\App\SDK\Exception\SignatureInvalidException" is thrown.

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Killed] Throw_
Authentication/RequestVerifier.php:124:13
         $hmac = hash_hmac('sha256', $message, $secret);
 
         if (!hash_equals($hmac, $signature)) {
-            throw new SignatureInvalidException($request);
+            new SignatureInvalidException($request);
         }
     }
killedBy: Shopware\App\SDK\Tests\Authentication\RequestVerifierTest::testAuthenticateRegistrationRequestInvalidSignature
statusReason: 1) Shopware\App\SDK\Tests\Authentication\RequestVerifierTest::testAuthenticateRegistrationRequestInvalidSignature
Failed asserting that exception of type "Shopware\App\SDK\Exception\SignatureInvalidException" is thrown.

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.
