[Killed] PublicVisibility
AppLifecycle.php:39:5
     ) {
     }
 
-    public function register(RequestInterface $request): ResponseInterface
+    protected function register(RequestInterface $request) : ResponseInterface
     {
         return $this->registrationService->register($request);
killedBy: Shopware\App\SDK\Tests\AppLifecycleTest::testRegister
statusReason: 1) Shopware\App\SDK\Tests\AppLifecycleTest::testRegister
Error: Call to protected method Shopware\App\SDK\AppLifecycle::register() from scope Shopware\App\SDK\Tests\AppLifecycleTest

/home/lernhart/work/shopware/app-php-sdk/tests/AppLifecycleTest.php:85

--

There was 1 risky test:

[Killed] PublicVisibility
AppLifecycle.php:44:5
         return $this->registrationService->register($request);
     }
 
-    public function registerConfirm(RequestInterface $request): ResponseInterface
+    protected function registerConfirm(RequestInterface $request) : ResponseInterface
     {
         return $this->registrationService->registerConfirm($request);
killedBy: Shopware\App\SDK\Tests\AppLifecycleTest::testRegisterConfirm
statusReason: 1) Shopware\App\SDK\Tests\AppLifecycleTest::testRegisterConfirm
Error: Call to protected method Shopware\App\SDK\AppLifecycle::registerConfirm() from scope Shopware\App\SDK\Tests\AppLifecycleTest

/home/lernhart/work/shopware/app-php-sdk/tests/AppLifecycleTest.php:103

--

There was 1 risky test:

[Killed] PublicVisibility
AppLifecycle.php:49:5
         return $this->registrationService->registerConfirm($request);
     }
 
-    public function activate(RequestInterface $request): ResponseInterface
+    protected function activate(RequestInterface $request) : ResponseInterface
     {
         return $this->handleShopStatus($request, true);
killedBy: Shopware\App\SDK\Tests\AppLifecycleTest::testActivate
statusReason: 1) Shopware\App\SDK\Tests\AppLifecycleTest::testActivate
Error: Call to protected method Shopware\App\SDK\AppLifecycle::activate() from scope Shopware\App\SDK\Tests\AppLifecycleTest

/home/lernhart/work/shopware/app-php-sdk/tests/AppLifecycleTest.php:176

--

There was 1 risky test:

[Killed] TrueValue
AppLifecycle.php:51:9
 
     public function activate(RequestInterface $request): ResponseInterface
     {
-        return $this->handleShopStatus($request, true);
+        return $this->handleShopStatus($request, false);
     }
 
killedBy: Shopware\App\SDK\Tests\AppLifecycleTest::testActivate
statusReason: 1) Shopware\App\SDK\Tests\AppLifecycleTest::testActivate
Failed asserting that false is true.

/home/lernhart/work/shopware/app-php-sdk/tests/AppLifecycleTest.php:182

FAILURES!
Tests: 2, Assertions: 11, Failures: 1.

[Killed] PublicVisibility
AppLifecycle.php:54:5
         return $this->handleShopStatus($request, true);
     }
 
-    public function deactivate(RequestInterface $request): ResponseInterface
+    protected function deactivate(RequestInterface $request) : ResponseInterface
     {
         return $this->handleShopStatus($request, false);
killedBy: Shopware\App\SDK\Tests\AppLifecycleTest::testDeactivate
statusReason: 1) Shopware\App\SDK\Tests\AppLifecycleTest::testDeactivate
Error: Call to protected method Shopware\App\SDK\AppLifecycle::deactivate() from scope Shopware\App\SDK\Tests\AppLifecycleTest

/home/lernhart/work/shopware/app-php-sdk/tests/AppLifecycleTest.php:195

2) Shopware\App\SDK\Tests\AppLifecycleTest::testDeactivateNotFound
Error: Call to protected method Shopware\App\SDK\AppLifecycle::deactivate

[Killed] FalseValue
AppLifecycle.php:56:9
 
     public function deactivate(RequestInterface $request): ResponseInterface
     {
-        return $this->handleShopStatus($request, false);
+        return $this->handleShopStatus($request, true);
     }
 
killedBy: Shopware\App\SDK\Tests\AppLifecycleTest::testDeactivate
statusReason: 1) Shopware\App\SDK\Tests\AppLifecycleTest::testDeactivate
Failed asserting that true is false.

/home/lernhart/work/shopware/app-php-sdk/tests/AppLifecycleTest.php:201

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] PublicVisibility
AppLifecycle.php:62:5
     /**
      * Handles the app.uninstalled Hook to remove the shop from the repository
      */
-    public function uninstall(RequestInterface $request): ResponseInterface
+    protected function uninstall(RequestInterface $request) : ResponseInterface
     {
         $psrFactory = new Psr17Factory();
killedBy: Shopware\App\SDK\Tests\AppLifecycleTest::testUninstallLogs
statusReason: 1) Shopware\App\SDK\Tests\AppLifecycleTest::testUninstallLogs
Error: Call to protected method Shopware\App\SDK\AppLifecycle::uninstall() from scope Shopware\App\SDK\Tests\AppLifecycleTest

/home/lernhart/work/shopware/app-php-sdk/tests/AppLifecycleTest.php:168

2) Shopware\App\SDK\Tests\AppLifecycleTest::testUninstall
Error: Call to protected method Shopware\App\SDK\AppLifecycle::uninstall() from

[Killed] IncrementInteger
AppLifecycle.php:65:9
     public function uninstall(RequestInterface $request): ResponseInterface
     {
         $psrFactory = new Psr17Factory();
-        $response = $psrFactory->createResponse(204);
+        $response = $psrFactory->createResponse(205);
 
         $shop = $this->findShop($request);
killedBy: Shopware\App\SDK\Tests\AppLifecycleTest::testUninstallNotExisting
statusReason: 1) Shopware\App\SDK\Tests\AppLifecycleTest::testUninstallNotExisting
Failed asserting that 205 is identical to 204.

/home/lernhart/work/shopware/app-php-sdk/tests/AppLifecycleTest.php:126

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] DecrementInteger
AppLifecycle.php:65:9
     public function uninstall(RequestInterface $request): ResponseInterface
     {
         $psrFactory = new Psr17Factory();
-        $response = $psrFactory->createResponse(204);
+        $response = $psrFactory->createResponse(203);
 
         $shop = $this->findShop($request);
killedBy: Shopware\App\SDK\Tests\AppLifecycleTest::testUninstallNotExisting
statusReason: 1) Shopware\App\SDK\Tests\AppLifecycleTest::testUninstallNotExisting
Failed asserting that 203 is identical to 204.

/home/lernhart/work/shopware/app-php-sdk/tests/AppLifecycleTest.php:126

FAILURES!
Tests: 2, Assertions: 3, Failures: 1.

[Killed] Identical
AppLifecycle.php:69:9
 
         $shop = $this->findShop($request);
 
-        if ($shop === null) {
+        if ($shop !== null) {
             return $response;
         }
killedBy: Shopware\App\SDK\Tests\AppLifecycleTest::testUninstallNotExisting
statusReason: 1) Shopware\App\SDK\Tests\AppLifecycleTest::testUninstallWithoutEventDispatcher
Failed asserting that Shopware\App\SDK\Test\MockShop Object #616 (
    'shopId' => '123'
    'shopUrl' => 'https://foo.com'
    'shopSecret' => '1234567890'
    'shopActive' => false
    'clientId' => null
    'clientSecret' => null

[Killed] NullSafeMethodCall
AppLifecycle.php:73:9
             return $response;
         }
 
-        $this->eventDispatcher?->dispatch(new BeforeShopDeletionEvent($request, $shop));
+        $this->eventDispatcher->dispatch(new BeforeShopDeletionEvent($request, $shop));
 
         $this->shopRepository->deleteShop($shop->getShopId());
killedBy: Shopware\App\SDK\Tests\AppLifecycleTest::testUninstallWithoutEventDispatcher
statusReason: 1) Shopware\App\SDK\Tests\AppLifecycleTest::testUninstallWithoutEventDispatcher
Error: Call to a member function dispatch() on null

/home/lernhart/work/shopware/app-php-sdk/src/AppLifecycle.php:58
/home/lernhart/work/shopware/app-php-sdk/tests/AppLifecycleTest.php:144

2) Shopware\App\SDK\Tests\AppLifecycleTest::testUninstallLogs
Error: Call to a member function dispatch() on null

[Killed] MethodCallRemoval
AppLifecycle.php:75:9
 
         $this->eventDispatcher?->dispatch(new BeforeShopDeletionEvent($request, $shop));
 
-        $this->shopRepository->deleteShop($shop->getShopId());
+        
 
         $this->eventDispatcher?->dispatch(new ShopDeletedEvent($request, $shop));
killedBy: Shopware\App\SDK\Tests\AppLifecycleTest::testUninstall
statusReason: 1) Shopware\App\SDK\Tests\AppLifecycleTest::testUninstall
Failed asserting that Shopware\App\SDK\Test\MockShop Object #610 (
    'shopId' => '123'
    'shopUrl' => 'https://foo.com'
    'shopSecret' => '1234567890'
    'shopActive' => false
    'clientId' => null
    'clientSecret' => null

[Killed] NullSafeMethodCall
AppLifecycle.php:77:9
 
         $this->shopRepository->deleteShop($shop->getShopId());
 
-        $this->eventDispatcher?->dispatch(new ShopDeletedEvent($request, $shop));
+        $this->eventDispatcher->dispatch(new ShopDeletedEvent($request, $shop));
 
         $this->logger->info('Shop uninstalled', [
killedBy: Shopware\App\SDK\Tests\AppLifecycleTest::testUninstallLogs
statusReason: 1) Shopware\App\SDK\Tests\AppLifecycleTest::testUninstallLogs
Error: Call to a member function dispatch() on null

/home/lernhart/work/shopware/app-php-sdk/src/AppLifecycle.php:60
/home/lernhart/work/shopware/app-php-sdk/tests/AppLifecycleTest.php:168

2) Shopware\App\SDK\Tests\AppLifecycleTest::testUninstallWithoutEventDispatcher
Error: Call to a member function dispatch() on null

[Killed] MethodCallRemoval
AppLifecycle.php:79:9
 
         $this->eventDispatcher?->dispatch(new ShopDeletedEvent($request, $shop));
 
-        $this->logger->info('Shop uninstalled', [
-            'shop-id' => $shop->getShopId(),
-            'shop-url' => $shop->getShopUrl(),
-        ]);
+        
 
         return $response;
killedBy: Shopware\App\SDK\Tests\AppLifecycleTest::testUninstallLogs
statusReason: 1) Shopware\App\SDK\Tests\AppLifecycleTest::testUninstallLogs
Expectation failed for method name is "info" when invoked 1 time(s).
Method was expected to be called 1 times, actually called 0 times.

FAILURES!
Tests: 12, Assertions: 51, Failures: 1.

[Killed] ArrayItemRemoval
AppLifecycle.php:79:9
 
         $this->eventDispatcher?->dispatch(new ShopDeletedEvent($request, $shop));
 
-        $this->logger->info('Shop uninstalled', [
-            'shop-id' => $shop->getShopId(),
-            'shop-url' => $shop->getShopUrl(),
-        ]);
+        $this->logger->info('Shop uninstalled', ['shop-url' => $shop->getShopUrl()]);
 
         return $response;
killedBy: Shopware\App\SDK\Tests\AppLifecycleTest::testUninstallLogs
statusReason: 1) Shopware\App\SDK\Tests\AppLifecycleTest::testUninstallLogs
Expectation failed for method name is "info" when invoked 1 time(s)
Parameter 1 for invocation Psr\Log\LoggerInterface::info('Shop uninstalled', Array (...)): void does not match expected value.
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (

[Killed] ArrayItem
AppLifecycle.php:80:13
         $this->eventDispatcher?->dispatch(new ShopDeletedEvent($request, $shop));
 
         $this->logger->info('Shop uninstalled', [
-            'shop-id' => $shop->getShopId(),
+            $this->logger->info('Shop uninstalled', ['shop-id' > $shop->getShopId(), 'shop-url' => $shop->getShopUrl()]);
             'shop-url' => $shop->getShopUrl(),
         ]);
killedBy: Shopware\App\SDK\Tests\AppLifecycleTest::testUninstallLogs
statusReason: 1) Shopware\App\SDK\Tests\AppLifecycleTest::testUninstallLogs
Expectation failed for method name is "info" when invoked 1 time(s)
Parameter 1 for invocation Psr\Log\LoggerInterface::info('Shop uninstalled', Array (...)): void does not match expected value.
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (

[Killed] ArrayItem
AppLifecycle.php:81:13
 
         $this->logger->info('Shop uninstalled', [
             'shop-id' => $shop->getShopId(),
-            'shop-url' => $shop->getShopUrl(),
+            $this->logger->info('Shop uninstalled', ['shop-id' => $shop->getShopId(), 'shop-url' > $shop->getShopUrl()]);
         ]);
 
killedBy: Shopware\App\SDK\Tests\AppLifecycleTest::testUninstallLogs
statusReason: 1) Shopware\App\SDK\Tests\AppLifecycleTest::testUninstallLogs
Expectation failed for method name is "info" when invoked 1 time(s)
Parameter 1 for invocation Psr\Log\LoggerInterface::info('Shop uninstalled', Array (...)): void does not match expected value.
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (

[Killed] PublicVisibility
AppLifecycle.php:96:5
         }
     }
 
-    public function handleShopStatus(RequestInterface $request, bool $status): ResponseInterface
+    protected function handleShopStatus(RequestInterface $request, bool $status) : ResponseInterface
     {
         $psrFactory = new Psr17Factory();
killedBy: Shopware\App\SDK\Tests\AppLifecycleTest::testHandleShopStatusLogsActivated
statusReason: 1) Shopware\App\SDK\Tests\AppLifecycleTest::testHandleShopStatusLogsActivated
Error: Call to protected method Shopware\App\SDK\AppLifecycle::handleShopStatus() from scope Shopware\App\SDK\Tests\AppLifecycleTest

/home/lernhart/work/shopware/app-php-sdk/tests/AppLifecycleTest.php:267

2) Shopware\App\SDK\Tests\AppLifecycleTest::testHandleShopStatusLogsDectivated
Error: Call to protected method Shop

[Killed] NullSafeMethodCall
AppLifecycle.php:108:13
         }
 
         if ($status) {
-            $this->eventDispatcher?->dispatch(new BeforeShopActivateEvent($request, $shop));
+            $this->eventDispatcher->dispatch(new BeforeShopActivateEvent($request, $shop));
         } else {
             $this->eventDispatcher?->dispatch(new BeforeShopDeactivatedEvent($request, $shop));
killedBy: Shopware\App\SDK\Tests\AppLifecycleTest::testHandleShopStatusWithoutEventDispatcher
statusReason: 1) Shopware\App\SDK\Tests\AppLifecycleTest::testHandleShopStatusWithoutEventDispatcher
Error: Call to a member function dispatch() on null

/home/lernhart/work/shopware/app-php-sdk/src/AppLifecycle.php:81
/home/lernhart/work/shopware/app-php-sdk/tests/AppLifecycleTest.php:240

2) Shopware\App\SDK\Tests\AppLifecycleTest::testHandleShopStatusLogsActivated
Error: Call to a member function dispatch()

[Killed] NullSafeMethodCall
AppLifecycle.php:110:13
         if ($status) {
             $this->eventDispatcher?->dispatch(new BeforeShopActivateEvent($request, $shop));
         } else {
-            $this->eventDispatcher?->dispatch(new BeforeShopDeactivatedEvent($request, $shop));
+            $this->eventDispatcher->dispatch(new BeforeShopDeactivatedEvent($request, $shop));
         }
 
killedBy: Shopware\App\SDK\Tests\AppLifecycleTest::testHandleShopStatusWithoutEventDispatcher
statusReason: 1) Shopware\App\SDK\Tests\AppLifecycleTest::testHandleShopStatusWithoutEventDispatcher
Error: Call to a member function dispatch() on null

/home/lernhart/work/shopware/app-php-sdk/src/AppLifecycle.php:83
/home/lernhart/work/shopware/app-php-sdk/tests/AppLifecycleTest.php:232

2) Shopware\App\SDK\Tests\AppLifecycleTest::testHandleShopStatusLogsDectivated
Error: Call to a member function dispatch()

[Killed] MethodCallRemoval
AppLifecycle.php:113:9
             $this->eventDispatcher?->dispatch(new BeforeShopDeactivatedEvent($request, $shop));
         }
 
-        $this->shopRepository->updateShop($shop->withShopActive($status));
+        
 
         if ($status) {
killedBy: Shopware\App\SDK\Tests\AppLifecycleTest::testActivate
statusReason: 1) Shopware\App\SDK\Tests\AppLifecycleTest::testActivate
Failed asserting that false is true.

/home/lernhart/work/shopware/app-php-sdk/tests/AppLifecycleTest.php:182

FAILURES!
Tests: 7, Assertions: 27, Failures: 1.

[Killed] NullSafeMethodCall
AppLifecycle.php:116:13
         $this->shopRepository->updateShop($shop->withShopActive($status));
 
         if ($status) {
-            $this->eventDispatcher?->dispatch(new ShopActivatedEvent($request, $shop));
+            $this->eventDispatcher->dispatch(new ShopActivatedEvent($request, $shop));
         } else {
             $this->eventDispatcher?->dispatch(new ShopDeactivatedEvent($request, $shop));
killedBy: Shopware\App\SDK\Tests\AppLifecycleTest::testHandleShopStatusLogsActivated
statusReason: 1) Shopware\App\SDK\Tests\AppLifecycleTest::testHandleShopStatusLogsActivated
Error: Call to a member function dispatch() on null

/home/lernhart/work/shopware/app-php-sdk/src/AppLifecycle.php:87
/home/lernhart/work/shopware/app-php-sdk/tests/AppLifecycleTest.php:267

2) Shopware\App\SDK\Tests\AppLifecycleTest::testHandleShopStatusWithoutEventDispatcher
Error: Call to a member function dispatch()

[Killed] NullSafeMethodCall
AppLifecycle.php:118:13
         if ($status) {
             $this->eventDispatcher?->dispatch(new ShopActivatedEvent($request, $shop));
         } else {
-            $this->eventDispatcher?->dispatch(new ShopDeactivatedEvent($request, $shop));
+            $this->eventDispatcher->dispatch(new ShopDeactivatedEvent($request, $shop));
         }
 
killedBy: Shopware\App\SDK\Tests\AppLifecycleTest::testHandleShopStatusWithoutEventDispatcher
statusReason: 1) Shopware\App\SDK\Tests\AppLifecycleTest::testHandleShopStatusWithoutEventDispatcher
Error: Call to a member function dispatch() on null

/home/lernhart/work/shopware/app-php-sdk/src/AppLifecycle.php:89
/home/lernhart/work/shopware/app-php-sdk/tests/AppLifecycleTest.php:232

2) Shopware\App\SDK\Tests\AppLifecycleTest::testHandleShopStatusLogsDectivated
Error: Call to a member function dispatch()

[Killed] Ternary
AppLifecycle.php:121:9
             $this->eventDispatcher?->dispatch(new ShopDeactivatedEvent($request, $shop));
         }
 
-        $this->logger->info($status ? 'Shop activated' : 'Shop deactivated', [
+        $this->logger->info($status ? 'Shop deactivated' : 'Shop activated', ['shop-id' => $shop->getShopId(), 'shop-url' => $shop->getShopUrl()]);
             'shop-id' => $shop->getShopId(),
             'shop-url' => $shop->getShopUrl(),
killedBy: Shopware\App\SDK\Tests\AppLifecycleTest::testHandleShopStatusLogsActivated
statusReason: 1) Shopware\App\SDK\Tests\AppLifecycleTest::testHandleShopStatusLogsActivated
Expectation failed for method name is "info" when invoked 1 time(s)
Parameter 0 for invocation Psr\Log\LoggerInterface::info('Shop deactivated', Array (...)): void does not match expected value.
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'Shop activated'

[Killed] MethodCallRemoval
AppLifecycle.php:121:9
             $this->eventDispatcher?->dispatch(new ShopDeactivatedEvent($request, $shop));
         }
 
-        $this->logger->info($status ? 'Shop activated' : 'Shop deactivated', [
-            'shop-id' => $shop->getShopId(),
-            'shop-url' => $shop->getShopUrl(),
-        ]);
+        
 
         return $response;
killedBy: Shopware\App\SDK\Tests\AppLifecycleTest::testHandleShopStatusLogsActivated
statusReason: 1) Shopware\App\SDK\Tests\AppLifecycleTest::testHandleShopStatusLogsActivated
Expectation failed for method name is "info" when invoked 1 time(s).
Method was expected to be called 1 times, actually called 0 times.

FAILURES!
Tests: 10, Assertions: 41, Failures: 1.

[Killed] ArrayItem
AppLifecycle.php:122:13
         }
 
         $this->logger->info($status ? 'Shop activated' : 'Shop deactivated', [
-            'shop-id' => $shop->getShopId(),
+            $this->logger->info($status ? 'Shop activated' : 'Shop deactivated', ['shop-id' > $shop->getShopId(), 'shop-url' => $shop->getShopUrl()]);
             'shop-url' => $shop->getShopUrl(),
         ]);
killedBy: Shopware\App\SDK\Tests\AppLifecycleTest::testHandleShopStatusLogsDectivated
statusReason: 1) Shopware\App\SDK\Tests\AppLifecycleTest::testHandleShopStatusLogsDectivated
Expectation failed for method name is "info" when invoked 1 time(s)
Parameter 1 for invocation Psr\Log\LoggerInterface::info('Shop deactivated', Array (...)): void does not match expected value.
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (

[Killed] ArrayItem
AppLifecycle.php:123:13
 
         $this->logger->info($status ? 'Shop activated' : 'Shop deactivated', [
             'shop-id' => $shop->getShopId(),
-            'shop-url' => $shop->getShopUrl(),
+            $this->logger->info($status ? 'Shop activated' : 'Shop deactivated', ['shop-id' => $shop->getShopId(), 'shop-url' > $shop->getShopUrl()]);
         ]);
 
killedBy: Shopware\App\SDK\Tests\AppLifecycleTest::testHandleShopStatusLogsActivated
statusReason: 1) Shopware\App\SDK\Tests\AppLifecycleTest::testHandleShopStatusLogsActivated
Expectation failed for method name is "info" when invoked 1 time(s)
Parameter 1 for invocation Psr\Log\LoggerInterface::info('Shop activated', Array (...)): void does not match expected value.
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
