[Killed] PublicVisibility
Authentication/ResponseSigner.php:13:5
 
 class ResponseSigner
 {
-    public function getRegistrationSignature(AppConfiguration $appConfiguration, ShopInterface $shop): string
+    protected function getRegistrationSignature(AppConfiguration $appConfiguration, ShopInterface $shop) : string
     {
         return $this->sign($shop->getShopId() . $shop->getShopUrl() . $appConfiguration->getAppName(), $appConfiguration->getAppSecret());
killedBy: Shopware\App\SDK\Tests\Authentication\ResponseSignerTest::testRegisterSigning
statusReason: 1) Shopware\App\SDK\Tests\Authentication\ResponseSignerTest::testRegisterSigning
Error: Call to protected method Shopware\App\SDK\Authentication\ResponseSigner::getRegistrationSignature() from scope Shopware\App\SDK\Tests\Authentication\ResponseSignerTest

/home/lernhart/work/shopware/app-php-sdk/tests/Authentication/ResponseSignerTest.php:30

2) Shopware\App\SDK\Tests\Registration\RegistrationSer

[Killed] Concat
Authentication/ResponseSigner.php:15:9
 {
     public function getRegistrationSignature(AppConfiguration $appConfiguration, ShopInterface $shop): string
     {
-        return $this->sign($shop->getShopId() . $shop->getShopUrl() . $appConfiguration->getAppName(), $appConfiguration->getAppSecret());
+        return $this->sign($shop->getShopId() . $appConfiguration->getAppName() . $shop->getShopUrl(), $appConfiguration->getAppSecret());
     }
 
killedBy: Shopware\App\SDK\Tests\Authentication\ResponseSignerTest::testRegisterSigning
statusReason: 1) Shopware\App\SDK\Tests\Authentication\ResponseSignerTest::testRegisterSigning
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'a1a38c9580bb3bcd0df226086a9783ba4087671ce4968a4469e451c517fff445'
+'d6b0bba0e940306f4e1debad3ca9e80314fc8db5a738baefea08bc616be1adc4'

[Killed] ConcatOperandRemoval
Authentication/ResponseSigner.php:15:9
 {
     public function getRegistrationSignature(AppConfiguration $appConfiguration, ShopInterface $shop): string
     {
-        return $this->sign($shop->getShopId() . $shop->getShopUrl() . $appConfiguration->getAppName(), $appConfiguration->getAppSecret());
+        return $this->sign($shop->getShopUrl() . $appConfiguration->getAppName(), $appConfiguration->getAppSecret());
     }
 
killedBy: Shopware\App\SDK\Tests\Authentication\ResponseSignerTest::testRegisterSigning
statusReason: 1) Shopware\App\SDK\Tests\Authentication\ResponseSignerTest::testRegisterSigning
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'a1a38c9580bb3bcd0df226086a9783ba4087671ce4968a4469e451c517fff445'
+'6bf2e62127c410a71fd8bb11eccb94fd1f0ef9ff4e18fb5e8ffb6b121b55ac9b'

[Killed] PublicVisibility
Authentication/ResponseSigner.php:18:5
         return $this->sign($shop->getShopId() . $shop->getShopUrl() . $appConfiguration->getAppName(), $appConfiguration->getAppSecret());
     }
 
-    public function signResponse(ResponseInterface $response, ShopInterface $shop): ResponseInterface
+    protected function signResponse(ResponseInterface $response, ShopInterface $shop) : ResponseInterface
     {
         $content = $response->getBody()->getContents();
killedBy: Shopware\App\SDK\Tests\Authentication\ResponseSignerTest::testBodyRewindIsCalled
statusReason: 1) Shopware\App\SDK\Tests\Authentication\ResponseSignerTest::testBodyRewindIsCalled
Error: Call to protected method Shopware\App\SDK\Authentication\ResponseSigner::signResponse() from scope Shopware\App\SDK\Tests\Authentication\ResponseSignerTest

/home/lernhart/work/shopware/app-php-sdk/tests/Authentication/ResponseSignerTest.php:56

2) Shopware\App\SDK\Tests\Authentication\ResponseSignerTest::te

[Killed] MethodCallRemoval
Authentication/ResponseSigner.php:21:9
     public function signResponse(ResponseInterface $response, ShopInterface $shop): ResponseInterface
     {
         $content = $response->getBody()->getContents();
-        $response->getBody()->rewind();
+        
 
         return $response->withHeader(
killedBy: Shopware\App\SDK\Tests\Authentication\ResponseSignerTest::testBodyRewindIsCalled
statusReason: 1) Shopware\App\SDK\Tests\Authentication\ResponseSignerTest::testBodyRewindIsCalled
Expectation failed for method name is "rewind" when invoked 1 time(s).
Method was expected to be called 1 times, actually called 0 times.

FAILURES!
Tests: 2, Assertions: 3, Failures: 1.
