[Killed] PublicVisibility
Context/ArrayStruct.php:19:5
     /**
      * @return array<mixed>
      */
-    public function toArray(): array
+    protected function toArray() : array
     {
         return $this->data;
killedBy: Shopware\App\SDK\Tests\Context\SalesChannelContext\AddressTest::testEmptySalutation
statusReason: 1) Shopware\App\SDK\Tests\Context\SalesChannelContext\AddressTest::testEmptySalutation
Error: Call to protected method Shopware\App\SDK\Context\ArrayStruct::toArray() from scope Shopware\App\SDK\Tests\Context\SalesChannelContext\AddressTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/SalesChannelContext/AddressTest.php:22

ERRORS!
Tests: 2, Assertions: 8, Errors: 1.
