[Killed] ConcatOperandRemoval
HttpClient/AuthenticatedClient.php:28:9
 
     public function sendRequest(RequestInterface $request): ResponseInterface
     {
-        return $this->client->sendRequest($request->withHeader('Authorization', 'Bearer ' . $this->fetchAccessToken()));
+        return $this->client->sendRequest($request->withHeader('Authorization', 'Bearer '));
     }
 
killedBy: Shopware\App\SDK\Tests\HttpClient\ClientFactoryTest::testFactoryOwnClient
statusReason: 1) Shopware\App\SDK\Tests\HttpClient\ClientFactoryTest::testFactoryOwnClient
Expectation failed for method name is "sendRequest" when invoked 2 time(s).
Method was expected to be called 2 times, actually called 1 times.

FAILURES!
Tests: 2, Assertions: 1, Failures: 1.

[Killed] Concat
HttpClient/AuthenticatedClient.php:28:9
 
     public function sendRequest(RequestInterface $request): ResponseInterface
     {
-        return $this->client->sendRequest($request->withHeader('Authorization', 'Bearer ' . $this->fetchAccessToken()));
+        return $this->client->sendRequest($request->withHeader('Authorization', $this->fetchAccessToken() . 'Bearer '));
     }
 
killedBy: Shopware\App\SDK\Tests\HttpClient\AuthenticatedClientTest::testAuthorizationHeaderSet
statusReason: 1) Shopware\App\SDK\Tests\HttpClient\AuthenticatedClientTest::testAuthorizationHeaderSet
Expectation failed for method name is "withHeader" when invoked 1 time(s)
Parameter 1 for invocation Psr\Http\Message\MessageInterface::withHeader('Authorization', 'access-tokenBearer ') does not match expected value.
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'Bearer access-to

[Killed] ConcatOperandRemoval
HttpClient/AuthenticatedClient.php:33:9
 
     private function fetchAccessToken(): string
     {
-        $cacheKey = $this->shop->getShopId() . '-access-token';
+        $cacheKey = '-access-token';
 
         $value = $this->cache->get($cacheKey);
killedBy: Shopware\App\SDK\Tests\HttpClient\AuthenticatedClientTest::testAuthenticationTokenCached
statusReason: 1) Shopware\App\SDK\Tests\HttpClient\AuthenticatedClientTest::testAuthenticationTokenCached
Expectation failed for method name is "get" when invoked zero or more times
Parameter 0 for invocation Psr\SimpleCache\CacheInterface::get('-access-token', null): mixed does not match expected value.
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'shop-id-access-token'

[Killed] ConcatOperandRemoval
HttpClient/AuthenticatedClient.php:33:9
 
     private function fetchAccessToken(): string
     {
-        $cacheKey = $this->shop->getShopId() . '-access-token';
+        $cacheKey = $this->shop->getShopId();
 
         $value = $this->cache->get($cacheKey);
killedBy: Shopware\App\SDK\Tests\HttpClient\AuthenticatedClientTest::testAuthenticationTokenCached
statusReason: 1) Shopware\App\SDK\Tests\HttpClient\AuthenticatedClientTest::testAuthenticationTokenCached
Expectation failed for method name is "get" when invoked zero or more times
Parameter 0 for invocation Psr\SimpleCache\CacheInterface::get('shop-id', null): mixed does not match expected value.
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'shop-id-access-token'

[Killed] NotIdentical
HttpClient/AuthenticatedClient.php:42:9
 
         $response = $this->client->sendRequest($this->createTokenRequest($this->shop));
 
-        if ($response->getStatusCode() !== 200) {
+        if ($response->getStatusCode() === 200) {
             throw new AuthenticationFailedException($this->shop->getShopId(), $response);
         }
killedBy: Shopware\App\SDK\Tests\HttpClient\ClientFactoryTest::testFactoryOwnClient
statusReason: 1) Shopware\App\SDK\Tests\HttpClient\AuthenticatedClientTest::testAuthenticationFails
Failed asserting that exception of type "TypeError" matches expected exception "Shopware\App\SDK\HttpClient\Exception\AuthenticationFailedException". Message was: "Shopware\App\SDK\HttpClient\AuthenticatedClient::fetchAccessToken(): Return value must be of type string, null returned" at
/home/lernhart/work/shopwa

[Killed] Throw_
HttpClient/AuthenticatedClient.php:43:13
         $response = $this->client->sendRequest($this->createTokenRequest($this->shop));
 
         if ($response->getStatusCode() !== 200) {
-            throw new AuthenticationFailedException($this->shop->getShopId(), $response);
+            new AuthenticationFailedException($this->shop->getShopId(), $response);
         }
 
killedBy: Shopware\App\SDK\Tests\HttpClient\AuthenticatedClientTest::testAuthenticationFails
statusReason: 1) Shopware\App\SDK\Tests\HttpClient\AuthenticatedClientTest::testAuthenticationFails
Failed asserting that exception of type "TypeError" matches expected exception "Shopware\App\SDK\HttpClient\Exception\AuthenticationFailedException". Message was: "Shopware\App\SDK\HttpClient\AuthenticatedClient::fetchAccessToken(): Return value must be of type string, null returned" at
/home/lernhart/work/shopwa

[Killed] Minus
HttpClient/AuthenticatedClient.php:49:9
         /** @var array{access_token: string, expires_in: int} $token */
         $token = json_decode($response->getBody()->getContents(), true);
 
-        $this->cache->set($cacheKey, $token['access_token'], $token['expires_in'] - self::TOKEN_EXPIRE_DIFF);
+        $this->cache->set($cacheKey, $token['access_token'], $token['expires_in'] + self::TOKEN_EXPIRE_DIFF);
 
         return $token['access_token'];
killedBy: Shopware\App\SDK\Tests\HttpClient\AuthenticatedClientTest::testCacheSet
statusReason: 1) Shopware\App\SDK\Tests\HttpClient\AuthenticatedClientTest::testCacheSet
Expectation failed for method name is "set" when invoked 1 time(s)
Parameter 2 for invocation Psr\SimpleCache\CacheInterface::set('shop-id-access-token', 'access-token', 3630): bool does not match expected value.
Failed asserting that 3630 matches expected 3570.

/home/lernhart/work/shopware/app-php-sdk/src/HttpClient/Authe

[Killed] MethodCallRemoval
HttpClient/AuthenticatedClient.php:49:9
         /** @var array{access_token: string, expires_in: int} $token */
         $token = json_decode($response->getBody()->getContents(), true);
 
-        $this->cache->set($cacheKey, $token['access_token'], $token['expires_in'] - self::TOKEN_EXPIRE_DIFF);
+        
 
         return $token['access_token'];
killedBy: Shopware\App\SDK\Tests\HttpClient\AuthenticatedClientTest::testCacheSet
statusReason: 1) Shopware\App\SDK\Tests\HttpClient\AuthenticatedClientTest::testCacheSet
Expectation failed for method name is "set" when invoked 1 time(s).
Method was expected to be called 1 times, actually called 0 times.

FAILURES!
Tests: 9, Assertions: 28, Failures: 1.
