[Killed] PublicVisibility
Context/Cart/CalculatedPrice.php:11:5
 
 class CalculatedPrice extends ArrayStruct
 {
-    public function getUnitPrice(): float
+    protected function getUnitPrice() : float
     {
         \assert(is_float($this->data['unitPrice']) || is_int($this->data['unitPrice']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\Cart\CalculatedPrice::getUnitPrice() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:251

ERRORS!
Tests: 38, Assertions: 118, Errors: 1.

[Killed] LogicalOr
Context/Cart/CalculatedPrice.php:13:9
 {
     public function getUnitPrice(): float
     {
-        \assert(is_float($this->data['unitPrice']) || is_int($this->data['unitPrice']));
+        \assert(is_float($this->data['unitPrice']) && is_int($this->data['unitPrice']));
         return $this->data['unitPrice'];
     }
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
assert(is_float($this->data['unitPrice']) && is_int($this->data['unitPrice']))

/home/lernhart/work/shopware/app-php-sdk/src/Context/Cart/CalculatedPrice.php:11
/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:251

FAILURES!
Tests: 12, Assertions: 86, Failures: 1.

[Killed] PublicVisibility
Context/Cart/CalculatedPrice.php:17:5
         return $this->data['unitPrice'];
     }
 
-    public function getTotalPrice(): float
+    protected function getTotalPrice() : float
     {
         \assert(is_float($this->data['totalPrice']) || is_int($this->data['totalPrice']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\Cart\CalculatedPrice::getTotalPrice() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:250

2) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleFinalize
Err

[Killed] LogicalOr
Context/Cart/CalculatedPrice.php:19:9
 
     public function getTotalPrice(): float
     {
-        \assert(is_float($this->data['totalPrice']) || is_int($this->data['totalPrice']));
+        \assert(is_float($this->data['totalPrice']) && is_int($this->data['totalPrice']));
         return $this->data['totalPrice'];
     }
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
assert(is_float($this->data['totalPrice']) && is_int($this->data['totalPrice']))

/home/lernhart/work/shopware/app-php-sdk/src/Context/Cart/CalculatedPrice.php:16
/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:250

FAILURES!
Tests: 1, Assertions: 17, Failures: 1.

[Killed] PublicVisibility
Context/Cart/CalculatedPrice.php:23:5
         return $this->data['totalPrice'];
     }
 
-    public function getQuantity(): int
+    protected function getQuantity() : int
     {
         \assert(is_int($this->data['quantity']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\Cart\CalculatedPrice::getQuantity() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:252

ERRORS!
Tests: 38, Assertions: 119, Errors: 1.

[Killed] PublicVisibility
Context/Cart/CalculatedPrice.php:32:5
     /**
      * @return array<CalculatedTax>
      */
-    public function getCalculatedTaxes(): array
+    protected function getCalculatedTaxes() : array
     {
         \assert(is_array($this->data['calculatedTaxes']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\Cart\CalculatedPrice::getCalculatedTaxes() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:254

ERRORS!
Tests: 38, Assertions: 120, Errors: 1.

[Killed] PublicVisibility
Context/Cart/CalculatedPrice.php:43:5
     /**
      * @return array<TaxRule>
      */
-    public function getTaxRules(): array
+    protected function getTaxRules() : array
     {
         \assert(is_array($this->data['taxRules']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\Cart\CalculatedPrice::getTaxRules() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:261

ERRORS!
Tests: 38, Assertions: 125, Errors: 1.

[Killed] UnwrapArrayMap
Context/Cart/CalculatedPrice.php:46:9
     public function getTaxRules(): array
     {
         \assert(is_array($this->data['taxRules']));
-        return array_map(function (array $taxRule): TaxRule {
-            return new TaxRule($taxRule);
-        }, $this->data['taxRules']);
+        return $this->data['taxRules'];
     }
 }
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to a member function getTaxRate() on array

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:266

ERRORS!
Tests: 38, Assertions: 127, Errors: 1.
