[Killed] MethodCallRemoval
HttpClient/Exception/AuthenticationFailedException.php:13:9
 {
     public function __construct(string $shopId, private readonly ResponseInterface $response, ?\Throwable $previous = null)
     {
-        parent::__construct(sprintf('Authentication failed for shop %s', $shopId), 0, $previous);
+        
     }
 
killedBy: Shopware\App\SDK\Tests\HttpClient\Exception\AuthenticationFailedExceptionTest::testException
statusReason: 1) Shopware\App\SDK\Tests\HttpClient\Exception\AuthenticationFailedExceptionTest::testException
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'Authentication failed for shop shop-id'
+''

[Killed] IncrementInteger
HttpClient/Exception/AuthenticationFailedException.php:13:9
 {
     public function __construct(string $shopId, private readonly ResponseInterface $response, ?\Throwable $previous = null)
     {
-        parent::__construct(sprintf('Authentication failed for shop %s', $shopId), 0, $previous);
+        parent::__construct(sprintf('Authentication failed for shop %s', $shopId), 1, $previous);
     }
 
killedBy: Shopware\App\SDK\Tests\HttpClient\Exception\AuthenticationFailedExceptionTest::testException
statusReason: 1) Shopware\App\SDK\Tests\HttpClient\Exception\AuthenticationFailedExceptionTest::testException
Failed asserting that 1 is identical to 0.

/home/lernhart/work/shopware/app-php-sdk/tests/HttpClient/Exception/AuthenticationFailedExceptionTest.php:22

FAILURES!
Tests: 8, Assertions: 30, Failures: 1.

[Killed] PublicVisibility
HttpClient/Exception/AuthenticationFailedException.php:16:5
         parent::__construct(sprintf('Authentication failed for shop %s', $shopId), 0, $previous);
     }
 
-    public function getResponse(): ResponseInterface
+    protected function getResponse() : ResponseInterface
     {
         return $this->response;
killedBy: Shopware\App\SDK\Tests\HttpClient\Exception\AuthenticationFailedExceptionTest::testException
statusReason: 1) Shopware\App\SDK\Tests\HttpClient\Exception\AuthenticationFailedExceptionTest::testException
Error: Call to protected method Shopware\App\SDK\HttpClient\Exception\AuthenticationFailedException::getResponse() from scope Shopware\App\SDK\Tests\HttpClient\Exception\AuthenticationFailedExceptionTest

/home/lernhart/work/shopware/app-php-sdk/tests/HttpClient/Exception/AuthenticationFailedExceptionTe
