[Killed] PublicVisibility
Context/Cart/CalculatedTax.php:11:5
 
 class CalculatedTax extends ArrayStruct
 {
-    public function getTaxRate(): float
+    protected function getTaxRate() : float
     {
         \assert(is_float($this->data['taxRate']) || is_int($this->data['taxRate']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\Cart\CalculatedTax::getTaxRate() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:257

ERRORS!
Tests: 38, Assertions: 122, Errors: 1.

[Killed] LogicalOr
Context/Cart/CalculatedTax.php:13:9
 {
     public function getTaxRate(): float
     {
-        \assert(is_float($this->data['taxRate']) || is_int($this->data['taxRate']));
+        \assert(is_float($this->data['taxRate']) && is_int($this->data['taxRate']));
         return $this->data['taxRate'];
     }
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
assert(is_float($this->data['taxRate']) && is_int($this->data['taxRate']))

/home/lernhart/work/shopware/app-php-sdk/src/Context/Cart/CalculatedTax.php:11
/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:257

FAILURES!
Tests: 1, Assertions: 22, Failures: 1.

[Killed] PublicVisibility
Context/Cart/CalculatedTax.php:17:5
         return $this->data['taxRate'];
     }
 
-    public function getPrice(): float
+    protected function getPrice() : float
     {
         \assert(is_float($this->data['price']) || is_int($this->data['price']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\Cart\CalculatedTax::getPrice() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:259

ERRORS!
Tests: 38, Assertions: 124, Errors: 1.

[Killed] LogicalOr
Context/Cart/CalculatedTax.php:19:9
 
     public function getPrice(): float
     {
-        \assert(is_float($this->data['price']) || is_int($this->data['price']));
+        \assert(is_float($this->data['price']) && is_int($this->data['price']));
         return $this->data['price'];
     }
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
assert(is_float($this->data['price']) && is_int($this->data['price']))

/home/lernhart/work/shopware/app-php-sdk/src/Context/Cart/CalculatedTax.php:16
/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:259

FAILURES!
Tests: 1, Assertions: 24, Failures: 1.

[Killed] PublicVisibility
Context/Cart/CalculatedTax.php:23:5
         return $this->data['price'];
     }
 
-    public function getTax(): float
+    protected function getTax() : float
     {
         \assert(is_float($this->data['tax']) || is_int($this->data['tax']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\Cart\CalculatedTax::getTax() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:258

ERRORS!
Tests: 38, Assertions: 123, Errors: 1.

[Killed] LogicalOr
Context/Cart/CalculatedTax.php:25:9
 
     public function getTax(): float
     {
-        \assert(is_float($this->data['tax']) || is_int($this->data['tax']));
+        \assert(is_float($this->data['tax']) && is_int($this->data['tax']));
         return $this->data['tax'];
     }
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
assert(is_float($this->data['tax']) && is_int($this->data['tax']))

/home/lernhart/work/shopware/app-php-sdk/src/Context/Cart/CalculatedTax.php:21
/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:258

FAILURES!
Tests: 1, Assertions: 23, Failures: 1.
