[Killed] PublicVisibility
Context/Cart/Cart.php:11:5
 
 class Cart extends ArrayStruct
 {
-    public function getToken(): string
+    protected function getToken() : string
     {
         \assert(is_string($this->data['token']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\Cart\Cart::getToken() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:229

--

There was 1 risky test:

[Killed] PublicVisibility
Context/Cart/Cart.php:17:5
         return $this->data['token'];
     }
 
-    public function getCustomerComment(): ?string
+    protected function getCustomerComment() : ?string
     {
         \assert(is_string($this->data['customerComment']) || is_null($this->data['customerComment']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\Cart\Cart::getCustomerComment() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:232

ERRORS!
Tests: 38, Assertions: 104, Errors: 1.

[Killed] LogicalOr
Context/Cart/Cart.php:19:9
 
     public function getCustomerComment(): ?string
     {
-        \assert(is_string($this->data['customerComment']) || is_null($this->data['customerComment']));
+        \assert(is_string($this->data['customerComment']) && is_null($this->data['customerComment']));
         return $this->data['customerComment'];
     }
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
assert(is_string($this->data['customerComment']) && is_null($this->data['customerComment']))

/home/lernhart/work/shopware/app-php-sdk/src/Context/Cart/Cart.php:16
/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:232

FAILURES!
Tests: 12, Assertions: 72, Failures: 1.

[Killed] PublicVisibility
Context/Cart/Cart.php:23:5
         return $this->data['customerComment'];
     }
 
-    public function getAffiliateCode(): ?string
+    protected function getAffiliateCode() : ?string
     {
         \assert(is_string($this->data['affiliateCode']) || is_null($this->data['affiliateCode']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\Cart\Cart::getAffiliateCode() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:230

ERRORS!
Tests: 38, Assertions: 102, Errors: 1.

[Killed] LogicalOr
Context/Cart/Cart.php:25:9
 
     public function getAffiliateCode(): ?string
     {
-        \assert(is_string($this->data['affiliateCode']) || is_null($this->data['affiliateCode']));
+        \assert(is_string($this->data['affiliateCode']) && is_null($this->data['affiliateCode']));
         return $this->data['affiliateCode'];
     }
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
assert(is_string($this->data['affiliateCode']) && is_null($this->data['affiliateCode']))

/home/lernhart/work/shopware/app-php-sdk/src/Context/Cart/Cart.php:21
/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:230

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] PublicVisibility
Context/Cart/Cart.php:29:5
         return $this->data['affiliateCode'];
     }
 
-    public function getCampaignCode(): ?string
+    protected function getCampaignCode() : ?string
     {
         \assert(is_string($this->data['campaignCode']) || is_null($this->data['campaignCode']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\Cart\Cart::getCampaignCode() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:231

ERRORS!
Tests: 38, Assertions: 103, Errors: 1.

[Killed] LogicalOr
Context/Cart/Cart.php:31:9
 
     public function getCampaignCode(): ?string
     {
-        \assert(is_string($this->data['campaignCode']) || is_null($this->data['campaignCode']));
+        \assert(is_string($this->data['campaignCode']) && is_null($this->data['campaignCode']));
         return $this->data['campaignCode'];
     }
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
assert(is_string($this->data['campaignCode']) && is_null($this->data['campaignCode']))

/home/lernhart/work/shopware/app-php-sdk/src/Context/Cart/Cart.php:26
/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:231

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] PublicVisibility
Context/Cart/Cart.php:38:5
     /**
      * @return array<LineItem>
      */
-    public function getLineItems(): array
+    protected function getLineItems() : array
     {
         \assert(is_array($this->data['lineItems']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\Cart\Cart::getLineItems() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:234

ERRORS!
Tests: 38, Assertions: 105, Errors: 1.

[Killed] PublicVisibility
Context/Cart/Cart.php:50:5
     /**
      * @return array<Delivery>
      */
-    public function getDeliveries(): array
+    protected function getDeliveries() : array
     {
         \assert(is_array($this->data['deliveries']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\Cart\Cart::getDeliveries() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:295

ERRORS!
Tests: 38, Assertions: 143, Errors: 1.

[Killed] PublicVisibility
Context/Cart/Cart.php:62:5
     /**
      * @return array<CartTransaction>
      */
-    public function getTransactions(): array
+    protected function getTransactions() : array
     {
         \assert(is_array($this->data['transactions']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\Cart\Cart::getTransactions() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:325

ERRORS!
Tests: 38, Assertions: 156, Errors: 1.

[Killed] PublicVisibility
Context/Cart/Cart.php:71:5
         );
     }
 
-    public function getPrice(): CartPrice
+    protected function getPrice() : CartPrice
     {
         \assert(is_array($this->data['price']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\Cart\Cart::getPrice() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:269

ERRORS!
Tests: 38, Assertions: 129, Errors: 1.
