[Killed] PublicVisibility
Context/Cart/CartPrice.php:11:5
 
 class CartPrice extends ArrayStruct
 {
-    public function getNetPrice(): float
+    protected function getNetPrice() : float
     {
         \assert(is_float($this->data['netPrice']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\Cart\CartPrice::getNetPrice() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:272

ERRORS!
Tests: 38, Assertions: 130, Errors: 1.

[Killed] PublicVisibility
Context/Cart/CartPrice.php:34:5
         }, $this->data['calculatedTaxes']);
     }
 
-    public function getTaxStatus(): string
+    protected function getTaxStatus() : string
     {
         \assert(is_string($this->data['taxStatus']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\Cart\CartPrice::getTaxStatus() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:274

ERRORS!
Tests: 38, Assertions: 132, Errors: 1.

[Killed] PublicVisibility
Context/Cart/CartPrice.php:52:5
         }, $this->data['taxRules']);
     }
 
-    public function getPositionPrice(): float
+    protected function getPositionPrice() : float
     {
         \assert(is_float($this->data['positionPrice']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\Cart\CartPrice::getPositionPrice() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:273

ERRORS!
Tests: 38, Assertions: 131, Errors: 1.

[Killed] PublicVisibility
Context/Cart/CartPrice.php:58:5
         return $this->data['positionPrice'];
     }
 
-    public function getRawTotal(): float
+    protected function getRawTotal() : float
     {
         \assert(is_float($this->data['rawTotal']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\Cart\CartPrice::getRawTotal() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:275

ERRORS!
Tests: 38, Assertions: 133, Errors: 1.
