[Killed] PublicVisibility
Context/Cart/CartTransaction.php:11:5
 
 class CartTransaction extends ArrayStruct
 {
-    public function getPaymentMethodId(): string
+    protected function getPaymentMethodId() : string
     {
         \assert(is_string($this->data['paymentMethodId']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\Cart\CartTransaction::getPaymentMethodId() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:333

ERRORS!
Tests: 38, Assertions: 159, Errors: 1.

[Killed] PublicVisibility
Context/Cart/CartTransaction.php:17:5
         return $this->data['paymentMethodId'];
     }
 
-    public function getAmount(): CalculatedPrice
+    protected function getAmount() : CalculatedPrice
     {
         \assert(is_array($this->data['amount']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\Cart\CartTransaction::getAmount() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:332

ERRORS!
Tests: 38, Assertions: 158, Errors: 1.
