[Killed] PublicVisibility
Context/Cart/Delivery.php:16:5
     /**
      * @return array<DeliveryPosition>
      */
-    public function getPositions(): array
+    protected function getPositions() : array
     {
         \assert(is_array($this->data['positions']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\Cart\Delivery::getPositions() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:307

ERRORS!
Tests: 38, Assertions: 148, Errors: 1.

[Killed] UnwrapArrayMap
Context/Cart/Delivery.php:20:9
     {
         \assert(is_array($this->data['positions']));
 
-        return array_map(function (array $position) {
-            return new DeliveryPosition($position);
-        }, $this->data['positions']);
+        return $this->data['positions'];
     }
 
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to a member function getQuantity() on array

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:314

ERRORS!
Tests: 38, Assertions: 150, Errors: 1.

[Killed] NewObject
Context/Cart/Delivery.php:21:13
         \assert(is_array($this->data['positions']));
 
         return array_map(function (array $position) {
-            return new DeliveryPosition($position);
+            new DeliveryPosition($position);
+            return null;
         }, $this->data['positions']);
     }
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to a member function getQuantity() on null

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:314

ERRORS!
Tests: 38, Assertions: 150, Errors: 1.

[Killed] PublicVisibility
Context/Cart/Delivery.php:25:5
         }, $this->data['positions']);
     }
 
-    public function getLocation(): ShippingLocation
+    protected function getLocation() : ShippingLocation
     {
         \assert(is_array($this->data['location']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\Cart\Delivery::getLocation() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:321

ERRORS!
Tests: 38, Assertions: 155, Errors: 1.

[Killed] PublicVisibility
Context/Cart/Delivery.php:31:5
         return new ShippingLocation($this->data['location']);
     }
 
-    public function getShippingMethod(): ShippingMethod
+    protected function getShippingMethod() : ShippingMethod
     {
         \assert(is_array($this->data['shippingMethod']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\Cart\Delivery::getShippingMethod() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:301

ERRORS!
Tests: 38, Assertions: 145, Errors: 1.

[Killed] PublicVisibility
Context/Cart/Delivery.php:37:5
         return new ShippingMethod($this->data['shippingMethod']);
     }
 
-    public function getDeliveryDate(): DeliveryDate
+    protected function getDeliveryDate() : DeliveryDate
     {
         \assert(is_array($this->data['deliveryDate']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\Cart\Delivery::getDeliveryDate() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:303

ERRORS!
Tests: 38, Assertions: 146, Errors: 1.
