[Killed] PublicVisibility
Context/Cart/DeliveryDate.php:11:5
 
 class DeliveryDate extends ArrayStruct
 {
-    public function getEarliest(): \DateTimeInterface
+    protected function getEarliest() : \DateTimeInterface
     {
         \assert(is_string($this->data['earliest']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\Cart\DeliveryDate::getEarliest() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:304

ERRORS!
Tests: 38, Assertions: 146, Errors: 1.

[Killed] PublicVisibility
Context/Cart/DeliveryDate.php:17:5
         return new \DateTimeImmutable($this->data['earliest']);
     }
 
-    public function getLatest(): \DateTimeInterface
+    protected function getLatest() : \DateTimeInterface
     {
         \assert(is_string($this->data['latest']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\Cart\DeliveryDate::getLatest() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:305

ERRORS!
Tests: 38, Assertions: 147, Errors: 1.
