[Killed] PublicVisibility
Context/Cart/DeliveryPosition.php:11:5
 
 class DeliveryPosition extends ArrayStruct
 {
-    public function getLineItem(): LineItem
+    protected function getLineItem() : LineItem
     {
         \assert(is_array($this->data['lineItem']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\Cart\DeliveryPosition::getLineItem() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:318

ERRORS!
Tests: 38, Assertions: 153, Errors: 1.

[Killed] PublicVisibility
Context/Cart/DeliveryPosition.php:29:5
         return new DeliveryDate($this->data['deliveryDate']);
     }
 
-    public function getPrice(): CalculatedPrice
+    protected function getPrice() : CalculatedPrice
     {
         \assert(is_array($this->data['price']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\Cart\DeliveryPosition::getPrice() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:319

ERRORS!
Tests: 38, Assertions: 154, Errors: 1.
