[Killed] PublicVisibility
Context/Cart/LineItem.php:11:5
 
 class LineItem extends ArrayStruct
 {
-    public function getId(): string
+    protected function getId() : string
     {
         \assert(is_string($this->data['id']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\Cart\LineItem::getId() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:237

2) Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
Error: Call to protected

[Killed] PublicVisibility
Context/Cart/LineItem.php:17:5
         return $this->data['id'];
     }
 
-    public function getUniqueIdentifier(): string
+    protected function getUniqueIdentifier() : string
     {
         \assert(is_string($this->data['uniqueIdentifier']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\Cart\LineItem::getUniqueIdentifier() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:238

ERRORS!
Tests: 38, Assertions: 108, Errors: 1.

[Killed] PublicVisibility
Context/Cart/LineItem.php:23:5
         return $this->data['uniqueIdentifier'];
     }
 
-    public function getType(): string
+    protected function getType() : string
     {
         \assert(is_string($this->data['type']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\Cart\LineItem::getType() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:239

ERRORS!
Tests: 38, Assertions: 109, Errors: 1.

[Killed] PublicVisibility
Context/Cart/LineItem.php:29:5
         return $this->data['type'];
     }
 
-    public function getReferencedId(): string
+    protected function getReferencedId() : string
     {
         \assert(is_string($this->data['referencedId']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\Cart\LineItem::getReferencedId() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:244

ERRORS!
Tests: 38, Assertions: 114, Errors: 1.

[Killed] PublicVisibility
Context/Cart/LineItem.php:35:5
         return $this->data['referencedId'];
     }
 
-    public function getLabel(): string
+    protected function getLabel() : string
     {
         \assert(is_string($this->data['label']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\Cart\LineItem::getLabel() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:242

2) Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
Error: Call to protec

[Killed] PublicVisibility
Context/Cart/LineItem.php:41:5
         return $this->data['label'];
     }
 
-    public function isGood(): bool
+    protected function isGood() : bool
     {
         \assert(is_bool($this->data['good']));
killedBy: Shopware\App\SDK\Tests\Context\Cart\LineItemTest::testGetChildren
statusReason: 1) Shopware\App\SDK\Tests\Context\Cart\LineItemTest::testGetChildren
Error: Call to protected method Shopware\App\SDK\Context\Cart\LineItem::isGood() from scope Shopware\App\SDK\Tests\Context\Cart\LineItemTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/Cart/LineItemTest.php:38

2) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected meth

[Killed] PublicVisibility
Context/Cart/LineItem.php:56:5
     /**
      * @return array<mixed>
      */
-    public function getPayload(): array
+    protected function getPayload() : array
     {
         \assert(is_array($this->data['payload']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\Cart\LineItem::getPayload() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:240

ERRORS!
Tests: 38, Assertions: 110, Errors: 1.

[Killed] PublicVisibility
Context/Cart/LineItem.php:71:5
     /**
      * @return array<string>
      */
-    public function getStates(): array
+    protected function getStates() : array
     {
         \assert(is_array($this->data['states']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\Cart\LineItem::getStates() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:243

ERRORS!
Tests: 38, Assertions: 113, Errors: 1.

[Killed] PublicVisibility
Context/Cart/LineItem.php:81:5
     /**
      * @return array<LineItem>
      */
-    public function getChildren(): array
+    protected function getChildren() : array
     {
         \assert(is_array($this->data['children']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\Cart\LineItem::getChildren() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:246

2) Shopware\App\SDK\Tests\Context\Cart\LineItemTest::testGetChildren
Error: Call to prot
