[Killed] PublicVisibility
Context/Cart/TaxRule.php:17:5
         return $this->data['taxRate'];
     }
 
-    public function getPercentage(): float
+    protected function getPercentage() : float
     {
         \assert(is_float($this->data['percentage']) || is_int($this->data['percentage']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\Cart\TaxRule::getPercentage() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:267

ERRORS!
Tests: 38, Assertions: 128, Errors: 1.

[Killed] LogicalOr
Context/Cart/TaxRule.php:19:9
 
     public function getPercentage(): float
     {
-        \assert(is_float($this->data['percentage']) || is_int($this->data['percentage']));
+        \assert(is_float($this->data['percentage']) && is_int($this->data['percentage']));
         return $this->data['percentage'];
     }
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
assert(is_float($this->data['percentage']) && is_int($this->data['percentage']))

/home/lernhart/work/shopware/app-php-sdk/src/Context/Cart/TaxRule.php:16
/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:267

FAILURES!
Tests: 1, Assertions: 28, Failures: 1.
