[Killed] PublicVisibility
Context/ContextResolver.php:25:5
 
 class ContextResolver
 {
-    public function assembleWebhook(RequestInterface $request, ShopInterface $shop): Webhook
+    protected function assembleWebhook(RequestInterface $request, ShopInterface $shop) : Webhook
     {
         $body = json_decode($request->getBody()->getContents(), true, flags: JSON_THROW_ON_ERROR);
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleWebhook
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testBodyRewindIsCalled with data set #0
Failed asserting that exception of type "Error" matches expected exception "Shopware\App\SDK\Exception\MalformedWebhookBodyException". Message was: "Call to protected method Shopware\App\SDK\Context\ContextResolver::assembleWebhook() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest" at
/home

[Killed] MethodCallRemoval
Context/ContextResolver.php:28:9
     public function assembleWebhook(RequestInterface $request, ShopInterface $shop): Webhook
     {
         $body = json_decode($request->getBody()->getContents(), true, flags: JSON_THROW_ON_ERROR);
-        $request->getBody()->rewind();
+        
 
         if (!is_array($body) || !isset($body['source']) || !is_array($body['source'])) {
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testBodyRewindIsCalled with data set #0
Expectation failed for method name is "rewind" when invoked 1 time(s).
Method was expected to be called 1 times, actually called 0 times.

FAILURES!
Tests: 18, Assertions: 229, Failures: 1.

[Killed] LogicalOr
Context/ContextResolver.php:30:9
         $body = json_decode($request->getBody()->getContents(), true, flags: JSON_THROW_ON_ERROR);
         $request->getBody()->rewind();
 
-        if (!is_array($body) || !isset($body['source']) || !is_array($body['source'])) {
+        if ((!is_array($body) || !isset($body['source'])) && !is_array($body['source'])) {
             throw new MalformedWebhookBodyException();
         }
statusReason: PHPUnit 10.1.2 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.1.18
Configuration: /tmp/infection/phpunitConfiguration.6d0fa326e815c0e6e6e1550e8f235de6.infection.xml

.................W......W......W......                            38 / 38 (100%)

Time: 00:00.013, Memory: 12.00 MB

[Killed] LogicalOr
Context/ContextResolver.php:30:9
         $body = json_decode($request->getBody()->getContents(), true, flags: JSON_THROW_ON_ERROR);
         $request->getBody()->rewind();
 
-        if (!is_array($body) || !isset($body['source']) || !is_array($body['source'])) {
+        if (!is_array($body) && !isset($body['source']) || !is_array($body['source'])) {
             throw new MalformedWebhookBodyException();
         }
statusReason: PHPUnit 10.1.2 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.1.18
Configuration: /tmp/infection/phpunitConfiguration.47c2a1f1ff5d94af8023881e9fa96c5e.infection.xml

.................W......W......W......                            38 / 38 (100%)

Time: 00:00.013, Memory: 12.00 MB

[Killed] Throw_
Context/ContextResolver.php:31:13
         $request->getBody()->rewind();
 
         if (!is_array($body) || !isset($body['source']) || !is_array($body['source'])) {
-            throw new MalformedWebhookBodyException();
+            new MalformedWebhookBodyException();
         }
 
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testBodyRewindIsCalled with data set #0
/home/lernhart/work/shopware/app-php-sdk/src/Context/ContextResolver.php:98
/home/lernhart/work/shopware/app-php-sdk/src/Context/ContextResolver.php:30
/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:710
.

FAILURES!

[Killed] ConcatOperandRemoval
Context/ContextResolver.php:39:13
             $this->parseSource($body['source']),
             $body['data']['event'],
             $body['data']['payload'],
-            new \DateTimeImmutable('@' . $body['timestamp'])
+            return new Webhook($shop, $this->parseSource($body['source']), $body['data']['event'], $body['data']['payload'], new \DateTimeImmutable($body['timestamp']));
         );
     }
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleWebhook
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleWebhook
TypeError: DateTimeImmutable::__construct(): Argument #1 ($datetime) must be of type string, int given

/home/lernhart/work/shopware/app-php-sdk/src/Context/ContextResolver.php:30
/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:127

--

[Killed] Concat
Context/ContextResolver.php:39:13
             $this->parseSource($body['source']),
             $body['data']['event'],
             $body['data']['payload'],
-            new \DateTimeImmutable('@' . $body['timestamp'])
+            return new Webhook($shop, $this->parseSource($body['source']), $body['data']['event'], $body['data']['payload'], new \DateTimeImmutable($body['timestamp'] . '@'));
         );
     }
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleWebhook
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleWebhook
Exception: Failed to parse time string (123456789@) at position 6 (7): Unexpected character

/home/lernhart/work/shopware/app-php-sdk/src/Context/ContextResolver.php:30
/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:127

--

[Killed] PublicVisibility
Context/ContextResolver.php:43:5
         );
     }
 
-    public function assembleActionButton(RequestInterface $request, ShopInterface $shop): ActionButton
+    protected function assembleActionButton(RequestInterface $request, ShopInterface $shop) : ActionButton
     {
         $body = json_decode($request->getBody()->getContents(), true, flags: JSON_THROW_ON_ERROR);
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testMalformedSource
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testMalformedSource
/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:179
.

FAILURES!
Tests: 6, Assertions: 207, Failures: 1.

[Killed] LogicalNot
Context/ContextResolver.php:48:9
         $body = json_decode($request->getBody()->getContents(), true, flags: JSON_THROW_ON_ERROR);
         $request->getBody()->rewind();
 
-        if (!is_array($body) || !isset($body['source']) || !is_array($body['source'])) {
+        if (!is_array($body) || !isset($body['source']) || is_array($body['source'])) {
             throw new MalformedWebhookBodyException();
         }
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleActionButton
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleActionButton
Shopware\App\SDK\Exception\MalformedWebhookBodyException: Malformed webhook body, cannot parse body

/home/lernhart/work/shopware/app-php-sdk/src/Context/ContextResolver.php:37
/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:163

--

[Killed] PublicVisibility
Context/ContextResolver.php:61:5
         );
     }
 
-    public function assembleModule(RequestInterface $request, ShopInterface $shop): Module
+    protected function assembleModule(RequestInterface $request, ShopInterface $shop) : Module
     {
         parse_str($request->getUri()->getQuery(), $params);
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleModule
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleModuleInvalid with data set #0
Failed asserting that exception of type "Error" matches expected exception "Shopware\App\SDK\Exception\MalformedWebhookBodyException". Message was: "Call to protected method Shopware\App\SDK\Context\ContextResolver::assembleModule() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest" at
/ho

[Killed] FunctionCallRemoval
Context/ContextResolver.php:63:9
 
     public function assembleModule(RequestInterface $request, ShopInterface $shop): Module
     {
-        parse_str($request->getUri()->getQuery(), $params);
+        
 
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleModule
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleModule
Shopware\App\SDK\Exception\MalformedWebhookBodyException: Malformed webhook body, cannot parse body

/home/lernhart/work/shopware/app-php-sdk/src/Context/ContextResolver.php:45
/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:195

--

[Killed] Throw_
Context/ContextResolver.php:66:13
         parse_str($request->getUri()->getQuery(), $params);
 
-            throw new MalformedWebhookBodyException();
+            new MalformedWebhookBodyException();
         }
 
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleModuleInvalid with data set #0
/home/lernhart/work/shopware/app-php-sdk/src/Context/Module/Module.php:15
/home/lernhart/work/shopware/app-php-sdk/src/Context/ContextResolver.php:47
/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:213
.

FAILURES!

[Killed] PublicVisibility
Context/ContextResolver.php:77:5
         );
     }
 
-    public function assembleTaxProvider(RequestInterface $request, ShopInterface $shop): TaxProvider
+    protected function assembleTaxProvider(RequestInterface $request, ShopInterface $shop) : TaxProvider
     {
         $body = json_decode($request->getBody()->getContents(), true, flags: JSON_THROW_ON_ERROR);
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testBodyRewindIsCalled with data set #2
/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:710
.

--

There was 1 risky test:

[Killed] LogicalNot
Context/ContextResolver.php:82:9
         $body = json_decode($request->getBody()->getContents(), true, flags: JSON_THROW_ON_ERROR);
         $request->getBody()->rewind();
 
-        if (!is_array($body) || !isset($body['source']) || !is_array($body['source'])) {
+        if (is_array($body) || !isset($body['source']) || !is_array($body['source'])) {
             throw new MalformedWebhookBodyException();
         }
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Shopware\App\SDK\Exception\MalformedWebhookBodyException: Malformed webhook body, cannot parse body

/home/lernhart/work/shopware/app-php-sdk/src/Context/ContextResolver.php:54
/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:227

--

[Killed] PublicVisibility
Context/ContextResolver.php:94:5
         );
     }
 
-    public function assemblePaymentPay(RequestInterface $request, ShopInterface $shop): PaymentPayAction
+    protected function assemblePaymentPay(RequestInterface $request, ShopInterface $shop) : PaymentPayAction
     {
         $body = json_decode($request->getBody()->getContents(), true, flags: JSON_THROW_ON_ERROR);
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssemblePay
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testBodyRewindIsCalled with data set #3
/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:710
.

--

There were 2 risky tests:

[Killed] PublicVisibility
Context/ContextResolver.php:113:5
         );
     }
 
-    public function assemblePaymentFinalize(RequestInterface $request, ShopInterface $shop): PaymentFinalizeAction
+    protected function assemblePaymentFinalize(RequestInterface $request, ShopInterface $shop) : PaymentFinalizeAction
     {
         $body = json_decode($request->getBody()->getContents(), true, flags: JSON_THROW_ON_ERROR);
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssemblePayFinalize
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testBodyRewindIsCalled with data set #4
/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:710
.

--

There were 2 risky tests:

[Killed] LogicalNot
Context/ContextResolver.php:118:9
         $body = json_decode($request->getBody()->getContents(), true, flags: JSON_THROW_ON_ERROR);
         $request->getBody()->rewind();
 
-        if (!is_array($body) || !isset($body['source']) || !is_array($body['source'])) {
+        if (!is_array($body) || isset($body['source']) || !is_array($body['source'])) {
             throw new MalformedWebhookBodyException();
         }
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleFinalize
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleFinalize
Shopware\App\SDK\Exception\MalformedWebhookBodyException: Malformed webhook body, cannot parse body

/home/lernhart/work/shopware/app-php-sdk/src/Context/ContextResolver.php:72
/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:638

2) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAsse

[Killed] Coalesce
Context/ContextResolver.php:126:13
             $shop,
             $this->parseSource($body['source']),
             new OrderTransaction($body['orderTransaction']),
-            $body['queryParameters'] ?? []
+            return new PaymentFinalizeAction($shop, $this->parseSource($body['source']), new OrderTransaction($body['orderTransaction']), [] ?? $body['queryParameters']);
         );
     }
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssemblePayFinalize
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssemblePayFinalize
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
-Array &0 (
-    'returnId' => '123'
-)

[Killed] PublicVisibility
Context/ContextResolver.php:130:5
         );
     }
 
-    public function assemblePaymentCapture(RequestInterface $request, ShopInterface $shop): PaymentCaptureAction
+    protected function assemblePaymentCapture(RequestInterface $request, ShopInterface $shop) : PaymentCaptureAction
     {
         $body = json_decode($request->getBody()->getContents(), true, flags: JSON_THROW_ON_ERROR);
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testPaymentPayCapture
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testBodyRewindIsCalled with data set #5
/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:710
.

--

There were 2 risky tests:

[Killed] Coalesce
Context/ContextResolver.php:144:13
             $this->parseSource($body['source']),
             new Order($body['order']),
             new OrderTransaction($body['orderTransaction']),
-            $body['preOrderPayment'] ?? []
+            return new PaymentCaptureAction($shop, $this->parseSource($body['source']), new Order($body['order']), new OrderTransaction($body['orderTransaction']), [] ?? $body['preOrderPayment']);
         );
     }
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testPaymentPayCapture
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testPaymentPayCapture
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
-Array &0 (
-    'returnId' => '123'
-)

[Killed] PublicVisibility
Context/ContextResolver.php:148:5
         );
     }
 
-    public function assemblePaymentValidate(RequestInterface $request, ShopInterface $shop): PaymentValidateAction
+    protected function assemblePaymentValidate(RequestInterface $request, ShopInterface $shop) : PaymentValidateAction
     {
         $body = json_decode($request->getBody()->getContents(), true, flags: JSON_THROW_ON_ERROR);
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleValidate
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testBodyRewindIsCalled with data set #6
/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:710
.

--

There was 1 risky test:

[Killed] Coalesce
Context/ContextResolver.php:162:13
             $this->parseSource($body['source']),
             new Cart($body['cart']),
             new SalesChannelContext($body['salesChannelContext']),
-            $body['requestData'] ?? []
+            return new PaymentValidateAction($shop, $this->parseSource($body['source']), new Cart($body['cart']), new SalesChannelContext($body['salesChannelContext']), [] ?? $body['requestData']);
         );
     }
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleValidate
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleValidate
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
-Array &0 (
-    'tos' => 'on'
-)

[Killed] LogicalOr
Context/ContextResolver.php:172:9
      */
     private function parseSource(array $source): ActionSource
     {
-        if (!isset($source['url']) || !is_string($source['url']) || !isset($source['appVersion']) || !is_string($source['appVersion'])) {
+        if ((!isset($source['url']) || !is_string($source['url']) || !isset($source['appVersion'])) && !is_string($source['appVersion'])) {
             throw new MalformedWebhookBodyException();
         }
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testParseSourceInvalid with data set #6
/home/lernhart/work/shopware/app-php-sdk/src/Context/ActionSource.php:13
/home/lernhart/work/shopware/app-php-sdk/src/Context/ContextResolver.php:103
/home/lernhart/work/shopware/app-php-sdk/src/Context/ContextResolver.php:30
/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:

[Killed] LogicalNot
Context/ContextResolver.php:172:9
      */
     private function parseSource(array $source): ActionSource
     {
-        if (!isset($source['url']) || !is_string($source['url']) || !isset($source['appVersion']) || !is_string($source['appVersion'])) {
+        if (!isset($source['url']) || is_string($source['url']) || !isset($source['appVersion']) || !is_string($source['appVersion'])) {
             throw new MalformedWebhookBodyException();
         }
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleActionButton
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleActionButton
Shopware\App\SDK\Exception\MalformedWebhookBodyException: Malformed webhook body, cannot parse body

/home/lernhart/work/shopware/app-php-sdk/src/Context/ContextResolver.php:101
/home/lernhart/work/shopware/app-php-sdk/src/Context/ContextResolver.php:39
/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextReso

[Killed] Throw_
Context/ContextResolver.php:173:13
     private function parseSource(array $source): ActionSource
     {
         if (!isset($source['url']) || !is_string($source['url']) || !isset($source['appVersion']) || !is_string($source['appVersion'])) {
-            throw new MalformedWebhookBodyException();
+            new MalformedWebhookBodyException();
         }
 
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testMalformedSource
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testMalformedSource
/home/lernhart/work/shopware/app-php-sdk/src/Context/ActionSource.php:13
/home/lernhart/work/shopware/app-php-sdk/src/Context/ContextResolver.php:103
/home/lernhart/work/shopware/app-php-sdk/src/Context/ContextResolver.php:39
/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:185
.
