[Killed] PublicVisibility
Context/Order/Order.php:21:5
 {
     use CustomFieldsAware;
 
-    public function getId(): string
+    protected function getId() : string
     {
         \assert(\is_string($this->data['id']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
Error: Call to protected method Shopware\App\SDK\Context\Order\Order::getId() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:573

2) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssemblePay
Error: Call to protected method Sh

[Killed] PublicVisibility
Context/Order/Order.php:27:5
         return $this->data['id'];
     }
 
-    public function getOrderNumber(): string
+    protected function getOrderNumber() : string
     {
         \assert(\is_string($this->data['orderNumber']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
Error: Call to protected method Shopware\App\SDK\Context\Order\Order::getOrderNumber() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:574

ERRORS!
Tests: 38, Assertions: 223, Errors: 1.

[Killed] PublicVisibility
Context/Order/Order.php:33:5
         return $this->data['orderNumber'];
     }
 
-    public function getCurrencyFactor(): float
+    protected function getCurrencyFactor() : float
     {
         \assert(\is_float($this->data['currencyFactor']) || is_int($this->data['currencyFactor']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
Error: Call to protected method Shopware\App\SDK\Context\Order\Order::getCurrencyFactor() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:575

ERRORS!
Tests: 38, Assertions: 224, Errors: 1.

[Killed] LogicalOr
Context/Order/Order.php:35:9
 
     public function getCurrencyFactor(): float
     {
-        \assert(\is_float($this->data['currencyFactor']) || is_int($this->data['currencyFactor']));
+        \assert(\is_float($this->data['currencyFactor']) && is_int($this->data['currencyFactor']));
         return $this->data['currencyFactor'];
     }
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
assert(\is_float($this->data['currencyFactor']) && is_int($this->data['currencyFactor']))

/home/lernhart/work/shopware/app-php-sdk/src/Context/Order/Order.php:30
/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:575

FAILURES!
Tests: 3, Assertions: 166, Failures: 1.

[Killed] PublicVisibility
Context/Order/Order.php:39:5
         return $this->data['currencyFactor'];
     }
 
-    public function getOrderDate(): \DateTimeInterface
+    protected function getOrderDate() : \DateTimeInterface
     {
         \assert(is_string($this->data['orderDateTime']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
Error: Call to protected method Shopware\App\SDK\Context\Order\Order::getOrderDate() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:576

ERRORS!
Tests: 38, Assertions: 225, Errors: 1.

[Killed] PublicVisibility
Context/Order/Order.php:51:5
         return new CartPrice($this->data['price']);
     }
 
-    public function getAmountTotal(): float
+    protected function getAmountTotal() : float
     {
         \assert(\is_float($this->data['amountTotal']) || is_int($this->data['amountTotal']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
Error: Call to protected method Shopware\App\SDK\Context\Order\Order::getAmountTotal() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:578

ERRORS!
Tests: 38, Assertions: 227, Errors: 1.

[Killed] LogicalOr
Context/Order/Order.php:53:9
 
     public function getAmountTotal(): float
     {
-        \assert(\is_float($this->data['amountTotal']) || is_int($this->data['amountTotal']));
+        \assert(\is_float($this->data['amountTotal']) && is_int($this->data['amountTotal']));
         return $this->data['amountTotal'];
     }
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
assert(\is_float($this->data['amountTotal']) && is_int($this->data['amountTotal']))

/home/lernhart/work/shopware/app-php-sdk/src/Context/Order/Order.php:45
/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:578

FAILURES!
Tests: 3, Assertions: 169, Failures: 1.

[Killed] PublicVisibility
Context/Order/Order.php:57:5
         return $this->data['amountTotal'];
     }
 
-    public function getAmountNet(): float
+    protected function getAmountNet() : float
     {
         \assert(\is_float($this->data['amountNet']) || is_int($this->data['amountNet']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
Error: Call to protected method Shopware\App\SDK\Context\Order\Order::getAmountNet() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:579

ERRORS!
Tests: 38, Assertions: 228, Errors: 1.

[Killed] LogicalOr
Context/Order/Order.php:59:9
 
     public function getAmountNet(): float
     {
-        \assert(\is_float($this->data['amountNet']) || is_int($this->data['amountNet']));
+        \assert(\is_float($this->data['amountNet']) && is_int($this->data['amountNet']));
         return $this->data['amountNet'];
     }
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
assert(\is_float($this->data['amountNet']) && is_int($this->data['amountNet']))

/home/lernhart/work/shopware/app-php-sdk/src/Context/Order/Order.php:50
/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:579

FAILURES!
Tests: 3, Assertions: 170, Failures: 1.

[Killed] LogicalOr
Context/Order/Order.php:65:9
 
     public function getPositionPrice(): float
     {
-        \assert(\is_float($this->data['positionPrice']) || is_int($this->data['positionPrice']));
+        \assert(\is_float($this->data['positionPrice']) && is_int($this->data['positionPrice']));
         return $this->data['positionPrice'];
     }
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
assert(\is_float($this->data['positionPrice']) && is_int($this->data['positionPrice']))

/home/lernhart/work/shopware/app-php-sdk/src/Context/Order/Order.php:55
/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:580

FAILURES!
Tests: 3, Assertions: 171, Failures: 1.

[Killed] PublicVisibility
Context/Order/Order.php:75:5
         return $this->data['taxStatus'];
     }
 
-    public function getShippingTotal(): float
+    protected function getShippingTotal() : float
     {
         \assert(\is_float($this->data['shippingTotal']) || is_int($this->data['shippingTotal']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
Error: Call to protected method Shopware\App\SDK\Context\Order\Order::getShippingTotal() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:582

ERRORS!
Tests: 38, Assertions: 231, Errors: 1.

[Killed] LogicalOr
Context/Order/Order.php:77:9
 
     public function getShippingTotal(): float
     {
-        \assert(\is_float($this->data['shippingTotal']) || is_int($this->data['shippingTotal']));
+        \assert(\is_float($this->data['shippingTotal']) && is_int($this->data['shippingTotal']));
         return $this->data['shippingTotal'];
     }
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
assert(\is_float($this->data['shippingTotal']) && is_int($this->data['shippingTotal']))

/home/lernhart/work/shopware/app-php-sdk/src/Context/Order/Order.php:65
/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:582

FAILURES!
Tests: 2, Assertions: 19, Failures: 1.

[Killed] PublicVisibility
Context/Order/Order.php:81:5
         return $this->data['shippingTotal'];
     }
 
-    public function getShippingCosts(): CalculatedPrice
+    protected function getShippingCosts() : CalculatedPrice
     {
         \assert(\is_array($this->data['shippingCosts']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
Error: Call to protected method Shopware\App\SDK\Context\Order\Order::getShippingCosts() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:583

ERRORS!
Tests: 38, Assertions: 232, Errors: 1.

[Killed] PublicVisibility
Context/Order/Order.php:87:5
         return new CalculatedPrice($this->data['shippingCosts']);
     }
 
-    public function getOrderCustomer(): Customer
+    protected function getOrderCustomer() : Customer
     {
         \assert(\is_array($this->data['orderCustomer']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
Error: Call to protected method Shopware\App\SDK\Context\Order\Order::getOrderCustomer() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:584

ERRORS!
Tests: 38, Assertions: 233, Errors: 1.

[Killed] PublicVisibility
Context/Order/Order.php:93:5
         return new Customer($this->data['orderCustomer']);
     }
 
-    public function getCurrency(): Currency
+    protected function getCurrency() : Currency
     {
         \assert(\is_array($this->data['currency']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
Error: Call to protected method Shopware\App\SDK\Context\Order\Order::getCurrency() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:572

ERRORS!
Tests: 38, Assertions: 221, Errors: 1.

[Killed] PublicVisibility
Context/Order/Order.php:99:5
         return new Currency($this->data['currency']);
     }
 
-    public function getBillingAddress(): Address
+    protected function getBillingAddress() : Address
     {
         \assert(\is_array($this->data['billingAddress']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
Error: Call to protected method Shopware\App\SDK\Context\Order\Order::getBillingAddress() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:585

ERRORS!
Tests: 38, Assertions: 234, Errors: 1.

[Killed] UnwrapArrayMap
Context/Order/Order.php:111:9
     public function getLineItems(): array
     {
         \assert(\is_array($this->data['lineItems']));
-        return array_map(function (array $lineItem): LineItem {
-            return new LineItem($lineItem);
-        }, $this->data['lineItems']);
+        return $this->data['lineItems'];
     }
 
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
Error: Call to a member function getId() on array

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:594

ERRORS!
Tests: 38, Assertions: 240, Errors: 1.

[Killed] PublicVisibility
Context/Order/Order.php:116:5
         }, $this->data['lineItems']);
     }
 
-    public function getItemRounding(): RoundingConfig
+    protected function getItemRounding() : RoundingConfig
     {
         \assert(\is_array($this->data['itemRounding']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
Error: Call to protected method Shopware\App\SDK\Context\Order\Order::getItemRounding() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:587

ERRORS!
Tests: 38, Assertions: 236, Errors: 1.

[Killed] PublicVisibility
Context/Order/Order.php:122:5
         return new RoundingConfig($this->data['itemRounding']);
     }
 
-    public function getTotalRounding(): RoundingConfig
+    protected function getTotalRounding() : RoundingConfig
     {
         \assert(\is_array($this->data['totalRounding']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
Error: Call to protected method Shopware\App\SDK\Context\Order\Order::getTotalRounding() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:588

ERRORS!
Tests: 38, Assertions: 237, Errors: 1.

[Killed] PublicVisibility
Context/Order/Order.php:128:5
         return new RoundingConfig($this->data['totalRounding']);
     }
 
-    public function getDeepLinkCode(): string
+    protected function getDeepLinkCode() : string
     {
         \assert(\is_string($this->data['deepLinkCode']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
Error: Call to protected method Shopware\App\SDK\Context\Order\Order::getDeepLinkCode() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:586

ERRORS!
Tests: 38, Assertions: 235, Errors: 1.

[Killed] PublicVisibility
Context/Order/Order.php:134:5
         return $this->data['deepLinkCode'];
     }
 
-    public function getSalesChannelId(): string
+    protected function getSalesChannelId() : string
     {
         \assert(\is_string($this->data['salesChannelId']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
Error: Call to protected method Shopware\App\SDK\Context\Order\Order::getSalesChannelId() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:589

ERRORS!
Tests: 38, Assertions: 238, Errors: 1.

[Killed] UnwrapArrayMap
Context/Order/Order.php:157:9
     public function getTransactions(): array
     {
         \assert(\is_array($this->data['transactions']));
-        return array_map(function (array $transaction): OrderTransaction {
-            return new OrderTransaction($transaction);
-        }, $this->data['transactions']);
+        return $this->data['transactions'];
     }
 }
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
Error: Call to a member function getId() on array

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:615

ERRORS!
Tests: 38, Assertions: 251, Errors: 1.
