[Killed] PublicVisibility
Context/Order/OrderDelivery.php:19:5
     /**
      * @return array<string>
      */
-    public function getTrackingCodes(): array
+    protected function getTrackingCodes() : array
     {
         \assert(\is_array($this->data['trackingCodes']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
Error: Call to protected method Shopware\App\SDK\Context\Order\OrderDelivery::getTrackingCodes() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:602

ERRORS!
Tests: 38, Assertions: 243, Errors: 1.

[Killed] PublicVisibility
Context/Order/OrderDelivery.php:31:5
         return new CalculatedPrice($this->data['shippingCosts']);
     }
 
-    public function getShippingOrderAddress(): Address
+    protected function getShippingOrderAddress() : Address
     {
         \assert(\is_array($this->data['shippingOrderAddress']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
Error: Call to protected method Shopware\App\SDK\Context\Order\OrderDelivery::getShippingOrderAddress() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:604

ERRORS!
Tests: 38, Assertions: 245, Errors: 1.

[Killed] PublicVisibility
Context/Order/OrderDelivery.php:37:5
         return new Address($this->data['shippingOrderAddress']);
     }
 
-    public function getStateMachineState(): StateMachineState
+    protected function getStateMachineState() : StateMachineState
     {
         \assert(\is_array($this->data['stateMachineState']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
Error: Call to protected method Shopware\App\SDK\Context\Order\OrderDelivery::getStateMachineState() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:605

ERRORS!
Tests: 38, Assertions: 246, Errors: 1.

[Killed] PublicVisibility
Context/Order/OrderDelivery.php:43:5
         return new StateMachineState($this->data['stateMachineState']);
     }
 
-    public function getShippingDateEarliest(): \DateTimeInterface
+    protected function getShippingDateEarliest() : \DateTimeInterface
     {
         \assert(\is_string($this->data['shippingDateEarliest']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
Error: Call to protected method Shopware\App\SDK\Context\Order\OrderDelivery::getShippingDateEarliest() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:607

ERRORS!
Tests: 38, Assertions: 248, Errors: 1.

[Killed] PublicVisibility
Context/Order/OrderDelivery.php:49:5
         return new \DateTimeImmutable($this->data['shippingDateEarliest']);
     }
 
-    public function getShippingDateLatest(): \DateTimeInterface
+    protected function getShippingDateLatest() : \DateTimeInterface
     {
         \assert(\is_string($this->data['shippingDateLatest']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
Error: Call to protected method Shopware\App\SDK\Context\Order\OrderDelivery::getShippingDateLatest() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:608

ERRORS!
Tests: 38, Assertions: 249, Errors: 1.
