[Killed] PublicVisibility
Context/Order/OrderTransaction.php:28:5
         return new CalculatedPrice($this->data['amount']);
     }
 
-    public function getPaymentMethod(): PaymentMethod
+    protected function getPaymentMethod() : PaymentMethod
     {
         \assert(\is_array($this->data['paymentMethod']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
Error: Call to protected method Shopware\App\SDK\Context\Order\OrderTransaction::getPaymentMethod() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:618

ERRORS!
Tests: 38, Assertions: 254, Errors: 1.
