[Killed] PublicVisibility
Context/Order/StateMachineState.php:17:5
         return $this->data['id'];
     }
 
-    public function getTechnicalName(): string
+    protected function getTechnicalName() : string
     {
         \assert(\is_string($this->data['technicalName']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
Error: Call to protected method Shopware\App\SDK\Context\Order\StateMachineState::getTechnicalName() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:606

ERRORS!
Tests: 38, Assertions: 247, Errors: 1.
