[Killed] PublicVisibility
Context/SalesChannelContext/Address.php:20:5
         return $this->data['id'];
     }
 
-    public function getSalutation(): ?Salutation
+    protected function getSalutation() : ?Salutation
     {
         if (!isset($this->data['salutation'])) {
killedBy: Shopware\App\SDK\Tests\Context\SalesChannelContext\AddressTest::testEmptySalutation
statusReason: 1) Shopware\App\SDK\Tests\Context\SalesChannelContext\AddressTest::testEmptySalutation
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\Address::getSalutation() from scope Shopware\App\SDK\Tests\Context\SalesChannelContext\AddressTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/SalesChannelContext/AddressTest.php:20

2) Shopware\App\SDK\Tests\Context\Context

[Killed] LogicalNot
Context/SalesChannelContext/Address.php:22:9
 
     public function getSalutation(): ?Salutation
     {
-        if (!isset($this->data['salutation'])) {
+        if (isset($this->data['salutation'])) {
             return null;
         }
killedBy: Shopware\App\SDK\Tests\Context\SalesChannelContext\AddressTest::testEmptySalutation
statusReason: 1) Shopware\App\SDK\Tests\Context\SalesChannelContext\AddressTest::testEmptySalutation
assert(is_array($this->data['salutation']))

/home/lernhart/work/shopware/app-php-sdk/src/Context/SalesChannelContext/Address.php:21
/home/lernhart/work/shopware/app-php-sdk/tests/Context/SalesChannelContext/AddressTest.php:20

FAILURES!
Tests: 2, Assertions: 7, Failures: 1, Warnings: 1.

[Killed] PublicVisibility
Context/SalesChannelContext/Address.php:30:5
         return new Salutation($this->data['salutation']);
     }
 
-    public function getFirstName(): string
+    protected function getFirstName() : string
     {
         \assert(is_string($this->data['firstName']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\Address::getFirstName() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:411

2) Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
Err

[Killed] PublicVisibility
Context/SalesChannelContext/Address.php:36:5
         return $this->data['firstName'];
     }
 
-    public function getLastName(): string
+    protected function getLastName() : string
     {
         \assert(is_string($this->data['lastName']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\Address::getLastName() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:412

ERRORS!
Tests: 38, Assertions: 224, Errors: 1.

[Killed] PublicVisibility
Context/SalesChannelContext/Address.php:42:5
         return $this->data['lastName'];
     }
 
-    public function getStreet(): string
+    protected function getStreet() : string
     {
         \assert(is_string($this->data['street']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\Address::getStreet() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:402

ERRORS!
Tests: 38, Assertions: 216, Errors: 1.

[Killed] PublicVisibility
Context/SalesChannelContext/Address.php:48:5
         return $this->data['street'];
     }
 
-    public function getZipCode(): string
+    protected function getZipCode() : string
     {
         \assert(is_string($this->data['zipcode']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\Address::getZipCode() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:404

ERRORS!
Tests: 38, Assertions: 218, Errors: 1.

[Killed] PublicVisibility
Context/SalesChannelContext/Address.php:54:5
         return $this->data['zipcode'];
     }
 
-    public function getCity(): string
+    protected function getCity() : string
     {
         \assert(is_string($this->data['city']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\Address::getCity() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:403

ERRORS!
Tests: 38, Assertions: 217, Errors: 1.

[Killed] PublicVisibility
Context/SalesChannelContext/Address.php:60:5
         return $this->data['city'];
     }
 
-    public function getCompany(): ?string
+    protected function getCompany() : ?string
     {
         if (!isset($this->data['company'])) {
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\Address::getCompany() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:401

2) Shopware\App\SDK\Tests\Context\SalesChannelContext\AddressTest::testComp

[Killed] LogicalNot
Context/SalesChannelContext/Address.php:62:9
 
     public function getCompany(): ?string
     {
-        if (!isset($this->data['company'])) {
+        if (isset($this->data['company'])) {
             return null;
         }
killedBy: Shopware\App\SDK\Tests\Context\SalesChannelContext\AddressTest::testCompanyFilled
statusReason: 1) Shopware\App\SDK\Tests\Context\SalesChannelContext\AddressTest::testCompanyFilled
Failed asserting that null is identical to 'test'.

/home/lernhart/work/shopware/app-php-sdk/tests/Context/SalesChannelContext/AddressTest.php:36

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] PublicVisibility
Context/SalesChannelContext/Address.php:70:5
         return $this->data['company'];
     }
 
-    public function getDepartment(): ?string
+    protected function getDepartment() : ?string
     {
         if (!isset($this->data['department'])) {
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\Address::getDepartment() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:400

2) Shopware\App\SDK\Tests\Context\SalesChannelContext\AddressTest::testC

[Killed] LogicalNot
Context/SalesChannelContext/Address.php:72:9
 
     public function getDepartment(): ?string
     {
-        if (!isset($this->data['department'])) {
+        if (isset($this->data['department'])) {
             return null;
         }
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
assert(is_string($this->data['department']))

/home/lernhart/work/shopware/app-php-sdk/src/Context/SalesChannelContext/Address.php:62
/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:400

FAILURES!
Tests: 5, Assertions: 166, Failures: 1.

[Killed] PublicVisibility
Context/SalesChannelContext/Address.php:80:5
         return $this->data['department'];
     }
 
-    public function getTitle(): ?string
+    protected function getTitle() : ?string
     {
         if (!isset($this->data['title'])) {
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\Address::getTitle() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:409

2) Shopware\App\SDK\Tests\Context\SalesChannelContext\AddressTest::testCompan

[Killed] LogicalNot
Context/SalesChannelContext/Address.php:82:9
 
     public function getTitle(): ?string
     {
-        if (!isset($this->data['title'])) {
+        if (isset($this->data['title'])) {
             return null;
         }
killedBy: Shopware\App\SDK\Tests\Context\SalesChannelContext\AddressTest::testCompanyFilled
statusReason: 1) Shopware\App\SDK\Tests\Context\SalesChannelContext\AddressTest::testCompanyFilled
Failed asserting that null is identical to 'test'.

/home/lernhart/work/shopware/app-php-sdk/tests/Context/SalesChannelContext/AddressTest.php:38

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] PublicVisibility
Context/SalesChannelContext/Address.php:90:5
         return $this->data['title'];
     }
 
-    public function getCountry(): Country
+    protected function getCountry() : Country
     {
         \assert(is_array($this->data['country']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\Address::getCountry() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:414

ERRORS!
Tests: 38, Assertions: 226, Errors: 1.

[Killed] PublicVisibility
Context/SalesChannelContext/Address.php:96:5
         return new Country($this->data['country']);
     }
 
-    public function getCountryState(): ?CountryState
+    protected function getCountryState() : ?CountryState
     {
         if (!isset($this->data['countryState'])) {
killedBy: Shopware\App\SDK\Tests\Context\SalesChannelContext\AddressTest::testEmptySalutation
statusReason: 1) Shopware\App\SDK\Tests\Context\SalesChannelContext\AddressTest::testEmptySalutation
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\Address::getCountryState() from scope Shopware\App\SDK\Tests\Context\SalesChannelContext\AddressTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/SalesChannelContext/AddressTest.php:21

2) Shopware\App\SDK\Tests\Context\Conte

[Killed] LogicalNot
Context/SalesChannelContext/Address.php:98:9
 
     public function getCountryState(): ?CountryState
     {
-        if (!isset($this->data['countryState'])) {
+        if (isset($this->data['countryState'])) {
             return null;
         }
killedBy: Shopware\App\SDK\Tests\Context\SalesChannelContext\AddressTest::testEmptySalutation
statusReason: 1) Shopware\App\SDK\Tests\Context\SalesChannelContext\AddressTest::testEmptySalutation
assert(is_array($this->data['countryState']))

/home/lernhart/work/shopware/app-php-sdk/src/Context/SalesChannelContext/Address.php:83
/home/lernhart/work/shopware/app-php-sdk/tests/Context/SalesChannelContext/AddressTest.php:21

FAILURES!
Tests: 2, Assertions: 8, Failures: 1, Warnings: 1.

[Killed] PublicVisibility
Context/SalesChannelContext/Address.php:106:5
         return new CountryState($this->data['countryState']);
     }
 
-    public function getPhoneNumber(): ?string
+    protected function getPhoneNumber() : ?string
     {
         if (!isset($this->data['phoneNumber'])) {
killedBy: Shopware\App\SDK\Tests\Context\SalesChannelContext\AddressTest::testCompanyFilled
statusReason: 1) Shopware\App\SDK\Tests\Context\SalesChannelContext\AddressTest::testCompanyFilled
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\Address::getPhoneNumber() from scope Shopware\App\SDK\Tests\Context\SalesChannelContext\AddressTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/SalesChannelContext/AddressTest.php:39

2) Shopware\App\SDK\Tests\Context\ContextR

[Killed] LogicalNot
Context/SalesChannelContext/Address.php:108:9
 
     public function getPhoneNumber(): ?string
     {
-        if (!isset($this->data['phoneNumber'])) {
+        if (isset($this->data['phoneNumber'])) {
             return null;
         }
killedBy: Shopware\App\SDK\Tests\Context\SalesChannelContext\AddressTest::testCompanyFilled
statusReason: 1) Shopware\App\SDK\Tests\Context\SalesChannelContext\AddressTest::testCompanyFilled
Failed asserting that null is identical to 'test'.

/home/lernhart/work/shopware/app-php-sdk/tests/Context/SalesChannelContext/AddressTest.php:39

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Killed] PublicVisibility
Context/SalesChannelContext/Address.php:116:5
         return $this->data['phoneNumber'];
     }
 
-    public function getAdditionalAddressLine1(): ?string
+    protected function getAdditionalAddressLine1() : ?string
     {
         if (!isset($this->data['additionalAddressLine1'])) {
killedBy: Shopware\App\SDK\Tests\Context\SalesChannelContext\AddressTest::testCompanyFilled
statusReason: 1) Shopware\App\SDK\Tests\Context\SalesChannelContext\AddressTest::testCompanyFilled
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\Address::getAdditionalAddressLine1() from scope Shopware\App\SDK\Tests\Context\SalesChannelContext\AddressTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/SalesChannelContext/AddressTest.php:40

2) Shopware\App\SDK\Tests\Conte

[Killed] LogicalNot
Context/SalesChannelContext/Address.php:118:9
 
     public function getAdditionalAddressLine1(): ?string
     {
-        if (!isset($this->data['additionalAddressLine1'])) {
+        if (isset($this->data['additionalAddressLine1'])) {
             return null;
         }
killedBy: Shopware\App\SDK\Tests\Context\SalesChannelContext\AddressTest::testCompanyFilled
statusReason: 1) Shopware\App\SDK\Tests\Context\SalesChannelContext\AddressTest::testCompanyFilled
Failed asserting that null is identical to 'test'.

/home/lernhart/work/shopware/app-php-sdk/tests/Context/SalesChannelContext/AddressTest.php:40

FAILURES!
Tests: 2, Assertions: 8, Failures: 1.

[Killed] PublicVisibility
Context/SalesChannelContext/Address.php:126:5
         return $this->data['additionalAddressLine1'];
     }
 
-    public function getAdditionalAddressLine2(): ?string
+    protected function getAdditionalAddressLine2() : ?string
     {
         if (!isset($this->data['additionalAddressLine2'])) {
killedBy: Shopware\App\SDK\Tests\Context\SalesChannelContext\AddressTest::testCompanyFilled
statusReason: 1) Shopware\App\SDK\Tests\Context\SalesChannelContext\AddressTest::testCompanyFilled
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\Address::getAdditionalAddressLine2() from scope Shopware\App\SDK\Tests\Context\SalesChannelContext\AddressTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/SalesChannelContext/AddressTest.php:41

2) Shopware\App\SDK\Tests\Conte

[Killed] LogicalNot
Context/SalesChannelContext/Address.php:128:9
 
     public function getAdditionalAddressLine2(): ?string
     {
-        if (!isset($this->data['additionalAddressLine2'])) {
+        if (isset($this->data['additionalAddressLine2'])) {
             return null;
         }
killedBy: Shopware\App\SDK\Tests\Context\SalesChannelContext\AddressTest::testCompanyFilled
statusReason: 1) Shopware\App\SDK\Tests\Context\SalesChannelContext\AddressTest::testCompanyFilled
Failed asserting that null is identical to 'test'.

/home/lernhart/work/shopware/app-php-sdk/tests/Context/SalesChannelContext/AddressTest.php:41

FAILURES!
Tests: 2, Assertions: 9, Failures: 1.
