[Killed] PublicVisibility
Context/SalesChannelContext/Country.php:11:5
 
 class Country extends ArrayStruct
 {
-    public function getName(): string
+    protected function getName() : string
     {
         \assert(is_string($this->data['name']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\Country::getName() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:414

ERRORS!
Tests: 38, Assertions: 226, Errors: 1.

[Killed] PublicVisibility
Context/SalesChannelContext/Country.php:17:5
         return $this->data['name'];
     }
 
-    public function getIso(): string
+    protected function getIso() : string
     {
         \assert(is_string($this->data['iso']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\Country::getIso() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:323

ERRORS!
Tests: 38, Assertions: 155, Errors: 1.

[Killed] PublicVisibility
Context/SalesChannelContext/Country.php:23:5
         return $this->data['iso'];
     }
 
-    public function getIso3(): string
+    protected function getIso3() : string
     {
         \assert(is_string($this->data['iso3']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\Country::getIso3() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:416

ERRORS!
Tests: 38, Assertions: 228, Errors: 1.

[Killed] PublicVisibility
Context/SalesChannelContext/Country.php:29:5
         return $this->data['iso3'];
     }
 
-    public function getCustomerTax(): TaxInfo
+    protected function getCustomerTax() : TaxInfo
     {
         \assert(is_array($this->data['customerTax']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\Country::getCustomerTax() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:417

ERRORS!
Tests: 38, Assertions: 229, Errors: 1.

[Killed] PublicVisibility
Context/SalesChannelContext/Country.php:35:5
         return new TaxInfo($this->data['customerTax']);
     }
 
-    public function getCompanyTax(): TaxInfo
+    protected function getCompanyTax() : TaxInfo
     {
         \assert(is_array($this->data['companyTax']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\Country::getCompanyTax() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:420

ERRORS!
Tests: 38, Assertions: 232, Errors: 1.
