[Killed] PublicVisibility
Context/SalesChannelContext/CountryState.php:26:5
         return $this->data['name'];
     }
 
-    public function getShortCode(): string
+    protected function getShortCode() : string
     {
         \assert(is_string($this->data['shortCode']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\CountryState::getShortCode() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:425

ERRORS!
Tests: 38, Assertions: 237, Errors: 1.

[Killed] PublicVisibility
Context/SalesChannelContext/CountryState.php:32:5
         return $this->data['shortCode'];
     }
 
-    public function getPosition(): int
+    protected function getPosition() : int
     {
         \assert(is_int($this->data['position']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\CountryState::getPosition() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:424

ERRORS!
Tests: 38, Assertions: 236, Errors: 1.
