[Killed] PublicVisibility
Context/SalesChannelContext/Currency.php:20:5
         return $this->data['id'];
     }
 
-    public function getIsoCode(): string
+    protected function getIsoCode() : string
     {
         \assert(is_string($this->data['isoCode']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\Currency::getIsoCode() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:345

ERRORS!
Tests: 38, Assertions: 165, Errors: 1.

[Killed] PublicVisibility
Context/SalesChannelContext/Currency.php:26:5
         return $this->data['isoCode'];
     }
 
-    public function getFactor(): float
+    protected function getFactor() : float
     {
         \assert(is_float($this->data['factor']) || is_int($this->data['factor']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\Currency::getFactor() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:349

ERRORS!
Tests: 38, Assertions: 169, Errors: 1.

[Killed] LogicalOr
Context/SalesChannelContext/Currency.php:28:9
 
     public function getFactor(): float
     {
-        \assert(is_float($this->data['factor']) || is_int($this->data['factor']));
+        \assert(is_float($this->data['factor']) && is_int($this->data['factor']));
         return $this->data['factor'];
     }
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
assert(is_float($this->data['factor']) && is_int($this->data['factor']))

/home/lernhart/work/shopware/app-php-sdk/src/Context/SalesChannelContext/Currency.php:23
/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:349

FAILURES!
Tests: 5, Assertions: 121, Failures: 1.

[Killed] PublicVisibility
Context/SalesChannelContext/Currency.php:32:5
         return $this->data['factor'];
     }
 
-    public function getSymbol(): string
+    protected function getSymbol() : string
     {
         \assert(is_string($this->data['symbol']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\Currency::getSymbol() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:347

ERRORS!
Tests: 38, Assertions: 167, Errors: 1.

[Killed] PublicVisibility
Context/SalesChannelContext/Currency.php:38:5
         return $this->data['symbol'];
     }
 
-    public function getShortName(): string
+    protected function getShortName() : string
     {
         \assert(is_string($this->data['shortName']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\Currency::getShortName() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:572

2) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Er

[Killed] PublicVisibility
Context/SalesChannelContext/Currency.php:62:5
         return new RoundingConfig($this->data['totalRounding']);
     }
 
-    public function getTaxFreeFrom(): float
+    protected function getTaxFreeFrom() : float
     {
         \assert(is_float($this->data['taxFreeFrom']) || is_int($this->data['taxFreeFrom']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\SalesChannelContext\CurrencyTest::testGetNonNumberTaxFreeFrom
Failed asserting that exception of type "Error" matches expected exception "AssertionError". Message was: "Call to protected method Shopware\App\SDK\Context\SalesChannelContext\Currency::getTaxFreeFrom() from scope Shopware\App\SDK\Tests\Context\SalesChannelContext\CurrencyTest" at
/home/lernhart/work/s

[Killed] LogicalOr
Context/SalesChannelContext/Currency.php:64:9
 
     public function getTaxFreeFrom(): float
     {
-        \assert(is_float($this->data['taxFreeFrom']) || is_int($this->data['taxFreeFrom']));
+        \assert(is_float($this->data['taxFreeFrom']) && is_int($this->data['taxFreeFrom']));
         return $this->data['taxFreeFrom'];
     }
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
assert(is_float($this->data['taxFreeFrom']) && is_int($this->data['taxFreeFrom']))

/home/lernhart/work/shopware/app-php-sdk/src/Context/SalesChannelContext/Currency.php:53
/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:348

FAILURES!
Tests: 5, Assertions: 120, Failures: 1.
