[Killed] LogicalOr
Context/SalesChannelContext/Customer.php:34:9
 
     public function getCompany(): ?string
     {
-        \assert(is_string($this->data['company']) || is_null($this->data['company']));
+        \assert(is_string($this->data['company']) && is_null($this->data['company']));
         return $this->data['company'];
     }
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
assert(is_string($this->data['company']) && is_null($this->data['company']))

/home/lernhart/work/shopware/app-php-sdk/src/Context/SalesChannelContext/Customer.php:28
/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:378

FAILURES!
Tests: 5, Assertions: 144, Failures: 1.

[Killed] PublicVisibility
Context/SalesChannelContext/Customer.php:38:5
         return $this->data['company'];
     }
 
-    public function getCustomerNumber(): string
+    protected function getCustomerNumber() : string
     {
         \assert(is_string($this->data['customerNumber']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\Customer::getCustomerNumber() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:390

ERRORS!
Tests: 38, Assertions: 204, Errors: 1.

[Killed] LogicalOr
Context/SalesChannelContext/Customer.php:46:9
 
     public function getTitle(): ?string
     {
-        \assert(is_string($this->data['title']) || is_null($this->data['title']));
+        \assert(is_string($this->data['title']) && is_null($this->data['title']));
         return $this->data['title'];
     }
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
assert(is_string($this->data['title']) && is_null($this->data['title']))

/home/lernhart/work/shopware/app-php-sdk/src/Context/SalesChannelContext/Customer.php:38
/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:389

FAILURES!
Tests: 5, Assertions: 155, Failures: 1.

[Killed] PublicVisibility
Context/SalesChannelContext/Customer.php:50:5
         return $this->data['title'];
     }
 
-    public function isActive(): bool
+    protected function isActive() : bool
     {
         \assert(is_bool($this->data['active']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\Customer::isActive() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:391

ERRORS!
Tests: 38, Assertions: 205, Errors: 1.

[Killed] PublicVisibility
Context/SalesChannelContext/Customer.php:56:5
         return $this->data['active'];
     }
 
-    public function isGuest(): bool
+    protected function isGuest() : bool
     {
         \assert(is_bool($this->data['guest']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\Customer::isGuest() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:380

ERRORS!
Tests: 38, Assertions: 194, Errors: 1.

[Killed] PublicVisibility
Context/SalesChannelContext/Customer.php:62:5
         return $this->data['guest'];
     }
 
-    public function getAccountType(): string
+    protected function getAccountType() : string
     {
         \assert(is_string($this->data['accountType']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\Customer::getAccountType() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:379

ERRORS!
Tests: 38, Assertions: 193, Errors: 1.

[Killed] PublicVisibility
Context/SalesChannelContext/Customer.php:71:5
     /**
      * @return array<string>
      */
-    public function getVatIds(): array
+    protected function getVatIds() : array
     {
         \assert(is_array($this->data['vatIds']) || is_null($this->data['vatIds']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\Customer::getVatIds() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:381

2) Shopware\App\SDK\Tests\Context\SalesChannelContext\CustomerTest::testGet

[Killed] LogicalOr
Context/SalesChannelContext/Customer.php:73:9
      */
     public function getVatIds(): array
     {
-        \assert(is_array($this->data['vatIds']) || is_null($this->data['vatIds']));
+        \assert(is_array($this->data['vatIds']) && is_null($this->data['vatIds']));
         return $this->data['vatIds'] ?? [];
     }
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
assert(is_array($this->data['vatIds']) && is_null($this->data['vatIds']))

/home/lernhart/work/shopware/app-php-sdk/src/Context/SalesChannelContext/Customer.php:61
/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:381

FAILURES!
Tests: 5, Assertions: 147, Failures: 1.

[Killed] Coalesce
Context/SalesChannelContext/Customer.php:74:9
     public function getVatIds(): array
     {
         \assert(is_array($this->data['vatIds']) || is_null($this->data['vatIds']));
-        return $this->data['vatIds'] ?? [];
+        return [] ?? $this->data['vatIds'];
     }
 
killedBy: Shopware\App\SDK\Tests\Context\SalesChannelContext\CustomerTest::testGetVatIds
statusReason: 1) Shopware\App\SDK\Tests\Context\SalesChannelContext\CustomerTest::testGetVatIds
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
-Array &0 (
-    0 => 'foo'
-    1 => 'bar'

[Killed] PublicVisibility
Context/SalesChannelContext/Customer.php:77:5
         return $this->data['vatIds'] ?? [];
     }
 
-    public function getRemoteAddress(): string
+    protected function getRemoteAddress() : string
     {
         \assert(is_string($this->data['remoteAddress']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\Customer::getRemoteAddress() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:382

ERRORS!
Tests: 38, Assertions: 196, Errors: 1.

[Killed] LogicalOr
Context/SalesChannelContext/Customer.php:85:9
 
     public function getSalutation(): ?Salutation
     {
-        \assert(is_array($this->data['salutation']) || is_null($this->data['salutation']));
+        \assert(is_array($this->data['salutation']) && is_null($this->data['salutation']));
 
         if ($this->data['salutation'] === null) {
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
assert(is_array($this->data['salutation']) && is_null($this->data['salutation']))

/home/lernhart/work/shopware/app-php-sdk/src/Context/SalesChannelContext/Customer.php:71
/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:385

FAILURES!
Tests: 5, Assertions: 151, Failures: 1.

[Killed] Identical
Context/SalesChannelContext/Customer.php:87:9
     {
         \assert(is_array($this->data['salutation']) || is_null($this->data['salutation']));
 
-        if ($this->data['salutation'] === null) {
+        if ($this->data['salutation'] !== null) {
             return null;
         }
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to a member function getId() on null

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:385

2) Shopware\App\SDK\Tests\Context\SalesChannelContext\CustomerTest::testEmptySalutation
TypeError: Shopware\App\SDK\Context\ArrayStruct::__construct(): Argument #1 ($data) must be of type

[Killed] PublicVisibility
Context/SalesChannelContext/Customer.php:94:5
         return new Salutation($this->data['salutation']);
     }
 
-    public function getDefaultPaymentMethod(): PaymentMethod
+    protected function getDefaultPaymentMethod() : PaymentMethod
     {
         \assert(is_array($this->data['defaultPaymentMethod']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\Customer::getDefaultPaymentMethod() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:392

ERRORS!
Tests: 38, Assertions: 206, Errors: 1.

[Killed] PublicVisibility
Context/SalesChannelContext/Customer.php:100:5
         return new PaymentMethod($this->data['defaultPaymentMethod']);
     }
 
-    public function getDefaultBillingAddress(): Address
+    protected function getDefaultBillingAddress() : Address
     {
         \assert(is_array($this->data['defaultBillingAddress']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\Customer::getDefaultBillingAddress() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:393

ERRORS!
Tests: 38, Assertions: 207, Errors: 1.

[Killed] PublicVisibility
Context/SalesChannelContext/Customer.php:106:5
         return new Address($this->data['defaultBillingAddress']);
     }
 
-    public function getDefaultShippingAddress(): Address
+    protected function getDefaultShippingAddress() : Address
     {
         \assert(is_array($this->data['defaultShippingAddress']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\Customer::getDefaultShippingAddress() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:394

ERRORS!
Tests: 38, Assertions: 208, Errors: 1.

[Killed] PublicVisibility
Context/SalesChannelContext/Customer.php:112:5
         return new Address($this->data['defaultShippingAddress']);
     }
 
-    public function getActiveBillingAddress(): Address
+    protected function getActiveBillingAddress() : Address
     {
         \assert(is_array($this->data['activeBillingAddress']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\Customer::getActiveBillingAddress() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:395

ERRORS!
Tests: 38, Assertions: 209, Errors: 1.

[Killed] PublicVisibility
Context/SalesChannelContext/Customer.php:118:5
         return new Address($this->data['activeBillingAddress']);
     }
 
-    public function getActiveShippingAddress(): Address
+    protected function getActiveShippingAddress() : Address
     {
         \assert(is_array($this->data['activeShippingAddress']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\Customer::getActiveShippingAddress() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:396

ERRORS!
Tests: 38, Assertions: 210, Errors: 1.
