[Killed] PublicVisibility
Context/SalesChannelContext/PaymentMethod.php:23:5
         return $this->data['name'];
     }
 
-    public function getDescription(): string
+    protected function getDescription() : string
     {
         \assert(is_string($this->data['description']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\PaymentMethod::getDescription() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:360

ERRORS!
Tests: 38, Assertions: 178, Errors: 1.

[Killed] PublicVisibility
Context/SalesChannelContext/PaymentMethod.php:35:5
         return $this->data['active'];
     }
 
-    public function isAfterOrderEnabled(): bool
+    protected function isAfterOrderEnabled() : bool
     {
         \assert(is_bool($this->data['afterOrderEnabled']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\PaymentMethod::isAfterOrderEnabled() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:366

ERRORS!
Tests: 38, Assertions: 184, Errors: 1.

[Killed] PublicVisibility
Context/SalesChannelContext/PaymentMethod.php:41:5
         return $this->data['afterOrderEnabled'];
     }
 
-    public function getAvailabilityRuleId(): ?string
+    protected function getAvailabilityRuleId() : ?string
     {
         \assert(is_string($this->data['availabilityRuleId']) || is_null($this->data['availabilityRuleId']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\PaymentMethod::getAvailabilityRuleId() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:361

ERRORS!
Tests: 38, Assertions: 179, Errors: 1.

[Killed] LogicalOr
Context/SalesChannelContext/PaymentMethod.php:43:9
 
     public function getAvailabilityRuleId(): ?string
     {
-        \assert(is_string($this->data['availabilityRuleId']) || is_null($this->data['availabilityRuleId']));
+        \assert(is_string($this->data['availabilityRuleId']) && is_null($this->data['availabilityRuleId']));
         return $this->data['availabilityRuleId'];
     }
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
assert(is_string($this->data['availabilityRuleId']) && is_null($this->data['availabilityRuleId']))

/home/lernhart/work/shopware/app-php-sdk/src/Context/SalesChannelContext/PaymentMethod.php:36
/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:361

FAILURES!
Tests: 5, Assertions: 131, Failur

[Killed] PublicVisibility
Context/SalesChannelContext/PaymentMethod.php:47:5
         return $this->data['availabilityRuleId'];
     }
 
-    public function isSynchronous(): bool
+    protected function isSynchronous() : bool
     {
         \assert(is_bool($this->data['synchronous']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\PaymentMethod::isSynchronous() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:363

ERRORS!
Tests: 38, Assertions: 181, Errors: 1.

[Killed] PublicVisibility
Context/SalesChannelContext/PaymentMethod.php:53:5
         return $this->data['synchronous'];
     }
 
-    public function isAsynchronous(): bool
+    protected function isAsynchronous() : bool
     {
         \assert(is_bool($this->data['asynchronous']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\PaymentMethod::isAsynchronous() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:364

ERRORS!
Tests: 38, Assertions: 182, Errors: 1.

[Killed] PublicVisibility
Context/SalesChannelContext/PaymentMethod.php:59:5
         return $this->data['asynchronous'];
     }
 
-    public function isPrepared(): bool
+    protected function isPrepared() : bool
     {
         \assert(is_bool($this->data['prepared']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\PaymentMethod::isPrepared() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:365

ERRORS!
Tests: 38, Assertions: 183, Errors: 1.

[Killed] PublicVisibility
Context/SalesChannelContext/PaymentMethod.php:65:5
         return $this->data['prepared'];
     }
 
-    public function isRefundable(): bool
+    protected function isRefundable() : bool
     {
         \assert(is_bool($this->data['refundable']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\PaymentMethod::isRefundable() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:367

ERRORS!
Tests: 38, Assertions: 185, Errors: 1.
