[Killed] PublicVisibility
Context/SalesChannelContext/RoundingConfig.php:14:5
     /**
      * How many decimals should be used for rounding
      */
-    public function getDecimals(): int
+    protected function getDecimals() : int
     {
         \assert(is_int($this->data['decimals']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\RoundingConfig::getDecimals() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:351

2) Shopware\App\SDK\Tests\Context\SalesChannelContext\SalesChannelC

[Killed] PublicVisibility
Context/SalesChannelContext/RoundingConfig.php:24:5
     /**
      * In which interval should be rounded
      */
-    public function getInterval(): float
+    protected function getInterval() : float
     {
         \assert(is_float($this->data['interval']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\RoundingConfig::getInterval() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:352

ERRORS!
Tests: 38, Assertions: 172, Errors: 1.

[Killed] PublicVisibility
Context/SalesChannelContext/RoundingConfig.php:30:5
         return $this->data['interval'];
     }
 
-    public function isRoundForNet(): bool
+    protected function isRoundForNet() : bool
     {
         \assert(is_bool($this->data['roundForNet']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testResolvePay
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\RoundingConfig::isRoundForNet() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:587

2) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProv
