[Killed] PublicVisibility
Context/SalesChannelContext/SalesChannel.php:23:5
         return $this->data['name'];
     }
 
-    public function getAccessKey(): string
+    protected function getAccessKey() : string
     {
         \assert(is_string($this->data['accessKey']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\SalesChannel::getAccessKey() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:430

ERRORS!
Tests: 38, Assertions: 240, Errors: 1.

[Killed] PublicVisibility
Context/SalesChannelContext/SalesChannel.php:29:5
         return $this->data['accessKey'];
     }
 
-    public function getTaxCalculationType(): string
+    protected function getTaxCalculationType() : string
     {
         \assert(is_string($this->data['taxCalculationType']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\SalesChannel::getTaxCalculationType() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:431

ERRORS!
Tests: 38, Assertions: 241, Errors: 1.

[Killed] PublicVisibility
Context/SalesChannelContext/SalesChannel.php:44:5
     /**
      * @return array<SalesChannelDomain>
      */
-    public function getDomains(): array
+    protected function getDomains() : array
     {
         \assert(is_array($this->data['domains']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\SalesChannel::getDomains() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:434

ERRORS!
Tests: 38, Assertions: 243, Errors: 1.
