[Killed] PublicVisibility
Context/SalesChannelContext/SalesChannelContext.php:14:5
     /**
      * Current sales channel context token
      */
-    public function getToken(): string
+    protected function getToken() : string
     {
         \assert(is_string($this->data['token']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\SalesChannelContext::getToken() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:338

ERRORS!
Tests: 38, Assertions: 161, Errors: 1.

[Killed] PublicVisibility
Context/SalesChannelContext/SalesChannelContext.php:20:5
         return $this->data['token'];
     }
 
-    public function getCurrencyId(): string
+    protected function getCurrencyId() : string
     {
         \assert(is_array($this->data['context']) && is_string($this->data['context']['currencyId']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\SalesChannelContext\SalesChannelContextTest::testNonArrayContext
/home/lernhart/work/shopware/app-php-sdk/tests/Context/SalesChannelContext/SalesChannelContextTest.php:24
.

ERRORS!
Tests: 39, Assertions: 163, Errors: 1, Failures: 1.

[Killed] LogicalAnd
Context/SalesChannelContext/SalesChannelContext.php:22:9
 
     public function getCurrencyId(): string
     {
-        \assert(is_array($this->data['context']) && is_string($this->data['context']['currencyId']));
+        \assert(is_array($this->data['context']) || is_string($this->data['context']['currencyId']));
         return $this->data['context']['currencyId'];
     }
killedBy: Shopware\App\SDK\Tests\Context\SalesChannelContext\SalesChannelContextTest::testNonArrayContext
statusReason: 1) Shopware\App\SDK\Tests\Context\SalesChannelContext\SalesChannelContextTest::testNonArrayContext
Failed asserting that exception of type "TypeError" matches expected exception "AssertionError". Message was: "Cannot access offset of type string on string" at
/home/lernhart/work/shopware/app-php-sdk/src/Context/SalesChannelContext/SalesChannelContext.php:19
/home/lernhart/work/shopware/app-php-sdk

[Killed] PublicVisibility
Context/SalesChannelContext/SalesChannelContext.php:29:5
     /**
      * @return string
      */
-    public function getTaxState(): string
+    protected function getTaxState() : string
     {
         \assert(is_array($this->data['context']) && is_string($this->data['context']['taxState']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\SalesChannelContext::getTaxState() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:337

2) Shopware\App\SDK\Tests\Context\SalesChannelContext\SalesCha

[Killed] LogicalAnd
Context/SalesChannelContext/SalesChannelContext.php:31:9
      */
     public function getTaxState(): string
     {
-        \assert(is_array($this->data['context']) && is_string($this->data['context']['taxState']));
+        \assert(is_array($this->data['context']) || is_string($this->data['context']['taxState']));
         return $this->data['context']['taxState'];
     }
killedBy: Shopware\App\SDK\Tests\Context\SalesChannelContext\SalesChannelContextTest::testGetTaxState
statusReason: 1) Shopware\App\SDK\Tests\Context\SalesChannelContext\SalesChannelContextTest::testGetTaxState
Failed asserting that exception of type "TypeError" matches expected exception "AssertionError". Message was: "Shopware\App\SDK\Context\SalesChannelContext\SalesChannelContext::getTaxState(): Return value must be of type string, null returned" at
/home/lernhart/work/shopware/app-php-sdk/src/Context/Sales

[Killed] PublicVisibility
Context/SalesChannelContext/SalesChannelContext.php:35:5
         return $this->data['context']['taxState'];
     }
 
-    public function getRounding(): RoundingConfig
+    protected function getRounding() : RoundingConfig
     {
         \assert(is_array($this->data['context']) && is_array($this->data['context']['rounding']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\SalesChannelContext::getRounding() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:443

2) Shopware\App\SDK\Tests\Context\SalesChannelContext\SalesCha

[Killed] LogicalAnd
Context/SalesChannelContext/SalesChannelContext.php:37:9
 
     public function getRounding(): RoundingConfig
     {
-        \assert(is_array($this->data['context']) && is_array($this->data['context']['rounding']));
+        \assert(is_array($this->data['context']) || is_array($this->data['context']['rounding']));
         return new RoundingConfig($this->data['context']['rounding']);
     }
killedBy: Shopware\App\SDK\Tests\Context\SalesChannelContext\SalesChannelContextTest::testGetRounding
statusReason: 1) Shopware\App\SDK\Tests\Context\SalesChannelContext\SalesChannelContextTest::testGetRounding
/home/lernhart/work/shopware/app-php-sdk/src/Context/ArrayStruct.php:12
/home/lernhart/work/shopware/app-php-sdk/src/Context/SalesChannelContext/SalesChannelContext.php:33
/home/lernhart/work/shopware/app-php-sdk/tests/Context/SalesChannelContext/SalesChannelContextTest.php:60
.

FAILURES!

[Killed] PublicVisibility
Context/SalesChannelContext/SalesChannelContext.php:59:5
         return new PaymentMethod($this->data['paymentMethod']);
     }
 
-    public function getSalesChannel(): SalesChannel
+    protected function getSalesChannel() : SalesChannel
     {
         \assert(is_array($this->data['salesChannel']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\SalesChannelContext::getSalesChannel() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:427

ERRORS!
Tests: 38, Assertions: 238, Errors: 1.

[Killed] PublicVisibility
Context/SalesChannelContext/SalesChannelContext.php:65:5
         return new SalesChannel($this->data['salesChannel']);
     }
 
-    public function getCustomer(): ?Customer
+    protected function getCustomer() : ?Customer
     {
         \assert(is_array($this->data['customer']) || is_null($this->data['customer']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\SalesChannelContext::getCustomer() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:374

2) Shopware\App\SDK\Tests\Context\SalesChannelContext\SalesCha

[Killed] LogicalOr
Context/SalesChannelContext/SalesChannelContext.php:67:9
 
     public function getCustomer(): ?Customer
     {
-        \assert(is_array($this->data['customer']) || is_null($this->data['customer']));
+        \assert(is_array($this->data['customer']) && is_null($this->data['customer']));
 
         if (is_null($this->data['customer'])) {
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
assert(is_array($this->data['customer']) && is_null($this->data['customer']))

/home/lernhart/work/shopware/app-php-sdk/src/Context/SalesChannelContext/SalesChannelContext.php:57
/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:374

FAILURES!
Tests: 5, Assertions: 141, Failures: 1.
