[Killed] PublicVisibility
Context/SalesChannelContext/SalesChannelDomain.php:20:5
         return $this->data['id'];
     }
 
-    public function getUrl(): string
+    protected function getUrl() : string
     {
         \assert(is_string($this->data['url']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\SalesChannelDomain::getUrl() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:437

ERRORS!
Tests: 38, Assertions: 245, Errors: 1.

[Killed] PublicVisibility
Context/SalesChannelContext/SalesChannelDomain.php:26:5
         return $this->data['url'];
     }
 
-    public function getLanguageId(): string
+    protected function getLanguageId() : string
     {
         \assert(is_string($this->data['languageId']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\SalesChannelDomain::getLanguageId() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:440

ERRORS!
Tests: 38, Assertions: 248, Errors: 1.

[Killed] PublicVisibility
Context/SalesChannelContext/SalesChannelDomain.php:38:5
         return $this->data['currencyId'];
     }
 
-    public function getSnippetSetId(): string
+    protected function getSnippetSetId() : string
     {
         \assert(is_string($this->data['snippetSetId']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\SalesChannelDomain::getSnippetSetId() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:441

ERRORS!
Tests: 38, Assertions: 249, Errors: 1.
