[Killed] PublicVisibility
Context/SalesChannelContext/Salutation.php:17:5
         return $this->data['id'];
     }
 
-    public function getDisplayName(): string
+    protected function getDisplayName() : string
     {
         \assert(is_string($this->data['displayName']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\Salutation::getDisplayName() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:387

ERRORS!
Tests: 38, Assertions: 201, Errors: 1.

[Killed] PublicVisibility
Context/SalesChannelContext/Salutation.php:23:5
         return $this->data['displayName'];
     }
 
-    public function getLetterName(): string
+    protected function getLetterName() : string
     {
         \assert(is_string($this->data['letterName']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\Salutation::getLetterName() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:388

ERRORS!
Tests: 38, Assertions: 202, Errors: 1.

[Killed] PublicVisibility
Context/SalesChannelContext/Salutation.php:29:5
         return $this->data['letterName'];
     }
 
-    public function getSalutationKey(): string
+    protected function getSalutationKey() : string
     {
         \assert(is_string($this->data['salutationKey']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\Salutation::getSalutationKey() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:386

ERRORS!
Tests: 38, Assertions: 200, Errors: 1.
