[Killed] PublicVisibility
Context/SalesChannelContext/ShippingLocation.php:11:5
 
 class ShippingLocation extends ArrayStruct
 {
-    public function getCountry(): Country
+    protected function getCountry() : Country
     {
         \assert(is_array($this->data['country']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\ShippingLocation::getCountry() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:323

ERRORS!
Tests: 38, Assertions: 155, Errors: 1.

[Killed] NewObject
Context/SalesChannelContext/ShippingLocation.php:24:9
         }
 
         \assert(is_array($this->data['countryState']));
-        return new CountryState($this->data['countryState']);
+        new CountryState($this->data['countryState']);
+        return null;
     }
 
killedBy: Shopware\App\SDK\Tests\Context\SalesChannelContext\ShippingLocationTest::testFilledState
statusReason: 1) Shopware\App\SDK\Tests\Context\SalesChannelContext\ShippingLocationTest::testFilledState
Failed asserting that null is not null.

/home/lernhart/work/shopware/app-php-sdk/tests/Context/SalesChannelContext/ShippingLocationTest.php:25

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] PublicVisibility
Context/SalesChannelContext/ShippingLocation.php:27:5
         return new CountryState($this->data['countryState']);
     }
 
-    public function getAddress(): Address
+    protected function getAddress() : Address
     {
         \assert(is_array($this->data['address']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\ShippingLocation::getAddress() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:448

ERRORS!
Tests: 38, Assertions: 253, Errors: 1.
