[Killed] PublicVisibility
Context/SalesChannelContext/ShippingMethod.php:23:5
         return $this->data['name'];
     }
 
-    public function getTaxType(): string
+    protected function getTaxType() : string
     {
         \assert(is_string($this->data['taxType']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\ShippingMethod::getTaxType() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:372

ERRORS!
Tests: 38, Assertions: 188, Errors: 1.
