[Killed] PublicVisibility
Context/SalesChannelContext/TaxInfo.php:11:5
 
 class TaxInfo extends ArrayStruct
 {
-    public function isEnabled(): bool
+    protected function isEnabled() : bool
     {
         \assert(is_bool($this->data['enabled']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\TaxInfo::isEnabled() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:419

ERRORS!
Tests: 38, Assertions: 231, Errors: 1.

[Killed] PublicVisibility
Context/SalesChannelContext/TaxInfo.php:23:5
         return $this->data['currencyId'];
     }
 
-    public function getAmount(): float
+    protected function getAmount() : float
     {
         \assert(is_float($this->data['amount']) || is_int($this->data['amount']));
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\TaxInfo::getAmount() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:418

ERRORS!
Tests: 38, Assertions: 230, Errors: 1.

[Killed] LogicalOr
Context/SalesChannelContext/TaxInfo.php:25:9
 
     public function getAmount(): float
     {
-        \assert(is_float($this->data['amount']) || is_int($this->data['amount']));
+        \assert(is_float($this->data['amount']) && is_int($this->data['amount']));
         return $this->data['amount'];
     }
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
assert(is_float($this->data['amount']) && is_int($this->data['amount']))

/home/lernhart/work/shopware/app-php-sdk/src/Context/SalesChannelContext/TaxInfo.php:21
/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:418

FAILURES!
Tests: 5, Assertions: 182, Failures: 1.
