[Killed] PublicVisibility
Context/Trait/CustomFieldsAware.php:12:5
     /**
      * @return array<mixed>
      */
-    public function getCustomFields(): array
+    protected function getCustomFields() : array
     {
         \assert(is_array($this->data['customFields']) || $this->data['customFields'] === null);
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
Error: Call to protected method Shopware\App\SDK\Context\SalesChannelContext\Customer::getCustomFields() from scope Shopware\App\SDK\Tests\Context\ContextResolverTest

/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:377

2) Shopware\App\SDK\Tests\Context\Trait\CustomFieldsAwareTraitTest::t

[Killed] LogicalOr
Context/Trait/CustomFieldsAware.php:14:9
      */
     public function getCustomFields(): array
     {
-        \assert(is_array($this->data['customFields']) || $this->data['customFields'] === null);
+        \assert(is_array($this->data['customFields']) && $this->data['customFields'] === null);
         return $this->data['customFields'] ?? [];
     }
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
assert(is_array($this->data['customFields']) && $this->data['customFields'] === null)

/home/lernhart/work/shopware/app-php-sdk/src/Context/Trait/CustomFieldsAware.php:13
/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:377

FAILURES!
Tests: 6, Assertions: 144, Failures: 1.

[Killed] Identical
Context/Trait/CustomFieldsAware.php:14:9
      */
     public function getCustomFields(): array
     {
-        \assert(is_array($this->data['customFields']) || $this->data['customFields'] === null);
+        \assert(is_array($this->data['customFields']) || $this->data['customFields'] !== null);
         return $this->data['customFields'] ?? [];
     }
killedBy: Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
statusReason: 1) Shopware\App\SDK\Tests\Context\ContextResolverTest::testAssembleTaxProvider
assert(is_array($this->data['customFields']) || $this->data['customFields'] !== null)

/home/lernhart/work/shopware/app-php-sdk/src/Context/Trait/CustomFieldsAware.php:13
/home/lernhart/work/shopware/app-php-sdk/tests/Context/ContextResolverTest.php:377

FAILURES!
Tests: 5, Assertions: 143, Failures: 1.

[Killed] Coalesce
Context/Trait/CustomFieldsAware.php:15:9
     public function getCustomFields(): array
     {
         \assert(is_array($this->data['customFields']) || $this->data['customFields'] === null);
-        return $this->data['customFields'] ?? [];
+        return [] ?? $this->data['customFields'];
     }
 }
killedBy: Shopware\App\SDK\Tests\Context\Trait\CustomFieldsAwareTraitTest::testGetCustomFields
statusReason: 1) Shopware\App\SDK\Tests\Context\Trait\CustomFieldsAwareTraitTest::testGetCustomFields
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
-Array &0 (
-    'foo' => 'bar'
-    'bar' => 'foo'
