[Killed] PublicVisibility
Event/AbstractAppLifecycleEvent.php:16:5
     {
     }
 
-    public function getRequest(): RequestInterface
+    protected function getRequest() : RequestInterface
     {
         return $this->request;
killedBy: Shopware\App\SDK\Tests\Events\RegistrationBeforeCompletedEventTest::testEvent
statusReason: 1) Shopware\App\SDK\Tests\Events\RegistrationBeforeCompletedEventTest::testEvent
Error: Call to protected method Shopware\App\SDK\Event\AbstractAppLifecycleEvent::getRequest() from scope Shopware\App\SDK\Tests\Events\RegistrationBeforeCompletedEventTest

/home/lernhart/work/shopware/app-php-sdk/tests/Events/RegistrationBeforeCompletedEventTest.php:29

2) Shopware\App\SDK\Tests\Events\RegistrationC

[Killed] PublicVisibility
Event/AbstractAppLifecycleEvent.php:21:5
         return $this->request;
     }
 
-    public function getShop(): ShopInterface
+    protected function getShop() : ShopInterface
     {
         return $this->shop;
killedBy: Shopware\App\SDK\Tests\Events\RegistrationCompletedEventTest::testEvent
statusReason: 1) Shopware\App\SDK\Tests\Events\RegistrationCompletedEventTest::testEvent
Error: Call to protected method Shopware\App\SDK\Event\AbstractAppLifecycleEvent::getShop() from scope Shopware\App\SDK\Tests\Events\RegistrationCompletedEventTest

/home/lernhart/work/shopware/app-php-sdk/tests/Events/RegistrationCompletedEventTest.php:26

2) Shopware\App\SDK\Tests\Events\RegistrationBeforeCompletedEventTe
