[Killed] MethodCallRemoval
Event/RegistrationBeforeCompletedEvent.php:20:9
      */
     public function __construct(ShopInterface $shop, RequestInterface $request, private readonly array $confirmation)
     {
-        parent::__construct($request, $shop);
+        
     }
 
killedBy: Shopware\App\SDK\Tests\Events\RegistrationBeforeCompletedEventTest::testEvent
statusReason: 1) Shopware\App\SDK\Tests\Events\RegistrationBeforeCompletedEventTest::testEvent
Error: Typed property Shopware\App\SDK\Event\AbstractAppLifecycleEvent::$shop must not be accessed before initialization

/home/lernhart/work/shopware/app-php-sdk/src/Event/AbstractAppLifecycleEvent.php:23
/home/lernhart/work/shopware/app-php-sdk/tests/Events/RegistrationBeforeCompletedEventTest.php:27

--

[Killed] PublicVisibility
Event/RegistrationBeforeCompletedEvent.php:26:5
     /**
      * @return array{apiKey: string, secretKey: string}
      */
-    public function getConfirmation(): array
+    protected function getConfirmation() : array
     {
         return $this->confirmation;
killedBy: Shopware\App\SDK\Tests\Events\RegistrationBeforeCompletedEventTest::testEvent
statusReason: 1) Shopware\App\SDK\Tests\Events\RegistrationBeforeCompletedEventTest::testEvent
Error: Call to protected method Shopware\App\SDK\Event\RegistrationBeforeCompletedEvent::getConfirmation() from scope Shopware\App\SDK\Tests\Events\RegistrationBeforeCompletedEventTest

/home/lernhart/work/shopware/app-php-sdk/tests/Events/RegistrationBeforeCompletedEventTest.php:32

ERRORS!
Tests: 1, Assertions: 4, E
