[Killed] MethodCallRemoval
Exception/MalformedWebhookBodyException.php:11:9
 {
     public function __construct()
     {
-        parent::__construct('Malformed webhook body, cannot parse body');
+        
     }
 }
killedBy: Shopware\App\SDK\Tests\Exception\MalformedWebhookBodyExceptionTest::testConstruct
statusReason: 1) Shopware\App\SDK\Tests\Exception\MalformedWebhookBodyExceptionTest::testConstruct
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'Malformed webhook body, cannot parse body'
+''
