[Killed] MethodCallRemoval
Exception/MissingShopParameterException.php:11:9
 {
     public function __construct()
     {
-        parent::__construct('Missing shop parameters');
+        
     }
 }
killedBy: Shopware\App\SDK\Tests\Exception\MissingShopParameterExceptionTest::testConstruct
statusReason: 1) Shopware\App\SDK\Tests\Exception\MissingShopParameterExceptionTest::testConstruct
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'Missing shop parameters'
+''
