[Killed] MethodCallRemoval
Exception/ShopNotFoundException.php:11:9
 {
     public function __construct(string $shopId, ?\Throwable $previous = null)
     {
-        parent::__construct(sprintf('Shop with id "%s" not found', $shopId), 0, $previous);
+        
     }
 }
killedBy: Shopware\App\SDK\Tests\Exception\ShopNotFoundExceptionTest::testException
statusReason: 1) Shopware\App\SDK\Tests\Exception\ShopNotFoundExceptionTest::testException
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'Shop with id "foo" not found'
+''

[Killed] IncrementInteger
Exception/ShopNotFoundException.php:11:9
 {
     public function __construct(string $shopId, ?\Throwable $previous = null)
     {
-        parent::__construct(sprintf('Shop with id "%s" not found', $shopId), 0, $previous);
+        parent::__construct(sprintf('Shop with id "%s" not found', $shopId), 1, $previous);
     }
 }
killedBy: Shopware\App\SDK\Tests\Exception\ShopNotFoundExceptionTest::testException
statusReason: 1) Shopware\App\SDK\Tests\Exception\ShopNotFoundExceptionTest::testException
Failed asserting that 1 is identical to 0.

/home/lernhart/work/shopware/app-php-sdk/tests/Exception/ShopNotFoundExceptionTest.php:22

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.
