[Killed] IncrementInteger
Exception/SignatureInvalidException.php:15:9
         private readonly RequestInterface $request,
         ?\Throwable $previous = null
     ) {
-        parent::__construct('Signature could not be verified', 0, $previous);
+        parent::__construct('Signature could not be verified', 1, $previous);
     }
 
killedBy: Shopware\App\SDK\Tests\Exception\SignatureInvalidExceptionTest::testException
statusReason: 1) Shopware\App\SDK\Tests\Exception\SignatureInvalidExceptionTest::testException
Failed asserting that 1 is identical to 0.

/home/lernhart/work/shopware/app-php-sdk/tests/Exception/SignatureInvalidExceptionTest.php:22

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] DecrementInteger
Exception/SignatureInvalidException.php:15:9
         private readonly RequestInterface $request,
         ?\Throwable $previous = null
     ) {
-        parent::__construct('Signature could not be verified', 0, $previous);
+        parent::__construct('Signature could not be verified', -1, $previous);
     }
 
killedBy: Shopware\App\SDK\Tests\Exception\SignatureInvalidExceptionTest::testException
statusReason: 1) Shopware\App\SDK\Tests\Exception\SignatureInvalidExceptionTest::testException
Failed asserting that -1 is identical to 0.

/home/lernhart/work/shopware/app-php-sdk/tests/Exception/SignatureInvalidExceptionTest.php:22

FAILURES!
Tests: 12, Assertions: 11, Failures: 1.
