[Killed] DecrementInteger
Exception/SignatureNotFoundException.php:13:9
 {
     public function __construct(private readonly RequestInterface $request, ?\Throwable $previous = null)
     {
-        parent::__construct('Signature is not present in request', 0, $previous);
+        parent::__construct('Signature is not present in request', -1, $previous);
     }
 
killedBy: Shopware\App\SDK\Tests\Exception\SignatureNotFoundExceptionTest::testException
statusReason: 1) Shopware\App\SDK\Tests\Exception\SignatureNotFoundExceptionTest::testException
Failed asserting that -1 is identical to 0.

/home/lernhart/work/shopware/app-php-sdk/tests/Exception/SignatureNotFoundExceptionTest.php:22

FAILURES!
Tests: 12, Assertions: 11, Failures: 1.

[Killed] IncrementInteger
Exception/SignatureNotFoundException.php:13:9
 {
     public function __construct(private readonly RequestInterface $request, ?\Throwable $previous = null)
     {
-        parent::__construct('Signature is not present in request', 0, $previous);
+        parent::__construct('Signature is not present in request', 1, $previous);
     }
 
killedBy: Shopware\App\SDK\Tests\Exception\SignatureNotFoundExceptionTest::testException
statusReason: 1) Shopware\App\SDK\Tests\Exception\SignatureNotFoundExceptionTest::testException
Failed asserting that 1 is identical to 0.

/home/lernhart/work/shopware/app-php-sdk/tests/Exception/SignatureNotFoundExceptionTest.php:22

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.
