[Killed] PublicVisibility
HttpClient/ClientFactory.php:20:5
     {
     }
 
-    public function createClient(ShopInterface $shop, ClientInterface $client = new Psr18Client(), LoggerInterface $logger = new NullLogger()): ClientInterface
+    protected function createClient(ShopInterface $shop, ClientInterface $client = new Psr18Client(), LoggerInterface $logger = new NullLogger()) : ClientInterface
     {
         return new AuthenticatedClient(new LoggerClient($client, $logger), $shop, $this->cache);
killedBy: Shopware\App\SDK\Tests\HttpClient\ClientFactoryTest::testFactory
statusReason: 1) Shopware\App\SDK\Tests\HttpClient\ClientFactoryTest::testFactory
Error: Call to protected method Shopware\App\SDK\HttpClient\ClientFactory::createClient() from scope Shopware\App\SDK\Tests\HttpClient\ClientFactoryTest

/home/lernhart/work/shopware/app-php-sdk/tests/HttpClient/ClientFactoryTest.php:33

2) Shopware\App\SDK\Tests\HttpClient\ClientFactoryTest::testFactoryOwnClient
Error: Call to pr
