[Killed] MethodCallRemoval
HttpClient/LoggerClient.php:22:9
     {
         $response = $this->client->sendRequest($request);
 
-        $this->logger->debug('Request body', ['body' => $request->getBody()->getContents()]);
+        
         $request->getBody()->rewind();
 
killedBy: Shopware\App\SDK\Tests\HttpClient\LoggerClientTest::testLoggerDebugIsWritten
statusReason: 1) Shopware\App\SDK\Tests\HttpClient\LoggerClientTest::testLoggerDebugIsWritten
Expectation failed for method name is "debug" when invoked 2 time(s).
Method was expected to be called 2 times, actually called 1 times.

FAILURES!
Tests: 5, Assertions: 10, Failures: 1.

[Killed] ArrayItem
HttpClient/LoggerClient.php:22:9
     {
         $response = $this->client->sendRequest($request);
 
-        $this->logger->debug('Request body', ['body' => $request->getBody()->getContents()]);
+        $this->logger->debug('Request body', ['body' > $request->getBody()->getContents()]);
         $request->getBody()->rewind();
 
killedBy: Shopware\App\SDK\Tests\HttpClient\LoggerClientTest::testLoggerDebugIsWritten
statusReason: 1) Shopware\App\SDK\Tests\HttpClient\LoggerClientTest::testLoggerDebugIsWritten
Failed asserting that an array has the key 'body'.

/home/lernhart/work/shopware/app-php-sdk/tests/HttpClient/LoggerClientTest.php:55
/home/lernhart/work/shopware/app-php-sdk/src/HttpClient/LoggerClient.php:18
/home/lernhart/work/shopware/app-php-sdk/tests/HttpClient/LoggerClientTest.php:75

FAILURES!

[Killed] MethodCallRemoval
HttpClient/LoggerClient.php:23:9
         $response = $this->client->sendRequest($request);
 
         $this->logger->debug('Request body', ['body' => $request->getBody()->getContents()]);
-        $request->getBody()->rewind();
+        
 
         $this->logger->info(sprintf('Request: %s %s', $request->getMethod(), $request->getUri()), [
killedBy: Shopware\App\SDK\Tests\HttpClient\LoggerClientTest::testBodyRewindIsCalled
statusReason: 1) Shopware\App\SDK\Tests\HttpClient\LoggerClientTest::testBodyRewindIsCalled
Expectation failed for method name is "rewind" when invoked 1 time(s).
Method was expected to be called 1 times, actually called 0 times.

FAILURES!
Tests: 4, Assertions: 3, Failures: 1.

[Killed] MethodCallRemoval
HttpClient/LoggerClient.php:25:9
         $this->logger->debug('Request body', ['body' => $request->getBody()->getContents()]);
         $request->getBody()->rewind();
 
-        $this->logger->info(sprintf('Request: %s %s', $request->getMethod(), $request->getUri()), [
-            'request' => [
-                'method' => $request->getMethod(),
-                'uri' => $request->getUri(),
-                'headers' => $request->getHeaders(),
-            ],
-            'response' => [
-                'status' => $response->getStatusCode(),
-                'headers' => $response->getHeaders(),
-            ]
-        ]);
+        
 
         $this->logger->debug('Response body', ['body' => $response->getBody()->getContents()]);
killedBy: Shopware\App\SDK\Tests\HttpClient\LoggerClientTest::testRequestGetsLogged
statusReason: 1) Shopware\App\SDK\Tests\HttpClient\LoggerClientTest::testRequestGetsLogged
Expectation failed for method name is "info" when invoked 1 time(s).
Method was expected to be called 1 times, actually called 0 times.

FAILURES!
Tests: 5, Assertions: 16, Failures: 1.

[Killed] MethodCallRemoval
HttpClient/LoggerClient.php:37:9
             ]
         ]);
 
-        $this->logger->debug('Response body', ['body' => $response->getBody()->getContents()]);
+        
         $response->getBody()->rewind();
 
killedBy: Shopware\App\SDK\Tests\HttpClient\LoggerClientTest::testLoggerDebugIsWritten
statusReason: 1) Shopware\App\SDK\Tests\HttpClient\LoggerClientTest::testLoggerDebugIsWritten
Expectation failed for method name is "debug" when invoked 2 time(s).
Method was expected to be called 2 times, actually called 1 times.

FAILURES!
Tests: 5, Assertions: 10, Failures: 1.

[Killed] MethodCallRemoval
HttpClient/LoggerClient.php:38:9
         ]);
 
         $this->logger->debug('Response body', ['body' => $response->getBody()->getContents()]);
-        $response->getBody()->rewind();
+        
 
         return $response;
killedBy: Shopware\App\SDK\Tests\HttpClient\ClientFactoryTest::testFactoryOwnClient
statusReason: 1) Shopware\App\SDK\Tests\HttpClient\ClientFactoryTest::testFactoryOwnClient
TypeError: Shopware\App\SDK\HttpClient\AuthenticatedClient::fetchAccessToken(): Return value must be of type string, null returned

/home/lernhart/work/shopware/app-php-sdk/src/HttpClient/AuthenticatedClient.php:51
/home/lernhart/work/shopware/app-php-sdk/src/HttpClient/AuthenticatedClient.php:28
/home/lernhart/work/shopw
