[Killed] PublicVisibility
HttpClient/SimpleHttpClient/Response.php:15:5
     {
     }
 
-    public function getContent(): string
+    protected function getContent() : string
     {
         $contents = $this->response->getBody()->getContents();
killedBy: Shopware\App\SDK\Tests\HttpClient\SimpleHttpClient\ResponseTest::testResponse
statusReason: 1) Shopware\App\SDK\Tests\HttpClient\SimpleHttpClient\ResponseTest::testResponse
Error: Call to protected method Shopware\App\SDK\HttpClient\SimpleHttpClient\Response::getContent() from scope Shopware\App\SDK\Tests\HttpClient\SimpleHttpClient\ResponseTest

/home/lernhart/work/shopware/app-php-sdk/tests/HttpClient/SimpleHttpClient/ResponseTest.php:21

2) Shopware\App\SDK\Tests\HttpClient\SimpleHttp

[Killed] MethodCallRemoval
HttpClient/SimpleHttpClient/Response.php:18:9
     public function getContent(): string
     {
         $contents = $this->response->getBody()->getContents();
-        $this->response->getBody()->rewind();
+        
 
         return $contents;
killedBy: Shopware\App\SDK\Tests\HttpClient\SimpleHttpClient\ResponseTest::testResponse
statusReason: 1) Shopware\App\SDK\Tests\HttpClient\SimpleHttpClient\ResponseTest::testResponse
JsonException: Syntax error

/home/lernhart/work/shopware/app-php-sdk/src/HttpClient/SimpleHttpClient/Response.php:23
/home/lernhart/work/shopware/app-php-sdk/tests/HttpClient/SimpleHttpClient/ResponseTest.php:22

ERRORS!
Tests: 16, Assertions: 47, Errors: 1.

[Killed] LogicalNot
HttpClient/SimpleHttpClient/Response.php:30:9
     {
         $data = \json_decode($this->getContent(), true, flags: JSON_THROW_ON_ERROR);
 
-        if (!is_array($data)) {
+        if (is_array($data)) {
             throw new \RuntimeException('Response is not a valid JSON array');
         }
killedBy: Shopware\App\SDK\Tests\HttpClient\SimpleHttpClient\SimpleHttpClientTest::testGetJSON
statusReason: 1) Shopware\App\SDK\Tests\HttpClient\SimpleHttpClient\ResponseTest::testNonArrayResponse
Failed asserting that exception of type "TypeError" matches expected exception "RuntimeException". Message was: "Shopware\App\SDK\HttpClient\SimpleHttpClient\Response::toArray(): Return value must be of type array, bool returned" at
/home/lernhart/work/shopware/app-php-sdk/src/HttpClient/SimpleHttpClient/Respo

[Killed] Throw_
HttpClient/SimpleHttpClient/Response.php:31:13
         $data = \json_decode($this->getContent(), true, flags: JSON_THROW_ON_ERROR);
 
         if (!is_array($data)) {
-            throw new \RuntimeException('Response is not a valid JSON array');
+            new \RuntimeException('Response is not a valid JSON array');
         }
 
killedBy: Shopware\App\SDK\Tests\HttpClient\SimpleHttpClient\ResponseTest::testNonArrayResponse
statusReason: 1) Shopware\App\SDK\Tests\HttpClient\SimpleHttpClient\ResponseTest::testNonArrayResponse
Failed asserting that exception of type "TypeError" matches expected exception "RuntimeException". Message was: "Shopware\App\SDK\HttpClient\SimpleHttpClient\Response::toArray(): Return value must be of type array, bool returned" at
/home/lernhart/work/shopware/app-php-sdk/src/HttpClient/SimpleHttpClient/Respo

[Killed] PublicVisibility
HttpClient/SimpleHttpClient/Response.php:37:5
         return $data;
     }
 
-    public function getStatusCode(): int
+    protected function getStatusCode() : int
     {
         return $this->response->getStatusCode();
killedBy: Shopware\App\SDK\Tests\HttpClient\SimpleHttpClient\ResponseTest::testResponse
statusReason: 1) Shopware\App\SDK\Tests\HttpClient\SimpleHttpClient\ResponseTest::testResponse
Error: Call to protected method Shopware\App\SDK\HttpClient\SimpleHttpClient\Response::getStatusCode() from scope Shopware\App\SDK\Tests\HttpClient\SimpleHttpClient\ResponseTest

/home/lernhart/work/shopware/app-php-sdk/tests/HttpClient/SimpleHttpClient/ResponseTest.php:19

2) Shopware\App\SDK\Tests\HttpClient\SimpleH

[Killed] PublicVisibility
HttpClient/SimpleHttpClient/Response.php:42:5
         return $this->response->getStatusCode();
     }
 
-    public function getHeader(string $name): string
+    protected function getHeader(string $name) : string
     {
         return $this->response->getHeaderLine($name);
killedBy: Shopware\App\SDK\Tests\HttpClient\SimpleHttpClient\ResponseTest::testNonArrayResponse
statusReason: 1) Shopware\App\SDK\Tests\HttpClient\SimpleHttpClient\ResponseTest::testNonArrayResponse
Error: Call to protected method Shopware\App\SDK\HttpClient\SimpleHttpClient\Response::getHeader() from scope Shopware\App\SDK\Tests\HttpClient\SimpleHttpClient\ResponseTest

/home/lernhart/work/shopware/app-php-sdk/tests/HttpClient/SimpleHttpClient/ResponseTest.php:33

2) Shopware\App\SDK\Tests\HttpClient\Sim

[Killed] PublicVisibility
HttpClient/SimpleHttpClient/Response.php:47:5
         return $this->response->getHeaderLine($name);
     }
 
-    public function getRawResponse(): ResponseInterface
+    protected function getRawResponse() : ResponseInterface
     {
         return $this->response;
killedBy: Shopware\App\SDK\Tests\HttpClient\SimpleHttpClient\ResponseTest::testResponse
statusReason: 1) Shopware\App\SDK\Tests\HttpClient\SimpleHttpClient\ResponseTest::testResponse
Error: Call to protected method Shopware\App\SDK\HttpClient\SimpleHttpClient\Response::getRawResponse() from scope Shopware\App\SDK\Tests\HttpClient\SimpleHttpClient\ResponseTest

/home/lernhart/work/shopware/app-php-sdk/tests/HttpClient/SimpleHttpClient/ResponseTest.php:24

ERRORS!
Tests: 10, Assertions: 17, Errors:

[Killed] PublicVisibility
HttpClient/SimpleHttpClient/Response.php:52:5
         return $this->response;
     }
 
-    public function ok(): bool
+    protected function ok() : bool
     {
         return $this->getStatusCode() >= 200 && $this->getStatusCode() < 300;
killedBy: Shopware\App\SDK\Tests\HttpClient\SimpleHttpClient\ResponseTest::testResponse
statusReason: 1) Shopware\App\SDK\Tests\HttpClient\SimpleHttpClient\ResponseTest::testResponse
Error: Call to protected method Shopware\App\SDK\HttpClient\SimpleHttpClient\Response::ok() from scope Shopware\App\SDK\Tests\HttpClient\SimpleHttpClient\ResponseTest

/home/lernhart/work/shopware/app-php-sdk/tests/HttpClient/SimpleHttpClient/ResponseTest.php:23

2) Shopware\App\SDK\Tests\HttpClient\SimpleHttpClient\R

[Killed] GreaterThanOrEqualTo
HttpClient/SimpleHttpClient/Response.php:54:9
 
     public function ok(): bool
     {
-        return $this->getStatusCode() >= 200 && $this->getStatusCode() < 300;
+        return $this->getStatusCode() > 200 && $this->getStatusCode() < 300;
     }
 }
killedBy: Shopware\App\SDK\Tests\HttpClient\SimpleHttpClient\SimpleHttpClientTest::testGet
statusReason: 1) Shopware\App\SDK\Tests\HttpClient\SimpleHttpClient\SimpleHttpClientTest::testGet
Failed asserting that false is true.

/home/lernhart/work/shopware/app-php-sdk/tests/HttpClient/SimpleHttpClient/SimpleHttpClientTest.php:31

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] LessThanNegotiation
HttpClient/SimpleHttpClient/Response.php:54:9
 
     public function ok(): bool
     {
-        return $this->getStatusCode() >= 200 && $this->getStatusCode() < 300;
+        return $this->getStatusCode() >= 200 && $this->getStatusCode() >= 300;
     }
 }
killedBy: Shopware\App\SDK\Tests\HttpClient\SimpleHttpClient\ResponseTest::testResponse
statusReason: 1) Shopware\App\SDK\Tests\HttpClient\SimpleHttpClient\ResponseTest::testResponse
Failed asserting that false is true.

/home/lernhart/work/shopware/app-php-sdk/tests/HttpClient/SimpleHttpClient/ResponseTest.php:23

FAILURES!
Tests: 1, Assertions: 5, Failures: 1.
