[Killed] PublicVisibility
HttpClient/SimpleHttpClient/SimpleHttpClient.php:20:5
     /**
      * @param array<string, string> $headers
      */
-    public function get(string $url, array $headers = []): Response
+    protected function get(string $url, array $headers = []) : Response
     {
         $request = $this->createRequest('GET', $url, $headers);
killedBy: Shopware\App\SDK\Tests\HttpClient\SimpleHttpClient\SimpleHttpClientTest::testGetJSON
statusReason: 1) Shopware\App\SDK\Tests\HttpClient\SimpleHttpClient\SimpleHttpClientTest::testGetJSON
Error: Call to protected method Shopware\App\SDK\HttpClient\SimpleHttpClient\SimpleHttpClient::get() from scope Shopware\App\SDK\Tests\HttpClient\SimpleHttpClient\SimpleHttpClientTest

/home/lernhart/work/shopware/app-php-sdk/tests/HttpClient/SimpleHttpClient/SimpleHttpClientTest.php:42

2) Shopware\App\SDK\Tes

[Killed] PublicVisibility
HttpClient/SimpleHttpClient/SimpleHttpClient.php:33:5
      * @param array<mixed> $body
      * @param array<string, string> $headers
      */
-    public function post(string $url, array $body = [], array $headers = []): Response
+    protected function post(string $url, array $body = [], array $headers = []) : Response
     {
         return $this->doRequest('POST', $url, $body, $headers);
statusReason: 1) Shopware\App\SDK\Tests\HttpClient\SimpleHttpClient\SimpleHttpClientTest::testOtherMethods with data set "POST"
Error: Call to protected method Shopware\App\SDK\HttpClient\SimpleHttpClient\SimpleHttpClient::post() from scope Shopware\App\SDK\Tests\HttpClient\SimpleHttpClient\SimpleHttpClientTest

/home/lernhart/work/shopware/app-php-sdk/tests/HttpClient/SimpleHttpClient/SimpleHttpClientTest.php:

[Killed] PublicVisibility
HttpClient/SimpleHttpClient/SimpleHttpClient.php:42:5
      * @param array<mixed> $body
      * @param array<string, string> $headers
      */
-    public function patch(string $url, array $body = [], array $headers = []): Response
+    protected function patch(string $url, array $body = [], array $headers = []) : Response
     {
         return $this->doRequest('PATCH', $url, $body, $headers);
statusReason: 1) Shopware\App\SDK\Tests\HttpClient\SimpleHttpClient\SimpleHttpClientTest::testOtherMethods with data set "PATCH"
Error: Call to protected method Shopware\App\SDK\HttpClient\SimpleHttpClient\SimpleHttpClient::patch() from scope Shopware\App\SDK\Tests\HttpClient\SimpleHttpClient\SimpleHttpClientTest

/home/lernhart/work/shopware/app-php-sdk/tests/HttpClient/SimpleHttpClient/SimpleHttpClientTest.ph

[Killed] PublicVisibility
HttpClient/SimpleHttpClient/SimpleHttpClient.php:51:5
      * @param array<mixed> $body
      * @param array<string, string> $headers
      */
-    public function put(string $url, array $body = [], array $headers = []): Response
+    protected function put(string $url, array $body = [], array $headers = []) : Response
     {
         return $this->doRequest('PUT', $url, $body, $headers);
statusReason: 1) Shopware\App\SDK\Tests\HttpClient\SimpleHttpClient\SimpleHttpClientTest::testOtherMethods with data set "PUT"
Error: Call to protected method Shopware\App\SDK\HttpClient\SimpleHttpClient\SimpleHttpClient::put() from scope Shopware\App\SDK\Tests\HttpClient\SimpleHttpClient\SimpleHttpClientTest

/home/lernhart/work/shopware/app-php-sdk/tests/HttpClient/SimpleHttpClient/SimpleHttpClientTest.php:65

[Killed] PublicVisibility
HttpClient/SimpleHttpClient/SimpleHttpClient.php:60:5
      * @param array<mixed> $body
      * @param array<string, string> $headers
      */
-    public function delete(string $url, array $body = [], array $headers = []): Response
+    protected function delete(string $url, array $body = [], array $headers = []) : Response
     {
         return $this->doRequest('DELETE', $url, $body, $headers);
statusReason: 1) Shopware\App\SDK\Tests\HttpClient\SimpleHttpClient\SimpleHttpClientTest::testOtherMethods with data set "DELETE"
Error: Call to protected method Shopware\App\SDK\HttpClient\SimpleHttpClient\SimpleHttpClient::delete() from scope Shopware\App\SDK\Tests\HttpClient\SimpleHttpClient\SimpleHttpClientTest

/home/lernhart/work/shopware/app-php-sdk/tests/HttpClient/SimpleHttpClient/SimpleHttpClientTest.

[Killed] Foreach_
HttpClient/SimpleHttpClient/SimpleHttpClient.php:97:9
             ->withHeader('Accept', 'application/json')
             ->withHeader('Content-Type', 'application/json');
 
-        foreach ($headers as $headerName => $headerValue) {
-            $request = $request->withHeader($headerName, $headerValue);
-        }
+        foreach (array() as $headerName => $headerValue) {
 
         return $request;
statusReason: 1) Shopware\App\SDK\Tests\HttpClient\SimpleHttpClient\SimpleHttpClientTest::testOtherMethods with data set "POST"
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'1'
+''
