[NoCoverage] DecrementInteger
Registration/RandomStringShopSecretGenerator.php:14:9
 {
     public function generate(): string
     {
-        return bin2hex(random_bytes(64));
+        return bin2hex(random_bytes(63));
     }
 }

[NoCoverage] IncrementInteger
Registration/RandomStringShopSecretGenerator.php:14:9
 {
     public function generate(): string
     {
-        return bin2hex(random_bytes(64));
+        return bin2hex(random_bytes(65));
     }
 }
