[Killed] PublicVisibility
Registration/RegistrationService.php:41:5
      * @throws SignatureNotFoundException
      * @throws SignatureInvalidException
      */
-    public function register(RequestInterface $request): ResponseInterface
+    protected function register(RequestInterface $request) : ResponseInterface
     {
         $this->requestVerifier->authenticateRegistrationRequest($request, $this->appConfiguration);
killedBy: Shopware\App\SDK\Tests\Registration\RegistrationServiceTest::testRegisterMissingParameters
statusReason: 1) Shopware\App\SDK\Tests\Registration\RegistrationServiceTest::testRegisterMissingParameters
/home/lernhart/work/shopware/app-php-sdk/tests/Registration/RegistrationServiceTest.php:62
.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] MethodCallRemoval
Registration/RegistrationService.php:43:9
      */
     public function register(RequestInterface $request): ResponseInterface
     {
-        $this->requestVerifier->authenticateRegistrationRequest($request, $this->appConfiguration);
+        
 
         \parse_str($request->getUri()->getQuery(), $queries);
killedBy: Shopware\App\SDK\Tests\Registration\RegistrationServiceTest::testRegisterRequestIsAuthenticated
statusReason: 1) Shopware\App\SDK\Tests\Registration\RegistrationServiceTest::testRegisterRequestIsAuthenticated
Expectation failed for method name is "authenticateRegistrationRequest" when invoked 1 time(s).
Method was expected to be called 1 times, actually called 0 times.

FAILURES!
Tests: 9, Assertions: 31, Failures: 1.

[Killed] FunctionCallRemoval
Registration/RegistrationService.php:45:9
     {
         $this->requestVerifier->authenticateRegistrationRequest($request, $this->appConfiguration);
 
-        \parse_str($request->getUri()->getQuery(), $queries);
+        
 
         if (!isset($queries['shop-id']) || !is_string($queries['shop-id']) || !isset($queries['shop-url']) || !is_string($queries['shop-url'])) {
killedBy: Shopware\App\SDK\Tests\Registration\RegistrationServiceTest::testRegisterRequestIsAuthenticated
statusReason: 1) Shopware\App\SDK\Tests\Registration\RegistrationServiceTest::testRegisterRequestIsAuthenticated
Shopware\App\SDK\Exception\MissingShopParameterException: Missing shop parameters

/home/lernhart/work/shopware/app-php-sdk/src/Registration/RegistrationService.php:36
/home/lernhart/work/shopware/app-php-sdk/tests/Registration/RegistrationServiceTest.php:255

2) Shopware\App\SDK\Tests\Registration\R

[Killed] LogicalNot
Registration/RegistrationService.php:47:9
 
         \parse_str($request->getUri()->getQuery(), $queries);
 
-        if (!isset($queries['shop-id']) || !is_string($queries['shop-id']) || !isset($queries['shop-url']) || !is_string($queries['shop-url'])) {
+        if (!isset($queries['shop-id']) || !is_string($queries['shop-id']) || !isset($queries['shop-url']) || is_string($queries['shop-url'])) {
             throw new MissingShopParameterException();
         }
killedBy: Shopware\App\SDK\Tests\Registration\RegistrationServiceTest::testRegisterCreate
statusReason: 1) Shopware\App\SDK\Tests\Registration\RegistrationServiceTest::testRegisterCreate
Shopware\App\SDK\Exception\MissingShopParameterException: Missing shop parameters

/home/lernhart/work/shopware/app-php-sdk/src/Registration/RegistrationService.php:36
/home/lernhart/work/shopware/app-php-sdk/tests/Registration/RegistrationServiceTest.php:69

2) Shopware\App\SDK\Tests\Registration\RegistrationServic

[Killed] LogicalNot
Registration/RegistrationService.php:47:9
 
         \parse_str($request->getUri()->getQuery(), $queries);
 
-        if (!isset($queries['shop-id']) || !is_string($queries['shop-id']) || !isset($queries['shop-url']) || !is_string($queries['shop-url'])) {
+        if (!isset($queries['shop-id']) || !is_string($queries['shop-id']) || isset($queries['shop-url']) || !is_string($queries['shop-url'])) {
             throw new MissingShopParameterException();
         }
killedBy: Shopware\App\SDK\Tests\Registration\RegistrationServiceTest::testRegisterCreate
statusReason: 1) Shopware\App\SDK\Tests\Registration\RegistrationServiceTest::testRegisterCreate
Shopware\App\SDK\Exception\MissingShopParameterException: Missing shop parameters

/home/lernhart/work/shopware/app-php-sdk/src/Registration/RegistrationService.php:36
/home/lernhart/work/shopware/app-php-sdk/tests/Registration/RegistrationServiceTest.php:69

2) Shopware\App\SDK\Tests\Registration\RegistrationServic

[Killed] Throw_
Registration/RegistrationService.php:48:13
         \parse_str($request->getUri()->getQuery(), $queries);
 
         if (!isset($queries['shop-id']) || !is_string($queries['shop-id']) || !isset($queries['shop-url']) || !is_string($queries['shop-url'])) {
-            throw new MissingShopParameterException();
+            new MissingShopParameterException();
         }
 
killedBy: Shopware\App\SDK\Tests\Registration\RegistrationServiceTest::testRegisterMissingParameters
statusReason: 1) Shopware\App\SDK\Tests\Registration\RegistrationServiceTest::testRegisterMissingParameters
/home/lernhart/work/shopware/app-php-sdk/src/Test/MockShopRepository.php:27
/home/lernhart/work/shopware/app-php-sdk/src/Registration/RegistrationService.php:38
/home/lernhart/work/shopware/app-php-sdk/tests/Registration/RegistrationServiceTest.php:62
.

FAILURES!

[Killed] MethodCallRemoval
Registration/RegistrationService.php:60:13
                 $this->shopSecretGeneratorInterface->generate()
             );
 
-            $this->shopRepository->createShop($shop);
+            
         } else {
             $this->shopRepository->updateShop($shop->withShopUrl($queries['shop-url']));
killedBy: Shopware\App\SDK\Tests\Registration\RegistrationServiceTest::testRegisterCreate
statusReason: 1) Shopware\App\SDK\Tests\Registration\RegistrationServiceTest::testRegisterCreate
Failed asserting that null is not null.

/home/lernhart/work/shopware/app-php-sdk/tests/Registration/RegistrationServiceTest.php:72

FAILURES!
Tests: 12, Assertions: 26, Failures: 1.

[Killed] MethodCallRemoval
Registration/RegistrationService.php:62:13
 
             $this->shopRepository->createShop($shop);
         } else {
-            $this->shopRepository->updateShop($shop->withShopUrl($queries['shop-url']));
+            
         }
 
killedBy: Shopware\App\SDK\Tests\Registration\RegistrationServiceTest::testRegisterUpdate
statusReason: 1) Shopware\App\SDK\Tests\Registration\RegistrationServiceTest::testRegisterUpdate
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'https://my-shop.com'
+'https://foo.com'

[Killed] MethodCallRemoval
Registration/RegistrationService.php:65:9
             $this->shopRepository->updateShop($shop->withShopUrl($queries['shop-url']));
         }
 
-        $this->logger->info('Shop registration request received', [
-            'shop-id' => $shop->getShopId(),
-            'shop-url' => $shop->getShopUrl(),
-        ]);
+        
 
 
killedBy: Shopware\App\SDK\Tests\Registration\RegistrationServiceTest::testRegisterMessageIsLogged
statusReason: 1) Shopware\App\SDK\Tests\Registration\RegistrationServiceTest::testRegisterMessageIsLogged
Expectation failed for method name is "info" when invoked 1 time(s).
Method was expected to be called 1 times, actually called 0 times.

FAILURES!
Tests: 12, Assertions: 34, Failures: 1.

[Killed] ArrayItem
Registration/RegistrationService.php:67:13
 
         $this->logger->info('Shop registration request received', [
             'shop-id' => $shop->getShopId(),
-            'shop-url' => $shop->getShopUrl(),
+            $this->logger->info('Shop registration request received', ['shop-id' => $shop->getShopId(), 'shop-url' > $shop->getShopUrl()]);
         ]);
 
killedBy: Shopware\App\SDK\Tests\Registration\RegistrationServiceTest::testRegisterMessageIsLogged
statusReason: 1) Shopware\App\SDK\Tests\Registration\RegistrationServiceTest::testRegisterMessageIsLogged
Expectation failed for method name is "info" when invoked 1 time(s)
Parameter 1 for invocation Psr\Log\LoggerInterface::info('Shop registration request received', Array (...)): void does not match expected value.
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (

[Killed] ArrayItemRemoval
Registration/RegistrationService.php:73:9
 
         $psrFactory = new Psr17Factory();
 
-        $data = [
-            'proof' => $this->responseSigner->getRegistrationSignature($this->appConfiguration, $shop),
-            'confirmation_url' => $this->appConfiguration->getRegistrationConfirmUrl(),
-            'secret' => $shop->getShopSecret(),
-        ];
+        $data = ['confirmation_url' => $this->appConfiguration->getRegistrationConfirmUrl(), 'secret' => $shop->getShopSecret()];
 
         $response = $psrFactory->createResponse(200);
killedBy: Shopware\App\SDK\Tests\Registration\RegistrationServiceTest::testRegisterCreate
statusReason: 1) Shopware\App\SDK\Tests\Registration\RegistrationServiceTest::testRegisterCreate
Failed asserting that an array has the key 'proof'.

/home/lernhart/work/shopware/app-php-sdk/tests/Registration/RegistrationServiceTest.php:82

FAILURES!
Tests: 3, Assertions: 9, Failures: 1.

[Killed] DecrementInteger
Registration/RegistrationService.php:79:9
             'secret' => $shop->getShopSecret(),
         ];
 
-        $response = $psrFactory->createResponse(200);
+        $response = $psrFactory->createResponse(199);
 
         return $response
killedBy: Shopware\App\SDK\Tests\Registration\RegistrationServiceTest::testRegisterCreate
statusReason: 1) Shopware\App\SDK\Tests\Registration\RegistrationServiceTest::testRegisterCreate
Failed asserting that 199 is identical to 200.

/home/lernhart/work/shopware/app-php-sdk/tests/Registration/RegistrationServiceTest.php:78

FAILURES!
Tests: 6, Assertions: 18, Failures: 1.

[Killed] IncrementInteger
Registration/RegistrationService.php:79:9
             'secret' => $shop->getShopSecret(),
         ];
 
-        $response = $psrFactory->createResponse(200);
+        $response = $psrFactory->createResponse(201);
 
         return $response
killedBy: Shopware\App\SDK\Tests\Registration\RegistrationServiceTest::testRegisterCreate
statusReason: 1) Shopware\App\SDK\Tests\Registration\RegistrationServiceTest::testRegisterCreate
Failed asserting that 201 is identical to 200.

/home/lernhart/work/shopware/app-php-sdk/tests/Registration/RegistrationServiceTest.php:78

FAILURES!
Tests: 5, Assertions: 9, Failures: 1.

[Killed] PublicVisibility
Registration/RegistrationService.php:92:5
      * @throws SignatureNotFoundException
      * @throws ShopNotFoundException
      */
-    public function registerConfirm(RequestInterface $request): ResponseInterface
+    protected function registerConfirm(RequestInterface $request) : ResponseInterface
     {
         /** @var array<string, mixed> $requestContent */
killedBy: Shopware\App\SDK\Tests\Registration\RegistrationServiceTest::testConfirmMissingParameter
statusReason: 1) Shopware\App\SDK\Tests\Registration\RegistrationServiceTest::testConfirmMissingParameter
/home/lernhart/work/shopware/app-php-sdk/tests/Registration/RegistrationServiceTest.php:108
.

FAILURES!
Tests: 3, Assertions: 11, Failures: 1.

[Killed] Throw_
Registration/RegistrationService.php:98:13
         $requestContent = \json_decode($request->getBody()->getContents(), true, flags: JSON_THROW_ON_ERROR);
 
-            throw new MissingShopParameterException();
+            new MissingShopParameterException();
         }
 
killedBy: Shopware\App\SDK\Tests\Registration\RegistrationServiceTest::testConfirmMissingParameter
statusReason: 1) Shopware\App\SDK\Tests\Registration\RegistrationServiceTest::testConfirmMissingParameter
/home/lernhart/work/shopware/app-php-sdk/src/Test/MockShopRepository.php:27
/home/lernhart/work/shopware/app-php-sdk/src/Registration/RegistrationService.php:64
/home/lernhart/work/shopware/app-php-sdk/tests/Registration/RegistrationServiceTest.php:108
.

FAILURES!

[Killed] LogicalNot
Registration/RegistrationService.php:103:9
 
         $shop = $this->shopRepository->getShopFromId($requestContent['shopId']);
 
-        if (!$shop) {
+        if ($shop) {
             throw new ShopNotFoundException($requestContent['shopId']);
         }
killedBy: Shopware\App\SDK\Tests\Registration\RegistrationServiceTest::testConfirmNotExistingShop
statusReason: 1) Shopware\App\SDK\Tests\Registration\RegistrationServiceTest::testConfirmNotExistingShop
/home/lernhart/work/shopware/app-php-sdk/src/Registration/RegistrationService.php:69
/home/lernhart/work/shopware/app-php-sdk/tests/Registration/RegistrationServiceTest.php:116
.

FAILURES!
Tests: 4, Assertions: 7, Failures: 1.

[Killed] Throw_
Registration/RegistrationService.php:104:13
         $shop = $this->shopRepository->getShopFromId($requestContent['shopId']);
 
         if (!$shop) {
-            throw new ShopNotFoundException($requestContent['shopId']);
+            new ShopNotFoundException($requestContent['shopId']);
         }
 
killedBy: Shopware\App\SDK\Tests\Registration\RegistrationServiceTest::testConfirmNotExistingShop
statusReason: 1) Shopware\App\SDK\Tests\Registration\RegistrationServiceTest::testConfirmNotExistingShop
/home/lernhart/work/shopware/app-php-sdk/src/Registration/RegistrationService.php:69
/home/lernhart/work/shopware/app-php-sdk/tests/Registration/RegistrationServiceTest.php:116
.

FAILURES!
Tests: 3, Assertions: 3, Failures: 1.

[Killed] MethodCallRemoval
Registration/RegistrationService.php:107:9
             throw new ShopNotFoundException($requestContent['shopId']);
         }
 
-        $request->getBody()->rewind();
+        
 
         $this->requestVerifier->authenticatePostRequest($request, $shop);
killedBy: Shopware\App\SDK\Tests\Registration\RegistrationServiceTest::testBodyRewindIsCalled
statusReason: 1) Shopware\App\SDK\Tests\Registration\RegistrationServiceTest::testBodyRewindIsCalled
Expectation failed for method name is "rewind" when invoked 1 time(s).
Method was expected to be called 1 times, actually called 0 times.

FAILURES!
Tests: 11, Assertions: 25, Failures: 1.

[Killed] MethodCallRemoval
Registration/RegistrationService.php:109:9
 
         $request->getBody()->rewind();
 
-        $this->requestVerifier->authenticatePostRequest($request, $shop);
+        
 
         $this->eventDispatcher?->dispatch(new RegistrationBeforeCompletedEvent($shop, $request, $requestContent));
killedBy: Shopware\App\SDK\Tests\Registration\RegistrationServiceTest::testRegisterConfirmRequestIsAuthenticated
statusReason: 1) Shopware\App\SDK\Tests\Registration\RegistrationServiceTest::testRegisterConfirmRequestIsAuthenticated
Expectation failed for method name is "authenticatePostRequest" when invoked 1 time(s).
Method was expected to be called 1 times, actually called 0 times.

FAILURES!
Tests: 11, Assertions: 25, Failures: 1.

[Killed] NullSafeMethodCall
Registration/RegistrationService.php:111:9
 
         $this->requestVerifier->authenticatePostRequest($request, $shop);
 
-        $this->eventDispatcher?->dispatch(new RegistrationBeforeCompletedEvent($shop, $request, $requestContent));
+        $this->eventDispatcher->dispatch(new RegistrationBeforeCompletedEvent($shop, $request, $requestContent));
 
         $this->shopRepository->updateShop(
killedBy: Shopware\App\SDK\Tests\Registration\RegistrationServiceTest::testBodyRewindIsCalled
statusReason: 1) Shopware\App\SDK\Tests\Registration\RegistrationServiceTest::testBodyRewindIsCalled
Error: Call to a member function dispatch() on null

/home/lernhart/work/shopware/app-php-sdk/src/Registration/RegistrationService.php:70
/home/lernhart/work/shopware/app-php-sdk/tests/Registration/RegistrationServiceTest.php:298

2) Shopware\App\SDK\Tests\Registration\RegistrationServiceTest::testRegisterConfir

[Killed] MethodCallRemoval
Registration/RegistrationService.php:113:9
 
         $this->eventDispatcher?->dispatch(new RegistrationBeforeCompletedEvent($shop, $request, $requestContent));
 
-        $this->shopRepository->updateShop(
-            $shop->withShopApiCredentials($requestContent['apiKey'], $requestContent['secretKey'])
-        );
+        
 
         $this->logger->info('Shop registration confirmed', [
killedBy: Shopware\App\SDK\Tests\Registration\RegistrationServiceTest::testConfirm
statusReason: 1) Shopware\App\SDK\Tests\Registration\RegistrationServiceTest::testConfirm
Failed asserting that null matches expected '1'.

/home/lernhart/work/shopware/app-php-sdk/tests/Registration/RegistrationServiceTest.php:148

FAILURES!
Tests: 7, Assertions: 19, Failures: 1.

[Killed] MethodCallRemoval
Registration/RegistrationService.php:117:9
             $shop->withShopApiCredentials($requestContent['apiKey'], $requestContent['secretKey'])
         );
 
-        $this->logger->info('Shop registration confirmed', [
-            'shop-id' => $shop->getShopId(),
-            'shop-url' => $shop->getShopUrl(),
-        ]);
+        
 
         $this->eventDispatcher?->dispatch(new RegistrationCompletedEvent($request, $shop));
killedBy: Shopware\App\SDK\Tests\Registration\RegistrationServiceTest::testRegisterConfirmMessageIsLogged
statusReason: 1) Shopware\App\SDK\Tests\Registration\RegistrationServiceTest::testRegisterConfirmMessageIsLogged
Expectation failed for method name is "info" when invoked 1 time(s).
Method was expected to be called 1 times, actually called 0 times.

FAILURES!
Tests: 11, Assertions: 33, Failures: 1.

[Killed] ArrayItem
Registration/RegistrationService.php:118:13
         );
 
         $this->logger->info('Shop registration confirmed', [
-            'shop-id' => $shop->getShopId(),
+            $this->logger->info('Shop registration confirmed', ['shop-id' > $shop->getShopId(), 'shop-url' => $shop->getShopUrl()]);
             'shop-url' => $shop->getShopUrl(),
         ]);
killedBy: Shopware\App\SDK\Tests\Registration\RegistrationServiceTest::testRegisterConfirmMessageIsLogged
statusReason: 1) Shopware\App\SDK\Tests\Registration\RegistrationServiceTest::testRegisterConfirmMessageIsLogged
Expectation failed for method name is "info" when invoked 1 time(s)
Parameter 1 for invocation Psr\Log\LoggerInterface::info('Shop registration confirmed', Array (...)): void does not match expected value.
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (

[Killed] NullSafeMethodCall
Registration/RegistrationService.php:122:9
             'shop-url' => $shop->getShopUrl(),
         ]);
 
-        $this->eventDispatcher?->dispatch(new RegistrationCompletedEvent($request, $shop));
+        $this->eventDispatcher->dispatch(new RegistrationCompletedEvent($request, $shop));
 
         $psrFactory = new Psr17Factory();
killedBy: Shopware\App\SDK\Tests\Registration\RegistrationServiceTest::testRegisterConfirmMessageIsLogged
statusReason: 1) Shopware\App\SDK\Tests\Registration\RegistrationServiceTest::testRegisterConfirmMessageIsLogged
Error: Call to a member function dispatch() on null

/home/lernhart/work/shopware/app-php-sdk/src/Registration/RegistrationService.php:73
/home/lernhart/work/shopware/app-php-sdk/tests/Registration/RegistrationServiceTest.php:233

2) Shopware\App\SDK\Tests\Registration\RegistrationServiceTest::testWi

[Killed] IncrementInteger
Registration/RegistrationService.php:126:9
 
         $psrFactory = new Psr17Factory();
 
-        return $psrFactory->createResponse(204);
+        return $psrFactory->createResponse(205);
     }
 }
killedBy: Shopware\App\SDK\Tests\Registration\RegistrationServiceTest::testConfirm
statusReason: 1) Shopware\App\SDK\Tests\Registration\RegistrationServiceTest::testConfirm
Failed asserting that 205 is identical to 204.

/home/lernhart/work/shopware/app-php-sdk/tests/Registration/RegistrationServiceTest.php:156

FAILURES!
Tests: 7, Assertions: 26, Failures: 1.

[Killed] DecrementInteger
Registration/RegistrationService.php:126:9
 
         $psrFactory = new Psr17Factory();
 
-        return $psrFactory->createResponse(204);
+        return $psrFactory->createResponse(203);
     }
 }
killedBy: Shopware\App\SDK\Tests\Registration\RegistrationServiceTest::testConfirm
statusReason: 1) Shopware\App\SDK\Tests\Registration\RegistrationServiceTest::testConfirm
Failed asserting that 203 is identical to 204.

/home/lernhart/work/shopware/app-php-sdk/tests/Registration/RegistrationServiceTest.php:156

FAILURES!
Tests: 5, Assertions: 24, Failures: 1.
