[Killed] PublicVisibility
Response/ActionButtonResponse.php:15:5
     /**
      * Opens in the Administration a new tab to the given URL and adds the shop-id as query parameter with the signature
      */
-    public static function openNewTab(string $url): ResponseInterface
+    protected static function openNewTab(string $url) : ResponseInterface
     {
         return self::createResponse([
killedBy: Shopware\App\SDK\Tests\Response\ActionButtonResponseTest::testOpenNewTab
statusReason: 1) Shopware\App\SDK\Tests\Response\ActionButtonResponseTest::testOpenNewTab
Error: Call to protected method Shopware\App\SDK\Response\ActionButtonResponse::openNewTab() from scope Shopware\App\SDK\Tests\Response\ActionButtonResponseTest

/home/lernhart/work/shopware/app-php-sdk/tests/Response/ActionButtonResponseTest.php:32

--

There was 1 risky test:

[Killed] PublicVisibility
Response/ActionButtonResponse.php:28:5
     /**
      * Reloads the Administration tab
      */
-    public static function reload(): ResponseInterface
+    protected static function reload() : ResponseInterface
     {
         return self::createResponse([
killedBy: Shopware\App\SDK\Tests\Response\ActionButtonResponseTest::testReload
statusReason: 1) Shopware\App\SDK\Tests\Response\ActionButtonResponseTest::testReload
Error: Call to protected method Shopware\App\SDK\Response\ActionButtonResponse::reload() from scope Shopware\App\SDK\Tests\Response\ActionButtonResponseTest

/home/lernhart/work/shopware/app-php-sdk/tests/Response/ActionButtonResponseTest.php:24

--

There was 1 risky test:

[Killed] FalseValue
Response/ActionButtonResponse.php:40:5
      * @param 'small'|'medium'|'large'|'fullscreen' $size
      * @param bool $expand - If true, the modal will be expanded to the full height of the screen
      */
-    public static function modal(string $url, string $size = 'medium', bool $expand = false): ResponseInterface
+    public static function modal(string $url, string $size = 'medium', bool $expand = true) : ResponseInterface
     {
         return self::createResponse([
killedBy: Shopware\App\SDK\Tests\Response\ActionButtonResponseTest::testModal
statusReason: 1) Shopware\App\SDK\Tests\Response\ActionButtonResponseTest::testModal
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'{"actionType":"openModal","payload":{"iframeUrl":"https:\/\/example.com","size":"medium","expand":false}}'
+'{"actionType":"openModal","payload":{"iframeUrl":"https:\/\/example.com","size":"medium","expand":true}}'

[Killed] PublicVisibility
Response/ActionButtonResponse.php:40:5
      * @param 'small'|'medium'|'large'|'fullscreen' $size
      * @param bool $expand - If true, the modal will be expanded to the full height of the screen
      */
-    public static function modal(string $url, string $size = 'medium', bool $expand = false): ResponseInterface
+    protected static function modal(string $url, string $size = 'medium', bool $expand = false) : ResponseInterface
     {
         return self::createResponse([
killedBy: Shopware\App\SDK\Tests\Response\ActionButtonResponseTest::testModal
statusReason: 1) Shopware\App\SDK\Tests\Response\ActionButtonResponseTest::testModal
Error: Call to protected method Shopware\App\SDK\Response\ActionButtonResponse::modal() from scope Shopware\App\SDK\Tests\Response\ActionButtonResponseTest

/home/lernhart/work/shopware/app-php-sdk/tests/Response/ActionButtonResponseTest.php:16

--

There was 1 risky test:

[Killed] ArrayItemRemoval
Response/ActionButtonResponse.php:42:9
      */
     public static function modal(string $url, string $size = 'medium', bool $expand = false): ResponseInterface
     {
-        return self::createResponse([
-            'actionType' => 'openModal',
-            'payload' => [
-                'iframeUrl' => $url,
-                'size' => $size,
-                'expand' => $expand
-            ]
-        ]);
+        return self::createResponse(['payload' => ['iframeUrl' => $url, 'size' => $size, 'expand' => $expand]]);
     }
 
killedBy: Shopware\App\SDK\Tests\Response\ActionButtonResponseTest::testModal
statusReason: 1) Shopware\App\SDK\Tests\Response\ActionButtonResponseTest::testModal
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'{"actionType":"openModal","payload":{"iframeUrl":"https:\/\/example.com","size":"medium","expand":false}}'
+'{"payload":{"iframeUrl":"https:\/\/example.com","size":"medium","expand":false}}'

[Killed] ArrayItemRemoval
Response/ActionButtonResponse.php:44:13
     {
         return self::createResponse([
             'actionType' => 'openModal',
-            'payload' => [
-                'iframeUrl' => $url,
-                'size' => $size,
-                'expand' => $expand
-            ]
+            return self::createResponse(['actionType' => 'openModal', 'payload' => ['size' => $size, 'expand' => $expand]]);
         ]);
     }
killedBy: Shopware\App\SDK\Tests\Response\ActionButtonResponseTest::testModal
statusReason: 1) Shopware\App\SDK\Tests\Response\ActionButtonResponseTest::testModal
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'{"actionType":"openModal","payload":{"iframeUrl":"https:\/\/example.com","size":"medium","expand":false}}'
+'{"actionType":"openModal","payload":{"size":"medium","expand":false}}'

[Killed] PublicVisibility
Response/ActionButtonResponse.php:55:5
     /**
      * @param 'success'|'error'|'info'|'warning' $type
      */
-    public static function notification(string $type, string $message): ResponseInterface
+    protected static function notification(string $type, string $message) : ResponseInterface
     {
         return self::createResponse([
killedBy: Shopware\App\SDK\Tests\Response\ActionButtonResponseTest::testNotification
statusReason: 1) Shopware\App\SDK\Tests\Response\ActionButtonResponseTest::testNotification
Error: Call to protected method Shopware\App\SDK\Response\ActionButtonResponse::notification() from scope Shopware\App\SDK\Tests\Response\ActionButtonResponseTest

/home/lernhart/work/shopware/app-php-sdk/tests/Response/ActionButtonResponseTest.php:40

--

There was 1 risky test:

[Killed] ArrayItemRemoval
Response/ActionButtonResponse.php:57:9
      */
     public static function notification(string $type, string $message): ResponseInterface
     {
-        return self::createResponse([
-            'actionType' => 'notification',
-            'payload' => [
-                'message' => $message,
-                'status' => $type
-            ]
-        ]);
+        return self::createResponse(['payload' => ['message' => $message, 'status' => $type]]);
     }
 
killedBy: Shopware\App\SDK\Tests\Response\ActionButtonResponseTest::testNotification
statusReason: 1) Shopware\App\SDK\Tests\Response\ActionButtonResponseTest::testNotification
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'{"actionType":"notification","payload":{"message":"foo","status":"success"}}'
+'{"payload":{"message":"foo","status":"success"}}'

[Killed] IncrementInteger
Response/ActionButtonResponse.php:73:9
     {
         $psr = new Psr17Factory();
 
-        return $psr->createResponse(200)
+        return $psr->createResponse(201)->withHeader('Content-Type', 'application/json')->withBody($psr->createStream(json_encode($data, JSON_THROW_ON_ERROR)));
             ->withHeader('Content-Type', 'application/json')
             ->withBody($psr->createStream(json_encode($data, JSON_THROW_ON_ERROR)));
killedBy: Shopware\App\SDK\Tests\Response\ActionButtonResponseTest::testReload
statusReason: 1) Shopware\App\SDK\Tests\Response\ActionButtonResponseTest::testReload
Failed asserting that 201 is identical to 200.

/home/lernhart/work/shopware/app-php-sdk/tests/Response/ActionButtonResponseTest.php:26

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] DecrementInteger
Response/ActionButtonResponse.php:73:9
     {
         $psr = new Psr17Factory();
 
-        return $psr->createResponse(200)
+        return $psr->createResponse(199)->withHeader('Content-Type', 'application/json')->withBody($psr->createStream(json_encode($data, JSON_THROW_ON_ERROR)));
             ->withHeader('Content-Type', 'application/json')
             ->withBody($psr->createStream(json_encode($data, JSON_THROW_ON_ERROR)));
killedBy: Shopware\App\SDK\Tests\Response\ActionButtonResponseTest::testReload
statusReason: 1) Shopware\App\SDK\Tests\Response\ActionButtonResponseTest::testReload
Failed asserting that 199 is identical to 200.

/home/lernhart/work/shopware/app-php-sdk/tests/Response/ActionButtonResponseTest.php:26

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.
