[Killed] PublicVisibility
Response/PaymentResponse.php:15:5
     /**
      * @param array<mixed> $data - Data that will be saved on the order to identify the payment
      */
-    public static function validateSuccess(array $data): ResponseInterface
+    protected static function validateSuccess(array $data) : ResponseInterface
     {
         return self::createResponse(['preOrderPayment' => $data]);
killedBy: Shopware\App\SDK\Tests\Response\PaymentResponseTest::testValidateSuccess
statusReason: 1) Shopware\App\SDK\Tests\Response\PaymentResponseTest::testValidateSuccess
Error: Call to protected method Shopware\App\SDK\Response\PaymentResponse::validateSuccess() from scope Shopware\App\SDK\Tests\Response\PaymentResponseTest

/home/lernhart/work/shopware/app-php-sdk/tests/Response/PaymentResponseTest.php:96

--

There was 1 risky test:

[Killed] ArrayItemRemoval
Response/PaymentResponse.php:17:9
      */
     public static function validateSuccess(array $data): ResponseInterface
     {
-        return self::createResponse(['preOrderPayment' => $data]);
+        return self::createResponse([]);
     }
 
killedBy: Shopware\App\SDK\Tests\Response\PaymentResponseTest::testValidateSuccess
statusReason: 1) Shopware\App\SDK\Tests\Response\PaymentResponseTest::testValidateSuccess
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'{"preOrderPayment":{"foo":"bar"}}'
+'[]'

[Killed] PublicVisibility
Response/PaymentResponse.php:20:5
         return self::createResponse(['preOrderPayment' => $data]);
     }
 
-    public static function validationError(string $message): ResponseInterface
+    protected static function validationError(string $message) : ResponseInterface
     {
         return self::createResponse(['message' => $message]);
killedBy: Shopware\App\SDK\Tests\Response\PaymentResponseTest::testValidateError
statusReason: 1) Shopware\App\SDK\Tests\Response\PaymentResponseTest::testValidateError
Error: Call to protected method Shopware\App\SDK\Response\PaymentResponse::validationError() from scope Shopware\App\SDK\Tests\Response\PaymentResponseTest

/home/lernhart/work/shopware/app-php-sdk/tests/Response/PaymentResponseTest.php:104

--

There was 1 risky test:

[Killed] PublicVisibility
Response/PaymentResponse.php:25:5
         return self::createResponse(['message' => $message]);
     }
 
-    public static function paid(): ResponseInterface
+    protected static function paid() : ResponseInterface
     {
         return self::createStatusResponse('paid');
killedBy: Shopware\App\SDK\Tests\Response\PaymentResponseTest::testPaid
statusReason: 1) Shopware\App\SDK\Tests\Response\PaymentResponseTest::testPaid
Error: Call to protected method Shopware\App\SDK\Response\PaymentResponse::paid() from scope Shopware\App\SDK\Tests\Response\PaymentResponseTest

/home/lernhart/work/shopware/app-php-sdk/tests/Response/PaymentResponseTest.php:16

--

There was 1 risky test:

[Killed] PublicVisibility
Response/PaymentResponse.php:30:5
         return self::createStatusResponse('paid');
     }
 
-    public static function paidPartially(): ResponseInterface
+    protected static function paidPartially() : ResponseInterface
     {
         return self::createStatusResponse('paid_partially');
killedBy: Shopware\App\SDK\Tests\Response\PaymentResponseTest::testPaidPartially
statusReason: 1) Shopware\App\SDK\Tests\Response\PaymentResponseTest::testPaidPartially
Error: Call to protected method Shopware\App\SDK\Response\PaymentResponse::paidPartially() from scope Shopware\App\SDK\Tests\Response\PaymentResponseTest

/home/lernhart/work/shopware/app-php-sdk/tests/Response/PaymentResponseTest.php:24

--

There was 1 risky test:

[Killed] PublicVisibility
Response/PaymentResponse.php:35:5
         return self::createStatusResponse('paid_partially');
     }
 
-    public static function cancelled(string $message = ''): ResponseInterface
+    protected static function cancelled(string $message = '') : ResponseInterface
     {
         return self::createStatusResponse('cancelled', $message);
killedBy: Shopware\App\SDK\Tests\Response\PaymentResponseTest::testCancelled
statusReason: 1) Shopware\App\SDK\Tests\Response\PaymentResponseTest::testCancelled
Error: Call to protected method Shopware\App\SDK\Response\PaymentResponse::cancelled() from scope Shopware\App\SDK\Tests\Response\PaymentResponseTest

/home/lernhart/work/shopware/app-php-sdk/tests/Response/PaymentResponseTest.php:32

--

There was 1 risky test:

[Killed] PublicVisibility
Response/PaymentResponse.php:40:5
         return self::createStatusResponse('cancelled', $message);
     }
 
-    public static function failed(string $message = ''): ResponseInterface
+    protected static function failed(string $message = '') : ResponseInterface
     {
         return self::createStatusResponse('failed', $message);
killedBy: Shopware\App\SDK\Tests\Response\PaymentResponseTest::testFailed
statusReason: 1) Shopware\App\SDK\Tests\Response\PaymentResponseTest::testFailed
Error: Call to protected method Shopware\App\SDK\Response\PaymentResponse::failed() from scope Shopware\App\SDK\Tests\Response\PaymentResponseTest

/home/lernhart/work/shopware/app-php-sdk/tests/Response/PaymentResponseTest.php:40

--

There was 1 risky test:

[Killed] PublicVisibility
Response/PaymentResponse.php:45:5
         return self::createStatusResponse('failed', $message);
     }
 
-    public static function authorized(): ResponseInterface
+    protected static function authorized() : ResponseInterface
     {
         return self::createStatusResponse('authorized');
killedBy: Shopware\App\SDK\Tests\Response\PaymentResponseTest::testAuthorized
statusReason: 1) Shopware\App\SDK\Tests\Response\PaymentResponseTest::testAuthorized
Error: Call to protected method Shopware\App\SDK\Response\PaymentResponse::authorized() from scope Shopware\App\SDK\Tests\Response\PaymentResponseTest

/home/lernhart/work/shopware/app-php-sdk/tests/Response/PaymentResponseTest.php:48

--

There was 1 risky test:

[Killed] PublicVisibility
Response/PaymentResponse.php:50:5
         return self::createStatusResponse('authorized');
     }
 
-    public static function unconfirmed(): ResponseInterface
+    protected static function unconfirmed() : ResponseInterface
     {
         return self::createStatusResponse('unconfirmed');
killedBy: Shopware\App\SDK\Tests\Response\PaymentResponseTest::testUnconfirmed
statusReason: 1) Shopware\App\SDK\Tests\Response\PaymentResponseTest::testUnconfirmed
Error: Call to protected method Shopware\App\SDK\Response\PaymentResponse::unconfirmed() from scope Shopware\App\SDK\Tests\Response\PaymentResponseTest

/home/lernhart/work/shopware/app-php-sdk/tests/Response/PaymentResponseTest.php:56

--

There was 1 risky test:

[Killed] PublicVisibility
Response/PaymentResponse.php:55:5
         return self::createStatusResponse('unconfirmed');
     }
 
-    public static function inProgress(): ResponseInterface
+    protected static function inProgress() : ResponseInterface
     {
         return self::createStatusResponse('in_progress');
killedBy: Shopware\App\SDK\Tests\Response\PaymentResponseTest::testInProgress
statusReason: 1) Shopware\App\SDK\Tests\Response\PaymentResponseTest::testInProgress
Error: Call to protected method Shopware\App\SDK\Response\PaymentResponse::inProgress() from scope Shopware\App\SDK\Tests\Response\PaymentResponseTest

/home/lernhart/work/shopware/app-php-sdk/tests/Response/PaymentResponseTest.php:64

--

There was 1 risky test:

[Killed] PublicVisibility
Response/PaymentResponse.php:60:5
         return self::createStatusResponse('in_progress');
     }
 
-    public static function refunded(): ResponseInterface
+    protected static function refunded() : ResponseInterface
     {
         return self::createStatusResponse('refunded');
killedBy: Shopware\App\SDK\Tests\Response\PaymentResponseTest::testRefunded
statusReason: 1) Shopware\App\SDK\Tests\Response\PaymentResponseTest::testRefunded
Error: Call to protected method Shopware\App\SDK\Response\PaymentResponse::refunded() from scope Shopware\App\SDK\Tests\Response\PaymentResponseTest

/home/lernhart/work/shopware/app-php-sdk/tests/Response/PaymentResponseTest.php:72

--

There was 1 risky test:

[Killed] PublicVisibility
Response/PaymentResponse.php:65:5
         return self::createStatusResponse('refunded');
     }
 
-    public static function reminded(): ResponseInterface
+    protected static function reminded() : ResponseInterface
     {
         return self::createStatusResponse('reminded');
killedBy: Shopware\App\SDK\Tests\Response\PaymentResponseTest::testReminded
statusReason: 1) Shopware\App\SDK\Tests\Response\PaymentResponseTest::testReminded
Error: Call to protected method Shopware\App\SDK\Response\PaymentResponse::reminded() from scope Shopware\App\SDK\Tests\Response\PaymentResponseTest

/home/lernhart/work/shopware/app-php-sdk/tests/Response/PaymentResponseTest.php:80

--

There was 1 risky test:

[Killed] PublicVisibility
Response/PaymentResponse.php:70:5
         return self::createStatusResponse('reminded');
     }
 
-    public static function chargeback(): ResponseInterface
+    protected static function chargeback() : ResponseInterface
     {
         return self::createStatusResponse('chargeback');
killedBy: Shopware\App\SDK\Tests\Response\PaymentResponseTest::testChargeback
statusReason: 1) Shopware\App\SDK\Tests\Response\PaymentResponseTest::testChargeback
Error: Call to protected method Shopware\App\SDK\Response\PaymentResponse::chargeback() from scope Shopware\App\SDK\Tests\Response\PaymentResponseTest

/home/lernhart/work/shopware/app-php-sdk/tests/Response/PaymentResponseTest.php:88

--

There was 1 risky test:

[Killed] UnwrapArrayFilter
Response/PaymentResponse.php:77:9
 
     private static function createStatusResponse(string $status, string $message = ''): ResponseInterface
     {
-        return self::createResponse(array_filter(['status' => $status, 'message' => $message]));
+        return self::createResponse(['status' => $status, 'message' => $message]);
     }
 
killedBy: Shopware\App\SDK\Tests\Response\PaymentResponseTest::testPaid
statusReason: 1) Shopware\App\SDK\Tests\Response\PaymentResponseTest::testPaid
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'{"status":"paid"}'
+'{"status":"paid","message":""}'

[Killed] ArrayItemRemoval
Response/PaymentResponse.php:77:9
 
     private static function createStatusResponse(string $status, string $message = ''): ResponseInterface
     {
-        return self::createResponse(array_filter(['status' => $status, 'message' => $message]));
+        return self::createResponse(array_filter(['message' => $message]));
     }
 
killedBy: Shopware\App\SDK\Tests\Response\PaymentResponseTest::testPaid
statusReason: 1) Shopware\App\SDK\Tests\Response\PaymentResponseTest::testPaid
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'{"status":"paid"}'
+'[]'

[Killed] PublicVisibility
Response/PaymentResponse.php:80:5
         return self::createResponse(array_filter(['status' => $status, 'message' => $message]));
     }
 
-    public static function redirect(string $url): ResponseInterface
+    protected static function redirect(string $url) : ResponseInterface
     {
         return self::createResponse(['redirectUrl' => $url]);
killedBy: Shopware\App\SDK\Tests\Response\PaymentResponseTest::testRedirect
statusReason: 1) Shopware\App\SDK\Tests\Response\PaymentResponseTest::testRedirect
Error: Call to protected method Shopware\App\SDK\Response\PaymentResponse::redirect() from scope Shopware\App\SDK\Tests\Response\PaymentResponseTest

/home/lernhart/work/shopware/app-php-sdk/tests/Response/PaymentResponseTest.php:112

--

There was 1 risky test:
