[Killed] PublicVisibility
Shop/ShopResolver.php:22:5
     {
     }
 
-    public function resolveShop(RequestInterface $request): ShopInterface
+    protected function resolveShop(RequestInterface $request) : ShopInterface
     {
         if ($request->getHeaderLine('Content-Type') === 'application/json') {
killedBy: Shopware\App\SDK\Tests\Shop\ShopResolverTest::testResolveQueryStringInvalid
statusReason: 1) Shopware\App\SDK\Tests\Shop\ShopResolverTest::testResolveQueryStringInvalid
Failed asserting that exception of type "Error" matches expected exception "Shopware\App\SDK\Exception\MissingShopParameterException". Message was: "Call to protected method Shopware\App\SDK\Shop\ShopResolver::resolveShop() from scope Shopware\App\SDK\Tests\Shop\ShopResolverTest" at
/home/lernhart/work/shopware/app-php-

[Killed] Identical
Shop/ShopResolver.php:24:9
 
     public function resolveShop(RequestInterface $request): ShopInterface
     {
-        if ($request->getHeaderLine('Content-Type') === 'application/json') {
+        if ($request->getHeaderLine('Content-Type') !== 'application/json') {
             return $this->resolveFromSource($request);
         }
killedBy: Shopware\App\SDK\Tests\Shop\ShopResolverTest::testResolveSourceNotExisting
statusReason: 1) Shopware\App\SDK\Tests\Shop\ShopResolverTest::testResolveSourceNotExisting
Failed asserting that exception of type "Shopware\App\SDK\Exception\MissingShopParameterException" matches expected exception "Shopware\App\SDK\Exception\ShopNotFoundException". Message was: "Missing shop parameters" at
/home/lernhart/work/shopware/app-php-sdk/src/Shop/ShopResolver.php:53
/home/lernhart/work/shopware/app

[Killed] MethodCallRemoval
Shop/ShopResolver.php:39:9
     private function resolveFromSource(RequestInterface $request): ShopInterface
     {
         $body = \json_decode($request->getBody()->getContents(), true, flags: JSON_THROW_ON_ERROR);
-        $request->getBody()->rewind();
+        
 
         if (!is_array($body) || !isset($body['source']) || !isset($body['source']['shopId']) || !is_string($body['source']['shopId'])) {
killedBy: Shopware\App\SDK\Tests\Shop\ShopResolverTest::testRequestRewindIsCalled
statusReason: 1) Shopware\App\SDK\Tests\Shop\ShopResolverTest::testRequestRewindIsCalled
Expectation failed for method name is "rewind" when invoked 1 time(s).
Method was expected to be called 1 times, actually called 0 times.

FAILURES!
Tests: 7, Assertions: 9, Failures: 1.

[Killed] LogicalNot
Shop/ShopResolver.php:41:9
         $body = \json_decode($request->getBody()->getContents(), true, flags: JSON_THROW_ON_ERROR);
         $request->getBody()->rewind();
 
-        if (!is_array($body) || !isset($body['source']) || !isset($body['source']['shopId']) || !is_string($body['source']['shopId'])) {
+        if (is_array($body) || !isset($body['source']) || !isset($body['source']['shopId']) || !is_string($body['source']['shopId'])) {
             throw new MissingShopParameterException();
         }
killedBy: Shopware\App\SDK\Tests\Shop\ShopResolverTest::testResolveSourceNotExisting
statusReason: 1) Shopware\App\SDK\Tests\Shop\ShopResolverTest::testResolveSourceNotExisting
Failed asserting that exception of type "Shopware\App\SDK\Exception\MissingShopParameterException" matches expected exception "Shopware\App\SDK\Exception\ShopNotFoundException". Message was: "Missing shop parameters" at
/home/lernhart/work/shopware/app-php-sdk/src/Shop/ShopResolver.php:36
/home/lernhart/work/shopware/app

[Killed] LogicalNot
Shop/ShopResolver.php:41:9
         $body = \json_decode($request->getBody()->getContents(), true, flags: JSON_THROW_ON_ERROR);
         $request->getBody()->rewind();
 
-        if (!is_array($body) || !isset($body['source']) || !isset($body['source']['shopId']) || !is_string($body['source']['shopId'])) {
+        if (!is_array($body) || !isset($body['source']) || isset($body['source']['shopId']) || !is_string($body['source']['shopId'])) {
             throw new MissingShopParameterException();
         }
killedBy: Shopware\App\SDK\Tests\Shop\ShopResolverTest::testResolveSourceInvalidJSON
statusReason: 1) Shopware\App\SDK\Tests\Shop\ShopResolverTest::testResolveSourceInvalidJSON
Failed asserting that exception of type "TypeError" matches expected exception "Shopware\App\SDK\Exception\MissingShopParameterException". Message was: "Cannot access offset of type string on string" at
/home/lernhart/work/shopware/app-php-sdk/src/Shop/ShopResolver.php:35
/home/lernhart/work/shopware/app-php-sdk/src/Shop

[Killed] Throw_
Shop/ShopResolver.php:42:13
         $request->getBody()->rewind();
 
         if (!is_array($body) || !isset($body['source']) || !isset($body['source']['shopId']) || !is_string($body['source']['shopId'])) {
-            throw new MissingShopParameterException();
+            new MissingShopParameterException();
         }
 
killedBy: Shopware\App\SDK\Tests\Shop\ShopResolverTest::testResolveSourceInvalidJSON
statusReason: 1) Shopware\App\SDK\Tests\Shop\ShopResolverTest::testResolveSourceInvalidJSON
Failed asserting that exception of type "TypeError" matches expected exception "Shopware\App\SDK\Exception\MissingShopParameterException". Message was: "Cannot access offset of type string on string" at
/home/lernhart/work/shopware/app-php-sdk/src/Shop/ShopResolver.php:38
/home/lernhart/work/shopware/app-php-sdk/src/Shop

[Killed] Throw_
Shop/ShopResolver.php:48:13
         $shop = $this->shopRepository->getShopFromId($body['source']['shopId']);
 
         if ($shop === null) {
-            throw new ShopNotFoundException($body['source']['shopId']);
+            new ShopNotFoundException($body['source']['shopId']);
         }
 
killedBy: Shopware\App\SDK\Tests\Shop\ShopResolverTest::testResolveSourceNotExisting
statusReason: 1) Shopware\App\SDK\Tests\Shop\ShopResolverTest::testResolveSourceNotExisting
/home/lernhart/work/shopware/app-php-sdk/src/Shop/ShopResolver.php:42
/home/lernhart/work/shopware/app-php-sdk/src/Shop/ShopResolver.php:22
/home/lernhart/work/shopware/app-php-sdk/tests/Shop/ShopResolverTest.php:45
.

FAILURES!

[Killed] FunctionCallRemoval
Shop/ShopResolver.php:62:9
      */
     private function resolveFromQueryString(RequestInterface $request): ShopInterface
     {
-        \parse_str($request->getUri()->getQuery(), $query);
+        
 
         if (!isset($query['shop-id']) || !\is_string($query['shop-id'])) {
killedBy: Shopware\App\SDK\Tests\Shop\ShopResolverTest::testResolveQueryStringNotExisting
statusReason: 1) Shopware\App\SDK\Tests\Shop\ShopResolverTest::testResolveQueryStringNotExisting
Failed asserting that exception of type "Shopware\App\SDK\Exception\MissingShopParameterException" matches expected exception "Shopware\App\SDK\Exception\ShopNotFoundException". Message was: "Missing shop parameters" at
/home/lernhart/work/shopware/app-php-sdk/src/Shop/ShopResolver.php:53
/home/lernhart/work/shopwar

[Killed] LogicalNot
Shop/ShopResolver.php:64:9
     {
         \parse_str($request->getUri()->getQuery(), $query);
 
-        if (!isset($query['shop-id']) || !\is_string($query['shop-id'])) {
+        if (!isset($query['shop-id']) || \is_string($query['shop-id'])) {
             throw new MissingShopParameterException();
         }
killedBy: Shopware\App\SDK\Tests\Shop\ShopResolverTest::testResolveQueryStringNotExisting
statusReason: 1) Shopware\App\SDK\Tests\Shop\ShopResolverTest::testResolveQueryStringNotExisting
Failed asserting that exception of type "Shopware\App\SDK\Exception\MissingShopParameterException" matches expected exception "Shopware\App\SDK\Exception\ShopNotFoundException". Message was: "Missing shop parameters" at
/home/lernhart/work/shopware/app-php-sdk/src/Shop/ShopResolver.php:53
/home/lernhart/work/shopwar

[Killed] LogicalNot
Shop/ShopResolver.php:64:9
     {
         \parse_str($request->getUri()->getQuery(), $query);
 
-        if (!isset($query['shop-id']) || !\is_string($query['shop-id'])) {
+        if (isset($query['shop-id']) || !\is_string($query['shop-id'])) {
             throw new MissingShopParameterException();
         }
killedBy: Shopware\App\SDK\Tests\Shop\ShopResolverTest::testResolveFromQueryStringRequestIsAuthenticated
statusReason: 1) Shopware\App\SDK\Tests\Shop\ShopResolverTest::testResolveQueryStringNotExisting
Failed asserting that exception of type "Shopware\App\SDK\Exception\MissingShopParameterException" matches expected exception "Shopware\App\SDK\Exception\ShopNotFoundException". Message was: "Missing shop parameters" at
/home/lernhart/work/shopware/app-php-sdk/src/Shop/ShopResolver.php:53
/home/lernhart/work/shopwar

[Killed] Throw_
Shop/ShopResolver.php:65:13
         \parse_str($request->getUri()->getQuery(), $query);
 
         if (!isset($query['shop-id']) || !\is_string($query['shop-id'])) {
-            throw new MissingShopParameterException();
+            new MissingShopParameterException();
         }
 
killedBy: Shopware\App\SDK\Tests\Shop\ShopResolverTest::testResolveQueryStringInvalid
statusReason: 1) Shopware\App\SDK\Tests\Shop\ShopResolverTest::testResolveQueryStringInvalid
/home/lernhart/work/shopware/app-php-sdk/src/Test/MockShopRepository.php:27
/home/lernhart/work/shopware/app-php-sdk/src/Shop/ShopResolver.php:55
/home/lernhart/work/shopware/app-php-sdk/src/Shop/ShopResolver.php:24
/home/lernhart/work/shopware/app-php-sdk/tests/Shop/ShopResolverTest.php:58
.

[Killed] Throw_
Shop/ShopResolver.php:71:13
         $shop = $this->shopRepository->getShopFromId($query['shop-id']);
 
         if ($shop === null) {
-            throw new ShopNotFoundException($query['shop-id']);
+            new ShopNotFoundException($query['shop-id']);
         }
 
killedBy: Shopware\App\SDK\Tests\Shop\ShopResolverTest::testResolveQueryStringNotExisting
statusReason: 1) Shopware\App\SDK\Tests\Shop\ShopResolverTest::testResolveQueryStringNotExisting
/home/lernhart/work/shopware/app-php-sdk/src/Shop/ShopResolver.php:59
/home/lernhart/work/shopware/app-php-sdk/src/Shop/ShopResolver.php:24
/home/lernhart/work/shopware/app-php-sdk/tests/Shop/ShopResolverTest.php:65
.

FAILURES!

[Killed] MethodCallRemoval
Shop/ShopResolver.php:74:9
             throw new ShopNotFoundException($query['shop-id']);
         }
 
-        $this->requestVerifier->authenticateGetRequest($request, $shop);
+        
 
         return $shop;
killedBy: Shopware\App\SDK\Tests\Shop\ShopResolverTest::testResolveFromQueryStringRequestIsAuthenticated
statusReason: 1) Shopware\App\SDK\Tests\Shop\ShopResolverTest::testResolveFromQueryStringRequestIsAuthenticated
Expectation failed for method name is "authenticateGetRequest" when invoked 1 time(s).
Method was expected to be called 1 times, actually called 0 times.

FAILURES!
Tests: 6, Assertions: 8, Failures: 1.
