[Killed] PublicVisibility
TaxProvider/TaxProviderResponseBuilder.php:31:5
     {
     }
 
-    public function addLineItemTax(string $uniqueIdentifier, CalculatedTax $tax): self
+    protected function addLineItemTax(string $uniqueIdentifier, CalculatedTax $tax) : self
     {
         $this->lineItemTaxes[$uniqueIdentifier][] = $tax;
killedBy: Shopware\App\SDK\Tests\TaxProvider\TaxProviderResponseBuilderTest::testLineItemTax
statusReason: 1) Shopware\App\SDK\Tests\TaxProvider\TaxProviderResponseBuilderTest::testLineItemTax
Error: Call to protected method Shopware\App\SDK\TaxProvider\TaxProviderResponseBuilder::addLineItemTax() from scope Shopware\App\SDK\Tests\TaxProvider\TaxProviderResponseBuilderTest

/home/lernhart/work/shopware/app-php-sdk/tests/TaxProvider/TaxProviderResponseBuilderTest.php:33

--

There was 1 risky test:

[Killed] PublicVisibility
TaxProvider/TaxProviderResponseBuilder.php:37:5
         return $this;
     }
 
-    public function addDeliveryTax(string $uniqueIdentifier, CalculatedTax $tax): self
+    protected function addDeliveryTax(string $uniqueIdentifier, CalculatedTax $tax) : self
     {
         $this->deliveryTaxes[$uniqueIdentifier][] = $tax;
killedBy: Shopware\App\SDK\Tests\TaxProvider\TaxProviderResponseBuilderTest::testDeliveryTax
statusReason: 1) Shopware\App\SDK\Tests\TaxProvider\TaxProviderResponseBuilderTest::testDeliveryTax
Error: Call to protected method Shopware\App\SDK\TaxProvider\TaxProviderResponseBuilder::addDeliveryTax() from scope Shopware\App\SDK\Tests\TaxProvider\TaxProviderResponseBuilderTest

/home/lernhart/work/shopware/app-php-sdk/tests/TaxProvider/TaxProviderResponseBuilderTest.php:47

--

There was 1 risky test:

[Killed] PublicVisibility
TaxProvider/TaxProviderResponseBuilder.php:43:5
         return $this;
     }
 
-    public function addCartTax(CalculatedTax $tax): self
+    protected function addCartTax(CalculatedTax $tax) : self
     {
         $this->cartPriceTaxes[] = $tax;
killedBy: Shopware\App\SDK\Tests\TaxProvider\TaxProviderResponseBuilderTest::testBuildPayload
statusReason: 1) Shopware\App\SDK\Tests\TaxProvider\TaxProviderResponseBuilderTest::testBuildPayload
Error: Call to protected method Shopware\App\SDK\TaxProvider\TaxProviderResponseBuilder::addCartTax() from scope Shopware\App\SDK\Tests\TaxProvider\TaxProviderResponseBuilderTest

/home/lernhart/work/shopware/app-php-sdk/tests/TaxProvider/TaxProviderResponseBuilderTest.php:61

2) Shopware\App\SDK\Tests\TaxProvid

[Killed] PublicVisibility
TaxProvider/TaxProviderResponseBuilder.php:50:5
         return $this;
     }
 
-    public function buildPayload(): string
+    protected function buildPayload() : string
     {
         return \json_encode(get_object_vars($this), JSON_THROW_ON_ERROR);
killedBy: Shopware\App\SDK\Tests\TaxProvider\TaxProviderResponseBuilderTest::testBuildPayload
statusReason: 1) Shopware\App\SDK\Tests\TaxProvider\TaxProviderResponseBuilderTest::testBuildPayload
Error: Call to protected method Shopware\App\SDK\TaxProvider\TaxProviderResponseBuilder::buildPayload() from scope Shopware\App\SDK\Tests\TaxProvider\TaxProviderResponseBuilderTest

/home/lernhart/work/shopware/app-php-sdk/tests/TaxProvider/TaxProviderResponseBuilderTest.php:63

--

There was 1 risky test:

[Killed] PublicVisibility
TaxProvider/TaxProviderResponseBuilder.php:55:5
         return \json_encode(get_object_vars($this), JSON_THROW_ON_ERROR);
     }
 
-    public function build(): ResponseInterface
+    protected function build() : ResponseInterface
     {
         $psrFactory = new Psr17Factory();
killedBy: Shopware\App\SDK\Tests\TaxProvider\TaxProviderResponseBuilderTest::testLineItemTax
statusReason: 1) Shopware\App\SDK\Tests\TaxProvider\TaxProviderResponseBuilderTest::testLineItemTax
Error: Call to protected method Shopware\App\SDK\TaxProvider\TaxProviderResponseBuilder::build() from scope Shopware\App\SDK\Tests\TaxProvider\TaxProviderResponseBuilderTest

/home/lernhart/work/shopware/app-php-sdk/tests/TaxProvider/TaxProviderResponseBuilderTest.php:35

2) Shopware\App\SDK\Tests\TaxProvider\Tax

[Killed] DecrementInteger
TaxProvider/TaxProviderResponseBuilder.php:59:9
     {
         $psrFactory = new Psr17Factory();
 
-        return $psrFactory->createResponse(200)
+        return $psrFactory->createResponse(199)->withHeader('Content-Type', 'application/json')->withBody($psrFactory->createStream($this->buildPayload()));
             ->withHeader('Content-Type', 'application/json')
             ->withBody($psrFactory->createStream($this->buildPayload()));
killedBy: Shopware\App\SDK\Tests\TaxProvider\TaxProviderResponseBuilderTest::testLineItemTax
statusReason: 1) Shopware\App\SDK\Tests\TaxProvider\TaxProviderResponseBuilderTest::testLineItemTax
Failed asserting that 199 is identical to 200.

/home/lernhart/work/shopware/app-php-sdk/tests/TaxProvider/TaxProviderResponseBuilderTest.php:37

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] IncrementInteger
TaxProvider/TaxProviderResponseBuilder.php:59:9
     {
         $psrFactory = new Psr17Factory();
 
-        return $psrFactory->createResponse(200)
+        return $psrFactory->createResponse(201)->withHeader('Content-Type', 'application/json')->withBody($psrFactory->createStream($this->buildPayload()));
             ->withHeader('Content-Type', 'application/json')
             ->withBody($psrFactory->createStream($this->buildPayload()));
killedBy: Shopware\App\SDK\Tests\TaxProvider\TaxProviderResponseBuilderTest::testLineItemTax
statusReason: 1) Shopware\App\SDK\Tests\TaxProvider\TaxProviderResponseBuilderTest::testLineItemTax
Failed asserting that 201 is identical to 200.

/home/lernhart/work/shopware/app-php-sdk/tests/TaxProvider/TaxProviderResponseBuilderTest.php:37

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.
